{
  "1": {
    "1.1": {
      "episode": "monkey see, doggie do",
      "description": "In \"Monkey See, Doggie Do\", Mojo Jojo swipes some cursed artifacts from the Townsville Museum and using them, turns all of the people of Townsville and then the whole world into dogs.",
      "imdbLink": "/title/tt1005607/?ref_=ttep_ep1",
      "word_count_for_line": 803
    },
    "1.2": {
      "episode": "mommy fearest",
      "description": "In \"Mommy Fearest\", the Professor falls for a mysterious woman who grounds the girls and bans them from staying up late to save the day. But it turns out that she is one of their many antagonists, Sedusa.",
      "imdbLink": "/title/tt1005607/?ref_=ttep_ep1",
      "word_count_for_line": 1079
    },
    "2.1": {
      "episode": "insect inside",
      "description": "The city of Townsville becomes overrun by millions of cockroaches, led by their leader Roach Coach. The Powerpuff Girls must fight their fear of bugs in order to save the city.",
      "imdbLink": "/title/tt0677591/?ref_=ttep_ep2",
      "word_count_for_line": 1036
    },
    "2.2": {
      "episode": "powerpuff bluff",
      "description": "When three criminals named Trevor, John and Bobby disguise themselves as the Powerpuff Girls, the real Powerpuff Girls must try and stop them before they meet their wits' end.",
      "imdbLink": "/title/tt0677591/?ref_=ttep_ep2",
      "word_count_for_line": 1271
    },
    "3.1": {
      "episode": "octi evil",
      "description": "\"Octi-Evil\" Him is out to break up the Powerpuff Girls, and uses Bubbles sweetness to do it via Bubbles' stuffed octopus, Octi.",
      "imdbLink": "/title/tt1005608/?ref_=ttep_ep3",
      "word_count_for_line": 869
    },
    "3.2": {
      "episode": "geshundfight",
      "description": "\"Geshundfight\" The amoeba boys try to commit a crime and accidentally get the whole city of Townsville sick.",
      "imdbLink": "/title/tt1005608/?ref_=ttep_ep3",
      "word_count_for_line": 924
    },
    "4.1": {
      "episode": "buttercrush",
      "description": "\"Buttercrush\" Buttercup develops a crush on Ace, the leader of the Gang Green Gang. They soon take advantage of this to put Blossom and Bubbles into terrible danger.",
      "imdbLink": "/title/tt0677582/?ref_=ttep_ep4",
      "word_count_for_line": 735
    },
    "4.2": {
      "episode": "fuzzy logic",
      "description": "Fuzzy Lumpkins, a strange pink hillbilly-like monster obsessed with keeping his property to himself, goes completely insane after a squirrel trespass on his home. After following it to Townsville, he goes on a massive rampage when everyone touches his stuff. It's up to the Powerpuff Girls to stop him, with some help from the squirrel that caused the whole mess.",
      "imdbLink": "/title/tt0677582/?ref_=ttep_ep4",
      "word_count_for_line": 601
    },
    "5.1": {
      "episode": "boogie frights",
      "description": "In \"Boogie Frights\", the Boogie Man comes up with a plan to forever keep out light in order to operate freely, but the Powerpuff Girls are on the job in a jiffy.",
      "imdbLink": "/title/tt1005605/?ref_=ttep_ep5",
      "word_count_for_line": 1125
    },
    "5.2": {
      "episode": "abracadaver",
      "description": "In \"Abracadaver\", a long-dead resident magician, Al Lusion, comes back to life as a zombie, and the girls have some difficulty in trying to stop him.",
      "imdbLink": "/title/tt1005605/?ref_=ttep_ep5",
      "word_count_for_line": 530
    },
    "6.1": {
      "episode": "telephonies",
      "description": "\"Telephonies\" The Gangreen Gang gets hold of the Powerpuff Girls Hotline and makes crank calls, sending the Girls on a wild goose chase trying to protect the town.",
      "imdbLink": "/title/tt1005609/?ref_=ttep_ep6",
      "word_count_for_line": 928
    },
    "6.2": {
      "episode": "tough love",
      "description": "When Him gets jealous of The Powerpuff Girls' constant attention, he invents an evil gas that spreads around Townsville and causes the citizens to turn against the Girls.",
      "imdbLink": "/title/tt1005609/?ref_=ttep_ep6",
      "word_count_for_line": 813
    },
    "7.1": {
      "episode": "major competition",
      "description": "The Powerpuff Girl's place as crime fighters is taken when Major Man comes to town. The PPGs eventually figure out that Major Man is actually faking disasters just so he can \"save the day.\"",
      "imdbLink": "/title/tt1005606/?ref_=ttep_ep7",
      "word_count_for_line": 940
    },
    "7.2": {
      "episode": "mr. mojo's rising",
      "description": "",
      "imdbLink": "/title/tt1005606/?ref_=ttep_ep7",
      "word_count_for_line": 981
    },
    "8.1": {
      "episode": "paste makes waste",
      "description": "One of the Pokey Oaks Kindergarten students has a bad habit of eating glue and Buttercup just can't resist picking on him for this. But when he accidentally eats some radioactive glue and turns into a giant glue monster, it's up to Buttercup to apologize for her behavior toward him to reverse the process.",
      "imdbLink": "/title/tt0788760/?ref_=ttep_ep8",
      "word_count_for_line": 764
    },
    "8.2": {
      "episode": "ice sore",
      "description": "In \"Ice Sore\", during an intense heat wave, Blossom develops a new superpower, one that makes her sisters jealous, but her schoolmates popular with her: ice breath.",
      "imdbLink": "/title/tt0788760/?ref_=ttep_ep8",
      "word_count_for_line": 962
    },
    "9.1": {
      "episode": "bubblevicious",
      "description": "Bubbles is tired of being the cute and wants to be \"hard-core,\" but she takes it a little too far.",
      "imdbLink": "/title/tt1048799/?ref_=ttep_ep9",
      "word_count_for_line": 854
    },
    "9.2": {
      "episode": "the bare facts",
      "description": "The girls tell a naked Mayor how they rescued him from Mojo Jojo from their point of view.",
      "imdbLink": "/title/tt1048799/?ref_=ttep_ep9",
      "word_count_for_line": 1634
    },
    "10.1": {
      "episode": "cat man do",
      "description": "The Girls save an innocent little Kitty from the clutches of an evil villain. Eventually they learn that Kitty is the true villain when he hypnotizes the Professor in an evil plot to take over the world.",
      "imdbLink": "/title/tt1048800/?ref_=ttep_ep10",
      "word_count_for_line": 704
    },
    "10.2": {
      "episode": "impeach fuzz",
      "description": "After the Mayor loses the election to Fuzzy Lumpkins, the girls have to step in and restore the Mayor's faded glory and save Townsville from Fuzzy's own selfish ways.",
      "imdbLink": "/title/tt1048800/?ref_=ttep_ep10",
      "word_count_for_line": 785
    },
    "11.1": {
      "episode": "just another manic mojo",
      "description": "Mojo Jojo's morning routine is disrupted by the Powerpuff Girls when their ball that they are playing with ends up in his lair. Mojo then uses this opportunity to try and eliminate his nemeses for good.",
      "imdbLink": "/title/tt1048802/?ref_=ttep_ep11",
      "word_count_for_line": 1140
    },
    "11.2": {
      "episode": "mime for a change",
      "description": "Rainbow the Clown is accidentally transformed by bleach into an evil mime who can eliminate color and sound.",
      "imdbLink": "/title/tt1048802/?ref_=ttep_ep11",
      "word_count_for_line": 795
    },
    "12.": {
      "episode": "the rowdyruff boys",
      "description": "Mojo Jojo is so outraged at his constant defeats against the Powerpuff Girls that he decides to beat them at their own games, by creating The Rowdyruff Boys, who prove superior fighters to the girls.",
      "imdbLink": "/title/tt0677599/?ref_=ttep_ep12",
      "word_count_for_line": 1086
    },
    "13.": {
      "episode": "uh oh dynamo",
      "description": "Worried about his little girls' safety, the Professor creates Powerpuff Dynamo, a state-of-the-art protection system.",
      "imdbLink": "/title/tt1048803/?ref_=ttep_ep13",
      "word_count_for_line": 613
    }
  },
  "2": {
    "1.1": {
      "episode": "stuck up, up, and away",
      "description": "\"Stuck Up, Up, and Away\" Bratty little Princess comes to town and wants to be a Powerpuff Girl. When she doesn't get what she wants, the Girls will have to pay.",
      "imdbLink": "/title/tt0789619/?ref_=ttep_ep1",
      "word_count_for_line": 1199
    },
    "1.2": {
      "episode": "schoolhouse rocked",
      "description": "A truant officer enlists the Gangreen Gang at Pokey Oaks Kindergarten, and Ms. Keane forbids the girls to fight them at school. Is their career in danger?",
      "imdbLink": "/title/tt0789619/?ref_=ttep_ep1",
      "word_count_for_line": 1207
    },
    "2.1": {
      "episode": "collect her",
      "description": "Lenny Baxter, a rabid fan of Powerpuff Girls memorabilia, collects every bit of Powerpuff stuff available. When he finally has everything, he decides to collect the girls themselves.",
      "imdbLink": "/title/tt1048801/?ref_=ttep_ep2",
      "word_count_for_line": 845
    },
    "2.2": {
      "episode": "supper villain",
      "description": "The Powerpuff Girls are invited to dinner by their next door neighbors, the Smith family, to rather unsuspecting results.",
      "imdbLink": "/title/tt1048801/?ref_=ttep_ep2",
      "word_count_for_line": 1011
    },
    "3.1": {
      "episode": "birthday bash",
      "description": "It's the Girls birthday, and they must deal with destructive gifts from their main enemies: Mojo Jojo, Princess the Amoeba Boys, and Him.",
      "imdbLink": "/title/tt0788759/?ref_=ttep_ep3",
      "word_count_for_line": 1057
    },
    "3.2": {
      "episode": "too pooped to puff",
      "description": "Fed up with the citizens taking them for granted, the girls decide to go on strike until the townsfolk learn how to do things themselves.",
      "imdbLink": "/title/tt0788759/?ref_=ttep_ep3",
      "word_count_for_line": 932
    },
    "4.1": {
      "episode": "beat your greens",
      "description": "When Broccoli Aliens from space invade Townsville, it's up to the Powerpuff Girls and all the children to take a bite out of crime.",
      "imdbLink": "/title/tt0677580/?ref_=ttep_ep4",
      "word_count_for_line": 1113
    },
    "4.2": {
      "episode": "down 'n dirty",
      "description": "Buttercup keeps refusing to take a bath, which eventually causes her to get so dirty nobody wants her around anymore. Not even the monsters.",
      "imdbLink": "/title/tt0677580/?ref_=ttep_ep4",
      "word_count_for_line": 477
    },
    "5.1": {
      "episode": "dream scheme",
      "description": "The Sandman would like a little rest, so he puts the world to sleep. The Girls must battle him in his dreams to get things back to normal.",
      "imdbLink": "/title/tt0677585/?ref_=ttep_ep5",
      "word_count_for_line": 1174
    },
    "5.2": {
      "episode": "you snooze, you lose",
      "description": "Mojo Jojo's plans for destroying the Powerpuff Girls fall into the hands of Townsville's lousiest criminals-- the Amoeba Boys.",
      "imdbLink": "/title/tt0677585/?ref_=ttep_ep5",
      "word_count_for_line": 833
    },
    "6.1": {
      "episode": "slave the day",
      "description": "When the Girls save Big Billy's life, he feels forever in their debt, and becomes their slave. When he begins to get in the way of their crime fighting, they allow him to save their lives so he'll finally leave them alone.",
      "imdbLink": "/title/tt0788761/?ref_=ttep_ep6",
      "word_count_for_line": 918
    },
    "6.2": {
      "episode": "los dos mojos",
      "description": "After getting bonked on the head by a construction bar while fighting Mojo Jojo in his ship, Bubbles gets amnesia and believes she is Mojo Jojo.",
      "imdbLink": "/title/tt0788761/?ref_=ttep_ep6",
      "word_count_for_line": 1038
    },
    "7.1": {
      "episode": "a very special blossom",
      "description": "When the Professor wants an expensive gift for Father's Day, Blossom makes the mistake of stealing what she can't afford (Pro-Excellence golf clubs) instead of giving from the heart.",
      "imdbLink": "/title/tt1444630/?ref_=ttep_ep7",
      "word_count_for_line": 1319
    },
    "7.2": {
      "episode": "daylight savings",
      "description": "When the girls get tired during school, Ms. Keane declares a curfew and the Professor must get the girls back on track.",
      "imdbLink": "/title/tt1444630/?ref_=ttep_ep7",
      "word_count_for_line": 936
    },
    "8.1": {
      "episode": "mo job",
      "description": "Princess hires Mojo to devise the perfect plan to destroy the Girls, and they are quite shocked when they find that Princess has powers equal to theirs.",
      "imdbLink": "/title/tt1444631/?ref_=ttep_ep8",
      "word_count_for_line": 756
    },
    "8.2": {
      "episode": "pet feud",
      "description": "The Professor creates a pet called BEEBO, but he explains to the Girls they must only feed him once.",
      "imdbLink": "/title/tt1444631/?ref_=ttep_ep8",
      "word_count_for_line": 760
    },
    "9.1": {
      "episode": "imaginary fiend",
      "description": "A new kid at school proves so unpopular with his classmates that he conjures up an imaginary friend, who turns out to be quite destructive.",
      "imdbLink": "/title/tt0677590/?ref_=ttep_ep9",
      "word_count_for_line": 995
    },
    "9.2": {
      "episode": "cootie gras",
      "description": "One of Pokey Oaks' students develops the cooties and everyone in school, even the Powerpuff Girls, are avoiding him. Mojo Jojo uses the situation to his advantage.",
      "imdbLink": "/title/tt0677590/?ref_=ttep_ep9",
      "word_count_for_line": 644
    },
    "10.1": {
      "episode": "the powerpuff girls' best rainy day adventure ever",
      "description": "It's raining in Townsville and there is no crime or villainy afoot. So the Girls must stay inside and come up with their very own Powerpuff adventure.",
      "imdbLink": "/title/tt1444198/?ref_=ttep_ep10",
      "word_count_for_line": 1376
    },
    "10.2": {
      "episode": "just desserts",
      "description": "The Smiths unite to destroy the Powerpuff Girls after Harold Smith returns from jail and Marianne Smith seeks revenge for her dinner party being ruined.",
      "imdbLink": "/title/tt1444198/?ref_=ttep_ep10",
      "word_count_for_line": 757
    },
    "11.1": {
      "episode": "twisted sister",
      "description": "After finding themselves far too tired after a full day of fighting crime, the girls decide to create a new sibling in order to assist them.",
      "imdbLink": "/title/tt1444628/?ref_=ttep_ep11",
      "word_count_for_line": 762
    },
    "11.2": {
      "episode": "cover up",
      "description": "Buttercup believes her blanket gives her the strength to be a good fighter, but her sisters quickly get on her case.",
      "imdbLink": "/title/tt1444628/?ref_=ttep_ep11",
      "word_count_for_line": 499
    },
    "12.1": {
      "episode": "speed demon",
      "description": "The Girls accidentally fly the speed of light and when they arrive home, everything has changed. Fifty years have passed and the world has been taken over by Him, since the Girls weren't around to defeat him.",
      "imdbLink": "/title/tt1444629/?ref_=ttep_ep12",
      "word_count_for_line": 871
    },
    "12.2": {
      "episode": "mojo jonesin",
      "description": "A multi-ethnic cast of token kids at Pokey Oaks wish they could have the girls' superpowers, and a shifty stranger, who is actually Mojo Jojo, calling himself 'Mojo Overcoat', offers them some Chemical X ... but for a price. ",
      "imdbLink": "/title/tt1444629/?ref_=ttep_ep12",
      "word_count_for_line": 757
    },
    "13.1": {
      "episode": "something's a ms.",
      "description": "Miss Bellum is acting very strange lately. And she keeps showing up at crime scenes. It turns out that Sedusa is back, has kidnapped Ms. Bellum and has been impersonating her in order to steal money and jewels.",
      "imdbLink": "/title/tt0677597/?ref_=ttep_ep13",
      "word_count_for_line": 1092
    },
    "13.2": {
      "episode": "slumbering with the enemy",
      "description": "The Powerpuff Girls throw a slumber party and invite every girl in their school. Mojo Jojo steals the final invitation and comes to the party dressed up as Moejisha. When the Girls catch on, 'Moejisha seems like she just wants to party, or is she planning a ruse to get rid of them?",
      "imdbLink": "/title/tt0677597/?ref_=ttep_ep13",
      "word_count_for_line": 453
    }
  },
  "3": {
    "1.1": {
      "episode": "fallen arches",
      "description": "A gang of old-time villains come out of retirement when they discover the town is being protected by little girls. When the Girls realize that they can't fight their elders, they must enlist the best superhero team of the past to save the city.",
      "imdbLink": "/title/tt0677586/?ref_=ttep_ep1",
      "word_count_for_line": 1175
    },
    "1.2": {
      "episode": "the mane event",
      "description": "After Buttercup unwittingly rips one of Blossom's knots, Bubbles along with Buttercup give her a bad haircut. She gets ridiculed by everybody in the city, when an all-seeing monster appears.",
      "imdbLink": "/title/tt0677586/?ref_=ttep_ep1",
      "word_count_for_line": 695
    },
    "2.1": {
      "episode": "town and out",
      "description": "When the Professor gets a new job, the Girls have to move to a new town. They try to make the best of it, but it's just not the same. In fact, it's awful.",
      "imdbLink": "/title/tt1486134/?ref_=ttep_ep2",
      "word_count_for_line": 935
    },
    "2.2": {
      "episode": "child fearing",
      "description": "The Professor hires a babysitter to look after the girls on short notice. When Mojo takes the job, he gets annoyed by the girls' antics.",
      "imdbLink": "/title/tt1486134/?ref_=ttep_ep2",
      "word_count_for_line": 828
    },
    "3.": {
      "episode": "criss cross crisis",
      "description": "A failed experiment on the Professor's part causes everyone in Townsville to switch bodies around. Mojo Jojo, also switched, tries to use the situation to his advantage.",
      "imdbLink": "/title/tt1351029/?ref_=ttep_ep3",
      "word_count_for_line": 1961
    },

    "4.1": {
      "episode": "bubblevision",
      "description": "Bubbles fighting has been really terribly lately and the Professor discovers that she needs glasses. Bubbles is humiliated by these huge, horrible things and never wants to see or be seen again.",
      "imdbLink": "/title/tt1485631/?ref_=ttep_ep4",
      "word_count_for_line": 701
    },
    "4.2": {
      "episode": "bought and scold",
      "description": "Daddy Morbucks buys Townsville from the Mayor for Princess Morbucks with a room of sweets (Turkish delight to be exact), and her first act as the new Mayor is to legalize crime, putting the girls in an ethical and legal dilemma.",
      "imdbLink": "/title/tt1485631/?ref_=ttep_ep4",
      "word_count_for_line": 1100
    },
    "5.1": {
      "episode": "gettin' twiggy with it",
      "description": "Mitch is told to take care of Twiggy, the class hamster for the weekend. But the Girls don't trust him and follow him home. When Mitch flushes Twiggy down the toilet, the Girls are about to attack, but Twiggy emerges bigger and badder than ever.",
      "imdbLink": "/title/tt0677588/?ref_=ttep_ep5",
      "word_count_for_line": 472
    },
    "5.2": {
      "episode": "cop out",
      "description": "Lazy and incompent Townsville police officer Mike Brikowski gets fired by the police chief for slacking off on the job to eat donuts all the time, while the Powerpuff Girls handle everything and Brikowski vows revenge on the girls for his dismissal.",
      "imdbLink": "/title/tt0677588/?ref_=ttep_ep5",
      "word_count_for_line": 897
    },
    "6.1": {
      "episode": "three girls and a monster",
      "description": "The Girls are once again in a furious battle with a ferocious monster. But Blossom and Buttercup can't agree on how to fight the beast and Bubbles just wants everyone to get along.",
      "imdbLink": "/title/tt1485647/?ref_=ttep_ep6",
      "word_count_for_line": 524
    },
    "6.2": {
      "episode": "monkey see, doggie two",
      "description": "Mojo decides to repeat past mistakes and brush off his plan from Monkey See, Doggie Do.",
      "imdbLink": "/title/tt1485647/?ref_=ttep_ep6",
      "word_count_for_line": 845
    },
    "7.1": {
      "episode": "jewel of the aisle",
      "description": "A crook hides a huge diamond in a box of the Girls favorite cereal. He must figure out how to trick the Girls into giving him some cereal and getting the jewel back.",
      "imdbLink": "/title/tt1485637/?ref_=ttep_ep7",
      "word_count_for_line": 720
    },
    "7.2": {
      "episode": "super zeroes",
      "description": "In their attempts to be better heroes, the Girls decide to take inspiration from their favorite comics, only to become better zeroes.",
      "imdbLink": "/title/tt1485637/?ref_=ttep_ep7",
      "word_count_for_line": 1279
    },
    "8.1": {
      "episode": "candy is dandy",
      "description": "When the Mayor gives the Girls some candy as a thank you for saving the day, the Girls become hooked on the stuff. They make a deal with a local villain to commit crimes just so they can get their treat.",
      "imdbLink": "/title/tt1485632/?ref_=ttep_ep8",
      "word_count_for_line": 765
    },
    "8.2": {
      "episode": "catastrophe",
      "description": "The girls fight a giant blob monster who proves impervious to all their attacks.",
      "imdbLink": "/title/tt1485632/?ref_=ttep_ep8",
      "word_count_for_line": 457
    },
    "9.1": {
      "episode": "hot air buffoon",
      "description": "The Mayor realizes that the Girls are doing all the work in his city for him. So he mans a hot air balloon and starts fighting crime the old fashioned way.",
      "imdbLink": "/title/tt1485636/?ref_=ttep_ep9",
      "word_count_for_line": 1122
    },
    "9.2": {
      "episode": "ploys r' us",
      "description": "When the Professor starts sleepwalking and begins stealing toys for the girls, the girls gladly allow him to continue rather than report it.",
      "imdbLink": "/title/tt1485636/?ref_=ttep_ep9",
      "word_count_for_line": 803
    },
    "10.2": {
      "episode": "equal fights",
      "description": "There's a mysterious villain in town who's sucking pertinent information from the brains of powerful people and committing crimes. How do the Girls trap this sucker before his next victim is drained?",
      "imdbLink": "/title/tt1392928/?ref_=ttep_ep10",
      "word_count_for_line": 1255
    },
    "11.": {
      "episode": "powerprof.",
      "description": "The Girls are so busy fighting crime that the Professor doesn't get to see them anymore. He creates a super suit for himself so he can fight crime with them. The Girls are having a great time with their dad until he starts cramping their superhero style.",
      "imdbLink": "/title/tt1486132/?ref_=ttep_ep11",
      "word_count_for_line": 878
    },
    "12.1": {
      "episode": "moral decay",
      "description": "When Buttercup accidentally knocks out Bubbles' tooth, she learns that tooth decay does pay and soon goes on a spree knocking out teeth and collecting the cash.",
      "imdbLink": "/title/tt1485642/?ref_=ttep_ep12",
      "word_count_for_line": 867
    },
    "12.2": {
      "episode": "meet the beat-alls",
      "description": "Mojo Jojo, Princess Morbucks, Fuzzy Lumpkins, and HIM join forces to create the supervillain group called 'The Beat-Alls'. This episode has many references to the real life rock band The Beatles.",
      "imdbLink": "/title/tt1485642/?ref_=ttep_ep12",
      "word_count_for_line": 1472
    },
    "13.1": {
      "episode": "helter shelter",
      "description": "Bubbles has a habit of saving helpless animals and the Professor is sick of it. When Bubbles brings a baby whale home, she and her sisters have a whale of a time hiding this new addition.",
      "imdbLink": "/title/tt1485635/?ref_=ttep_ep13",
      "word_count_for_line": 941
    },
    "13.2": {
      "episode": "power lunch",
      "description": "After feeling a side effect from eating and drinking sweets combined with the Girls' heat ray, the Gangreen Gang get superpowers. Now, it's superpowered good girls versus superpowered bad teens.",
      "imdbLink": "/title/tt1485635/?ref_=ttep_ep13",
      "word_count_for_line": 589
    }
  },
  "4": {
    "1.": {
      "episode": "film flam",
      "description": "A sleazy director comes to Townsville ready to make a film about the Girls saving the day in their city. But this Hollywood-type wants more from Townsville than an Oscar winning film.",
      "imdbLink": "/title/tt1457550/?ref_=ttep_ep1",
      "word_count_for_line": 2281
    },
    "2.": {
      "episode": "all chalked up",
      "description": "Him tricks Bubbles into bringing her chalk drawings to life, who then reek havoc on Townsville.",
      "imdbLink": "/title/tt0677579/?ref_=ttep_ep2",
      "word_count_for_line": 992
    },
    "3.": {
      "episode": "get back, jojo",
      "description": "It is Career Day at Pokey Oaks, and the Professor shows to the class a time machine and explains how he got into science and created the Powerpuff Girls. But Mojo Jojo overhears everything and uses the machine to go back in time to that specific time period in order to prevent him from getting into science at all costs. But the Powerpuff Girls also go back in time and are hot on Mojo's trail.",
      "imdbLink": "/title/tt0677587/?ref_=ttep_ep3",
      "word_count_for_line": 2158
    },
    "4.": {
      "episode": "him diddle riddle",
      "description": "The powerpuff girls must solve a series of riddles by Him to prevent the Professor having to \"pay.\" The entire episode is in real time.",
      "imdbLink": "/title/tt1450024/?ref_=ttep_ep4",
      "word_count_for_line": 1394
    },
    "5.": {
      "episode": "members only",
      "description": "When the Girls try to join the all-male superhero organization, they learn that sometimes supermen aren't so super.",
      "imdbLink": "/title/tt0677595/?ref_=ttep_ep5",
      "word_count_for_line": 2092
    },
    "6.": {
      "episode": "knock it off",
      "description": "When the Professor's college roommate sees his brilliant creations, he decides to cash in on the popularity of the Powerpuffs.",
      "imdbLink": "/title/tt0677593/?ref_=ttep_ep6",
      "word_count_for_line": 1809
    },
    "7.": {
      "episode": "superfriends",
      "description": "The new girl next door learns its hard to be best friends with superheroes and soon starts hanging out with the wrong kind of kid-Princess.",
      "imdbLink": "/title/tt0677598/?ref_=ttep_ep7",
      "word_count_for_line": 2054
    },
    "8.": {
      "episode": "nano of the north",
      "description": "It's raining in Townsville, but this is more than just rain. These drops are really microscopic robots tearing apart the city and the Girls must fight with these creatures on their own level.",
      "imdbLink": "/title/tt1457552/?ref_=ttep_ep8",
      "word_count_for_line": 1332
    },
    "9.": {
      "episode": "stray bullet",
      "description": "In order to save an innocent squirrel, Bubbles gives him a dash of Chemical X, giving him some super squirrel powers.",
      "imdbLink": "",
      "word_count_for_line": 990
    },
    "10.": {
      "episode": "forced kin",
      "description": "A terrible, evil menace from outer space descends upon Townsville. The Girls must fight evil with evil but to do so they seek the advice of ...Mojo Jojo.",
      "imdbLink": "/title/tt1166947/?ref_=ttep_ep9",
      "word_count_for_line": 1662
    },

    "11.1": {
      "episode": "keen on keane",
      "description": "It's Valentine's Day and the Girls notice that Ms. Keane is all alone. Time for a little matchmaking. But who will the lucky fella be?\"",
      "imdbLink": "/title/tt1457551/?ref_=ttep_ep10",
      "word_count_for_line": 1165
    },
    "11.2": {
      "episode": "not so awesome blossom",
      "description": "Even superheroes have bad days. Blossom, for unknown reasons, loses her confidence and intelligence and becomes a jinx. When Buttercup destroys Mojo Jojo’s robots, she takes Blossom's role as the leader. Meanwhile, Mojo, using Blossom's situation, kidnaps Bubbles, Buttercup, and Professor Utonium. But will Blossom regain her leadership?",
      "imdbLink": "/title/tt0677592/?ref_=ttep_ep11",
      "word_count_for_line": 1059
    },
    "12.": {
      "episode": "power-noia",
      "description": "The Girls have become paralyzed by their greatest fears. Who could be behind such an evil trick?",
      "imdbLink": "/title/tt1486131/?ref_=ttep_ep12",
      "word_count_for_line": 1595
    }
  },
  "5": {
    "1.1": {
      "episode": "monstra-city",
      "description": "When all the Monsters move from Monster Isle to Townsville it's up to the Girls to keep the peace.",
      "imdbLink": "/title/tt0677596/?ref_=ttep_ep1",
      "word_count_for_line": 1035
    },
    "1.2": {
      "episode": "shut the pup up",
      "description": "After witnessing a crime, the Talking Dog is sent to the Powerpuff Girls' home by an FBI agent as part of a witness protection program. The girls try to have him speak about the crime, but he just unknowingly insults everyone for some days.",
      "imdbLink": "/title/tt0677596/?ref_=ttep_ep1",
      "word_count_for_line": 1546
    },
    "2.1": {
      "episode": "toast of the town",
      "description": "When the Mayor rubs on Chemical X on his head for hair growth, all of him grows and stomps through Townsville.",
      "imdbLink": "/title/tt1485648/?ref_=ttep_ep2",
      "word_count_for_line": 819
    },
    "2.2": {
      "episode": "divide and conquer",
      "description": "After stealing an orange and watching it divide, The Amoeba Boys learn how to make more of themselves.﻿ In order to stop them, the girls must use their math skills to save the day.",
      "imdbLink": "/title/tt1485648/?ref_=ttep_ep2",
      "word_count_for_line": 797
    },
    "3.1": {
      "episode": "burglar alarmed",
      "description": "A new burglar comes to Townsville and his first robbery is at the house of...The Powerpuff Girls?",
      "imdbLink": "/title/tt0677581/?ref_=ttep_ep3",
      "word_count_for_line": 859
    },
    "3.2": {
      "episode": "shotgun wedding",
      "description": "Professor Utonium gets up close with Fuzzy Lumpkins for some research on his mysterious species, but all goes wrong, when his subject spots him, trespassing on his property.",
      "imdbLink": "/title/tt0677581/?ref_=ttep_ep3",
      "word_count_for_line": 839
    },
    "4.1": {
      "episode": "save mojo",
      "description": "An animal activist group sets out to protect Mojo, ensuring that he can behave like the naturally evil monkey that he is.",
      "imdbLink": "/title/tt1150765/?ref_=ttep_ep4",
      "word_count_for_line": 894
    },
    "4.2": {
      "episode": "substitute creature",
      "description": "Ms. Keane is out sick and her substitute, Mr. Green is a suspicious-looking character, that gives the girls some bad vibes.",
      "imdbLink": "/title/tt1150765/?ref_=ttep_ep4",
      "word_count_for_line": 970
    },
    "5.": {
      "episode": "the boys are back in town",
      "description": "Him brings the Rowdyruff Boys back, protecting them from the Girls' feminine wiles.",
      "imdbLink": "/title/tt1486133/?ref_=ttep_ep5",
      "word_count_for_line": 2031
    },

    "6.1": {
      "episode": "pee pee g's",
      "description": "When the Girls wake up to discover their bed is wet, none want to admit that they are the guilty party.",
      "imdbLink": "/title/tt1485644/?ref_=ttep_ep6",
      "word_count_for_line": 1093
    },
    "6.2": {
      "episode": "boy toys",
      "description": "Princess Morbucks tries to team up with the Rowdyruff Boys to beat the girls at their own game. However, after being rejected, she was reluctantly invited as a member of the Powerpuff Girls to defeat the Rowdyruff Boys.",
      "imdbLink": "/title/tt1485644/?ref_=ttep_ep6",
      "word_count_for_line": 920
    },
    "7.": {
      "episode": "see me, feel me, gnomey",
      "description": "In this musical, the girls are outmatched by Townsville's villains. They turn to Gnomey to bring peace to Townsville in exchange for their powers, but, when the city falls under the rule of Communism, it's up to the girls to stop him.",
      "imdbLink": "/title/tt0821359/?ref_=ttep_ep7",
      "word_count_for_line": 1706
    },

    "8.1": {
      "episode": "seed no evil",
      "description": "When a prehistoric Caveman thaws out in Townsville, the Girls must stop him from stealing the Mayor's seeds.",
      "imdbLink": "/title/tt0865196/?ref_=ttep_ep8",
      "word_count_for_line": 647
    },
    "8.2": {
      "episode": "city of clipsville",
      "description": "A clip show episode of the past four seasons, which features some clips that actually did not happen.",
      "imdbLink": "/title/tt0865196/?ref_=ttep_ep8",
      "word_count_for_line": 880
    },
    "9.1": {
      "episode": "a documentary",
      "description": "A film student attempts to do a documentary on the Powerpuff Girls and learns that catching these superheroes at rest is harder than he thought.",
      "imdbLink": "/title/tt0677584/?ref_=ttep_ep9",
      "word_count_for_line": 1513
    },
    "9.2": {
      "episode": "girls gone mild",
      "description": "After being complained about by Stanley and Sandra Practice (and their campaign, P.A.P.P. - Parents Against Powerpuffs), the Girls must stop fighting crime by kicks, punches, flying and other superpowers (with the exception of supervision). Day by day, the crime rates in Townsville are becoming more immense. Will they ever be able to use their powers again?",
      "imdbLink": "/title/tt0677584/?ref_=ttep_ep9",
      "word_count_for_line": 1010
    },
    "11.1": {
      "episode": "lying around the house",
      "description": "The Girls tell little white lies that turn into a big, bad problem.",
      "imdbLink": "/title/tt1485639/?ref_=ttep_ep11",
      "word_count_for_line": 987
    },
    "11.2": {
      "episode": "bubble boy",
      "description": "After Boomer is captured by the girls, Bubbles goes undercover as Boomer to track down Brick and Butch.",
      "imdbLink": "/title/tt1485639/?ref_=ttep_ep11",
      "word_count_for_line": 1139
    },
    "13.1": {
      "episode": "curses",
      "description": "Bubbles begins to repeat some of the Professor's bad language.",
      "imdbLink": "/title/tt1485633/?ref_=ttep_ep13",
      "word_count_for_line": 1247
    },
    "13.2": {
      "episode": "bang for your buck",
      "description": "The girls compete against the Gangreen Gang to see who can save enough money to buy a destructo ray from Mojo's garage sale.",
      "imdbLink": "/title/tt1485633/?ref_=ttep_ep13",
      "word_count_for_line": 168
    },
    "14.1": {
      "episode": "silent treatment",
      "description": "The girls are pulled into a silent movie by an old time villain from the film. ",
      "imdbLink": "/title/tt1485646/?ref_=ttep_ep14",
      "word_count_for_line": 702
    },
    "14.2": {
      "episode": "sweet 'n sour",
      "description": "The girls have to fight Townsville's newest criminal gang - a group of cuddly little animals.",
      "imdbLink": "/title/tt1485646/?ref_=ttep_ep14",
      "word_count_for_line": 926
    }
  },
  "6": {
    "1.1": {
      "episode": "prime mates",
      "description": "Back when Mojo Jojo tried to take over the world with primates, there was one monkey who didn't get his due-Mopey Popo. Now Mopey is back to try and be evil just as Mojo intended.",
      "imdbLink": "/title/tt1485645/?ref_=ttep_ep1",
      "word_count_for_line": 32
    },
    "1.2": {
      "episode": "coupe d'etat",
      "description": "Professor Utonium upgrades his car, and makes it into a Kinetic Automatic Robotic Roadster, or a 'K.A.R.R.' for short. The girls realize that K.A.R.R is taking the Professor away from them, both figuratively and literally.",
      "imdbLink": "/title/tt1485645/?ref_=ttep_ep1",
      "word_count_for_line": 228
    },
    "2.1": {
      "episode": "makes zen to me",
      "description": "When Buttercup gets a fortune cookie saying that \"Peace Lies Within\" the most violent of Powerpuffs sets out on a quest for inner peace.",
      "imdbLink": "/title/tt1485640/?ref_=ttep_ep2",
      "word_count_for_line": 423
    },
    "2.2": {
      "episode": "say uncle",
      "description": "The girls’ uncle comes to visit, but they mistakenly take a taffy-loving Sasquatch home.",
      "imdbLink": "/title/tt1485640/?ref_=ttep_ep2",
      "word_count_for_line": 940
    },
    "3.1": {
      "episode": "reeking havoc",
      "description": "This year, the Professor's submission for the 2nd Annual Townsville Chili Cookoff is X-tra Special, but this X-tra Special ingredient doesn't settle well with Townsville's tummies.",
      "imdbLink": "/title/tt1093703/?ref_=ttep_ep3",
      "word_count_for_line": 805
    },
    "3.2": {
      "episode": "live and let dynamo",
      "description": "The Powerpuff Dynamo is on the loose in Townsville and The Powerpuff Girls have to stop it, as well as find out who is controlling it.",
      "imdbLink": "/title/tt1093703/?ref_=ttep_ep3",
      "word_count_for_line": 577
    },
    "4.1": {
      "episode": "mo' linguish",
      "description": "Mojo is sentenced to do community service for Townsville and begins teaching English at the Learning Annex. Soon everyone is speaking in circles like Mojo and the town comes to a standstill.",
      "imdbLink": "/title/tt1485641/?ref_=ttep_ep4",
      "word_count_for_line": 1761
    },
    "4.2": {
      "episode": "oops, i did it again",
      "description": "The Professor dreams he had made three normal little girls after realizing all of his successes are mere accidents.",
      "imdbLink": "/title/tt1485641/?ref_=ttep_ep4",
      "word_count_for_line": 1011
    },
    "5.": {
      "episode": "a made up story",
      "description": "Someone is defacing all the posters and statues of Townsville with make-up. Can the Girls stop this makeover takeover or will they get the blush off?",
      "imdbLink": "/title/tt0677578/?ref_=ttep_ep5",
      "word_count_for_line": 1232
    },

    "6.1": {
      "episode": "little miss interprets",
      "description": "When the Girls hear the Professor trying to make something out of sugar, spice, and everything nice, they are sure he's trying to create new little girls.",
      "imdbLink": "/title/tt1485638/?ref_=ttep_ep6",
      "word_count_for_line": 1146
    },
    "6.2": {
      "episode": "night mayor",
      "description": "The Mayor keeps frequently having the same dream, but he never sees the end. Now it's up to the Powerpuff Girls to investigate inside the Mayor's head and solve this mystery.",
      "imdbLink": "/title/tt1485638/?ref_=ttep_ep6",
      "word_count_for_line": 749
    },
    "7.1": {
      "episode": "custody battle",
      "description": "Mojo discovers that the Rowdyruff Boys are back and is determined to show them that he is a more evil dad than Him.",
      "imdbLink": "/title/tt1485634/?ref_=ttep_ep7",
      "word_count_for_line": 977
    },
    "7.2": {
      "episode": "city of nutsville",
      "description": "A statue of The Mayor is erected in Townsville Park and Bubbles gets stung by a bee in the throat. Then Townsville is being controlled by squirrels and changing the city's the name to Nutsville.",
      "imdbLink": "/title/tt1485634/?ref_=ttep_ep7",
      "word_count_for_line": 584
    },
    "8.": {
      "episode": "aspirations",
      "description": "The Gangreen Gang is actually committing brilliant crimes, but, behind every great gang, there has to be a great woman.",
      "imdbLink": "/title/tt1486130/?ref_=ttep_ep8",
      "word_count_for_line": 1228
    },

    "9.1": {
      "episode": "that's not my baby",
      "description": "The girls try to prove to the Professor that they are capable of having a pet.",
      "imdbLink": "/title/tt1383667/?ref_=ttep_ep9",
      "word_count_for_line": 1023
    },
    "9.2": {
      "episode": "simian says",
      "description": "Mojo Jojo kidnaps the Narrator to control the Powerpuff Girls' actions on-screen.",
      "imdbLink": "/title/tt1383667/?ref_=ttep_ep9",
      "word_count_for_line": 932
    },
    "10.1": {
      "episode": "sun scream",
      "description": "The Girls get the ultimate sunburn and must try to fight crime despite their UV damage.",
      "imdbLink": "/title/tt1383666/?ref_=ttep_ep10",
      "word_count_for_line": 765
    },
    "10.2": {
      "episode": "city of frownsville",
      "description": "When the carnival comes to Townsville, everyone is as happy as humanly possible. All except for Lou Gubrious, a miserable man, who spends all his time crying, and wants to make everyone feel gloomy all the time.",
      "imdbLink": "/title/tt1383666/?ref_=ttep_ep10",
      "word_count_for_line": 856
    },
    "11.": {
      "episode": "west in pieces",
      "description": "It's the old west and Mojo the Kid has robbed the first bank ever and forced the sheriff out of town and it is up to the Steamypuff Girls to save the day at a high-noon showdown.",
      "imdbLink": "/title/tt1485649/?ref_=ttep_ep11",
      "word_count_for_line": 1237
    },
    "12.1": {
      "episode": "crazy mixed up puffs",
      "description": "The girls must literally work as one to try and stop Mojo from destroying Townsville.",
      "imdbLink": "/title/tt1481910/?ref_=ttep_ep12",
      "word_count_for_line": 113
    },
    "12.2": {
      "episode": "mizzen in action",
      "description": "In this episode, Pirate Crack McCraigen and his crew mistake Chemical X for treasure (since 'X' marks the spot) when they are mysteriously transported to the present, leaving the girls to fight these powered pirates to get the professor back and the pirates back into the past. ",
      "imdbLink": "/title/tt1481910/?ref_=ttep_ep12",
      "word_count_for_line": 545
    },
    "13.1": {
      "episode": "roughing it up",
      "description": "The Girls and the Professor set on an old-fashioned vacation to the Townsville Swamp. Trouble is, Fuzzy and his nephews are there too.",
      "imdbLink": "/title/tt1093704/?ref_=ttep_ep13",
      "word_count_for_line": 910
    },
    "13.2": {
      "episode": "what's the big idea?",
      "description": "Mojo Jojo makes the girls giants so that they can’t stop his crimes without causing massive collateral damage and it’s up to the Professor to save the day.",
      "imdbLink": "/title/tt1093704/?ref_=ttep_ep13",
      "word_count_for_line": 463
    },
    "14.1": {
      "episode": "nuthin' special",
      "description": "Frustrated with not knowing what her Special Power is, Buttercup Hunts to discover what makes her special.",
      "imdbLink": "/title/tt1485643/?ref_=ttep_ep14",
      "word_count_for_line": 588
    },
    "14.2": {
      "episode": "neighbor hood",
      "description": "Bubbles' favorite show loses all of their joy after they convince viewers to send in their money for unknown reasons. It turns out that Whimsical Willy stole all the money from Townsville.",
      "imdbLink": "/title/tt1485643/?ref_=ttep_ep14",
      "word_count_for_line": 488
    },
    "15.1": {
      "episode": "i see a funny cartoon in your future",
      "description": "The Girls have the rare task of fighting a Medium who is committing petty thefts.",
      "imdbLink": "/title/tt0677589/?ref_=ttep_ep15",
      "word_count_for_line": 1673
    },
    "15.2": {
      "episode": "octi gone",
      "description": "Professor Utonium is hosting a dinner party at his house. While getting ready, Bubbles loses Octi, and all she finds of him is his dismembered arm. Bubbles swears, she'll avenge her deceased doll and everyone at the party is a suspect of the 'murder' of Octi.",
      "imdbLink": "/title/tt0677589/?ref_=ttep_ep15",
      "word_count_for_line": 1015
    }
  }
}
