[
  {
    "year": 2016,
    "season": "1",
    "episode_nr": "1",
    "title": "Escape from Monster Island",
    "description": "While Bubbles tries to decide whether to take Blossom or Buttercup to a concert, the girls head to Monster Island to rescue the Mayor."
  },
  {
    "year": 2016,
    "season": "1",
    "episode_nr": "2",
    "title": "Princess Buttercup",
    "description": "Buttercup starts hanging out with a bad crowd, so Princess Morbucks tries to join the team."
  },
  {
    "year": 2016,
    "season": "1",
    "episode_nr": "3",
    "title": "The Stayover",
    "description": "Recovering from a candy hangover, Blossom and Buttercup retrace their steps to find Bubbles."
  },
  {
    "year": 2016,
    "season": "1",
    "episode_nr": "4",
    "title": "Painbow",
    "description": "A rainbow makes everyone in Townsville unnaturally happy."
  },
  {
    "year": 2016,
    "season": "1",
    "episode_nr": "5",
    "title": "Horn, Sweet Horn",
    "description": "At Bubbles' request, the Professor tries to make Donny the Pony a unicorn, but Donny is turned into a monster that threatens Townsville."
  },
  {
    "year": 2016,
    "season": "1",
    "episode_nr": "6",
    "title": "Man Up",
    "description": "Buttercup starts a new-age lifestyle to calm down when her aggression allows the villain Manboy to escape."
  },
  {
    "year": 2016,
    "season": "1",
    "episode_nr": "7",
    "title": "Bye Bye, Bellum",
    "description": "The girls are overworked helping the Mayor when Miss Sara Bellum goes on vacation."
  },
  {
    "year": 2016,
    "season": "1",
    "episode_nr": "8",
    "title": "Little Octi Lost",
    "description": "Buttercup hides Bubbles' doll Octi in the bushes to teach her a lesson, but the lesson backfires when PackRat takes it."
  },
  {
    "year": 2016,
    "season": "1",
    "episode_nr": "9",
    "title": "Strong-Armed",
    "description": "Bubbles wears a robotic cast for her broken arm and the cast proves to be useful in fighting PackRat."
  },
  {
    "year": 2016,
    "season": "1",
    "episode_nr": "10",
    "title": "Power-Up Puff",
    "description": "Buttercup and Bubbles level up during a fight, leaving Blossom to wonder if she'll level up too."
  },
  {
    "year": 2016,
    "season": "1",
    "episode_nr": "11",
    "title": "Tiara Trouble",
    "description": "A mysterious tiara places a curse on the Townsville Beauty, Talent and All-Around Flair Pageant."
  },
  {
    "year": 2016,
    "season": "1",
    "episode_nr": "12",
    "title": "The Wrinklegruff Gals",
    "description": "The girls turn into senior citizens when they drink a potion meant to make them older."
  },
  {
    "year": 2016,
    "season": "1",
    "episode_nr": "13",
    "title": "Arachno-Romance",
    "description": "The Professor has a new girlfriend, but the Girls aren't happy about it."
  },
  {
    "year": 2016,
    "season": "1",
    "episode_nr": "14",
    "title": "Puffdora's Box",
    "description": "Blossom accidentally unleashes evil spirits when she gets overzealous with the spring cleaning."
  },
  {
    "year": 2016,
    "season": "1",
    "episode_nr": "15",
    "title": "Blue Ribbon Blues",
    "description": "Blossom tries to impress a famous scientist who visits the school."
  },
  {
    "year": 2016,
    "season": "1",
    "episode_nr": "16",
    "title": "Frenemy",
    "description": "The girls end up as accomplices in their new friend's adventurous crimes."
  },
  {
    "year": 2016,
    "season": "1",
    "episode_nr": "17",
    "title": "Once Upon a Townsville",
    "description": "Chased by a dragon, Princess Bluebell accidentally crosses from her fairytale dimension to the Powerpuff Girls's world. She explains through song and dance that she's a damsel in distress. The Girls try to teach her to be independent."
  },
  {
    "year": 2016,
    "season": "1",
    "episode_nr": "18",
    "title": "Man Up 2: Still Man-ing",
    "description": "When someone steals all the water in Townsville, it's up to the Girls to race through the Townsville Wastelands to get it back."
  },
  {
    "year": 2016,
    "season": "1",
    "episode_nr": "19",
    "title": "Viral Spiral",
    "description": "After the new trendy app was created in Townsville, the powerpuff girls soon uncover a dangerous glitch in the program."
  },
  {
    "year": 2016,
    "season": "1",
    "episode_nr": "20",
    "title": "Bubbles of the Opera",
    "description": "Viral Spiral: When the Amoeba Boys wreak havoc on the internet, Bubbles has to hack her sisters in to stop them. / Bubbles of the Opera: When Bubbles gets a bad school photo, it sends her into an existential tailspin of darkness."
  },
  {
    "year": 2016,
    "season": "1",
    "episode_nr": "21",
    "title": "Sister Sitter",
    "description": "When Blossom and Bubbles get sick, Buttercup volunteers to take care of them for the day."
  },
  {
    "year": 2016,
    "season": "1",
    "episode_nr": "22",
    "title": "Odd Bubbles Out",
    "description": "Donny the Unicorn and Big Joey participate in the Student/Unicom Exchange Program. Bubbles has many planned activities but Donny is doing them with Chelsea. At first Bubbles is upset but decides to meet Her since Donny likes Chelsea so much. Buttercup thinks Chelsea is a Bubbles 2.0. Donny and Bubbles argue later that night and Donny decides to stay at Chelseas place. Trying to comfort Bubbles; Blossom and Buttercup realize Donny is likely in trouble and set out to try and save him."
  },
  {
    "year": 2016,
    "season": "1",
    "episode_nr": "23",
    "title": "Presidential Punchout",
    "description": "When Morbucks enters the Student Body President race, Blossom sinks to her level to secure the win."
  },
  {
    "year": 2016,
    "season": "1",
    "episode_nr": "24",
    "title": "Cheep Thrills",
    "description": "Cheep Thrills: After finding a baby monster in the park, Bubbles insists on adopting it without considering the consequences! / Fashion Forward: When the Fashionistas launch a new line of brainwashing clothing, it's up to the Powerpuff Girls to stop the fashion trend before it's too late."
  },
  {
    "year": 2016,
    "season": "1",
    "episode_nr": "25",
    "title": "Fashion Forward",
    "description": "Cheep Thrills: After finding a baby monster in the park, Bubbles insists on adopting it without considering the consequences! / Fashion Forward: When the Fashionistas launch a new line of brainwashing clothing, it's up to the Powerpuff Girls to stop the fashion trend before it's too late."
  },
  {
    "year": 2016,
    "season": "1",
    "episode_nr": "26",
    "title": "In the Garden of Good and Eddie",
    "description": "When the girls try a quick-fix on their neglected veggie garden, they are left with a giant, mooching tomato worm they must care for."
  },
  {
    "year": 2016,
    "season": "1",
    "episode_nr": "27",
    "title": "Road Trippin'",
    "description": "In The Garden of Good and Eddie: When the girls try a quick-fix on their neglected veggie garden, they are left with a giant, mooching tomato worm they must care for. / Road Trippin': Realizing her and the Professor don't have much in common, Bubbles schedules a road trip with just the two of them."
  },
  {
    "year": 2016,
    "season": "1",
    "episode_nr": "28",
    "title": "The Big Sleep",
    "description": "The Big Sleep: When the Professor's latest invention wreaks havoc in the house, it's up to the Powerpuff Girls to stop it before it escapes. / The Secret Life of Blossom Powerpuff: When Blossom can't join her favorite school club, she imagines what her life would be like if she joined other clubs."
  },
  {
    "year": 2016,
    "season": "1",
    "episode_nr": "29",
    "title": "The Secret Life of Blossom Powerpuff",
    "description": "When Blossom can't join her favorite school club, she imagines what her life would be like if she joined other clubs."
  },
  {
    "year": 2016,
    "season": "1",
    "episode_nr": "30",
    "title": "Halt and Catch Silico",
    "description": "Halt and Catch Silico: When a series of negative articles about the Powerpuff Girls are posted on the Internet, the girls track them back to Silico. / Secret Swapper of Doom: When the girls get a Paper Fortune Teller that can predict the future if they tell it a secret, they begin to rely on it to predict everything. But when it predicts the Powerpuff Girls will be destroyed, the girls must find a way to stop the future from happening."
  },
  {
    "year": 2016,
    "season": "1",
    "episode_nr": "31",
    "title": "Secret Swapper of Doom",
    "description": "When the Girls get a Paper Fortune Teller that can predict the future if they tell it a secret, they begin to rely on it to predict everything."
  },
  {
    "year": 2016,
    "season": "1",
    "episode_nr": "32",
    "title": "Rainy Day",
    "description": "Its a rainy day and the girls are stuck inside and bored. Trouble quickly follows when the girls play with the Time Dasher in the Professors lab."
  },
  {
    "year": 2016,
    "season": "1",
    "episode_nr": "33",
    "title": "The Squashening",
    "description": "Rainy Day: The girls get into trouble when left to entertain themselves on a rainy day. / The Squashening: To escape a monster, the girls have to tell him a scary story."
  },
  {
    "year": 2016,
    "season": "1",
    "episode_nr": "34",
    "title": "Electric Buttercup",
    "description": "Buttercup gets more than she bargained for when she makes a deal with a cool '80s metalhead to get a sweet new guitar."
  },
  {
    "year": 2016,
    "season": "1",
    "episode_nr": "35",
    "title": "Professor Proofed",
    "description": "Electric Buttercup: Buttercup gets more than she bargained for when she makes a deal with a cool '80s metalhead to get a sweet new guitar. / Professor Proofed: After the Professor's latest experiment goes awry, the girls become overprotective."
  },
  {
    "year": 2016,
    "season": "1",
    "episode_nr": "36",
    "title": "Poorbucks",
    "description": "When Morbucks loses her money, Blossom tries to reform her."
  },
  {
    "year": 2016,
    "season": "1",
    "episode_nr": "37",
    "title": "Snow Month",
    "description": "Poorbucks: When Morbucks loses her money, Blossom tries to reform her. / Snow Month: After a snow day saves Blossom from having to face a boy who's asked her out, she decides to use her ice breath to keep it going even if that means plunging Townsville into eternal winter complete with monstrous yetis!"
  },
  {
    "year": 2016,
    "season": "1",
    "episode_nr": "38",
    "title": "Somewhere Over the Swingset",
    "description": "Somewhere Over the Swingset: When the girls disobey the Professor and swing all the way over the swingset, they must deal with unexpected consequences. / People Pleaser: Blossom neglects her promise to Bubbles when she takes on too many things leaving Buttercup and Bubbles to fend for themselves."
  },
  {
    "year": 2016,
    "season": "1",
    "episode_nr": "39",
    "title": "People Pleaser",
    "description": "Bubbles needs help with a model biome for school, but Blossom has other priorities."
  },

  {
    "year": 2016,
    "season": "2",
    "episode_nr": "1",
    "title": "The Last Donnycorn",
    "description": "When Donny the Unicorn is hunted by a seemingly unstoppable foe, the Powerpuff Girls have to find a way to save him before it's too late!"
  },
  {
    "year": 2016,
    "season": "2",
    "episode_nr": "2",
    "title": "Green Wing",
    "description": "At a retirement home, Buttercup meets an old woman claiming to be Green Wing, a former superhero. When her former nemesis reemerges, Buttercup teams-up with Green Wing."
  },
  {
    "year": 2016,
    "season": "2",
    "episode_nr": "3",
    "title": "15 Minutes of Fame",
    "description": "Green Wing: When volunteering at a retirement home, Buttercup meets an old woman who claims she used to be a superhero. / 15 Minutes of Fame: When Bubbles' video goes viral, she goes to great lengths to maintain her status as a big-time director."
  },
  {
    "year": 2016,
    "season": "2",
    "episode_nr": "4",
    "title": "Splitsville",
    "description": "After fighting each other solo, the Powerpuff Girls learn to accept each other's looks."
  },
  {
    "year": 2016,
    "season": "2",
    "episode_nr": "5",
    "title": "Clawdad",
    "description": "Splitsville: The girls learn to appreciate each others's style after having to each fight solo. / Clawdad: While visiting the lake, Buttercup vows to capture a legendary uncatchable crawdad."
  },
  {
    "year": 2016,
    "season": "2",
    "episode_nr": "6",
    "title": "Super Sweet 6",
    "description": "Morbucks throws the biggest birthday party of all time, and Blossom is the only one not invited."
  },
  {
    "year": 2016,
    "season": "2",
    "episode_nr": "7",
    "title": "A Star Is Blossom",
    "description": "Blossom thinks she's a shoo-in for the lead role in a school play. When the list comes out, it's Bubbles who wins the lead role. Blossom, resigned to playing a rock (with no dialogue at that), Blossom tries to sabotage Bubbles' appearance until a Viking queen shows up after being summoned from a book (from which the play's script comes) and takes the male lead, Jared Shapiro, to get him to marry her."
  },
  {
    "year": 2016,
    "season": "2",
    "episode_nr": "8",
    "title": "Mini Golf Madness",
    "description": "Buttercup takes her game winning mini golf ball, in spite of ominous warnings of dire consequences."
  },
  {
    "year": 2016,
    "season": "2",
    "episode_nr": "9",
    "title": "Summer Bummer",
    "description": "When the beach is taken over by the most excellent Bro Sharks, will the Girls be gnarly enough to save the day?"
  },
  {
    "year": 2016,
    "season": "2",
    "episode_nr": "10",
    "title": "The Tell Tale Schedulebot",
    "description": "After Blossom and Buttercup break Schedulebot, they'll do anything to keep the truth from coming out."
  },
  {
    "year": 2016,
    "season": "2",
    "episode_nr": "11",
    "title": "Musclecup",
    "description": "Feeling inadequate as a superhero, Buttercup bulks up...to the max."
  },
  {
    "year": 2016,
    "season": "2",
    "episode_nr": "12",
    "title": "Take Your Kids to Dooms Day",
    "description": "The Girls spend the day with the Professor at his boring office, only to find that the office comes with a terrible secret."
  },
  {
    "year": 2016,
    "season": "2",
    "episode_nr": "13",
    "title": "The Bubbles-Sitters Club",
    "description": "Bubbles tries to prove that she's responsible enough to own a dog."
  },
  {
    "year": 2016,
    "season": "2",
    "episode_nr": "14",
    "title": "Buttercup vs. Math",
    "description": "When Buttercup tests into Honors Math, she tries to avoid being labeled a nerd."
  },
  {
    "year": 2016,
    "season": "2",
    "episode_nr": "15",
    "title": "Home, Sweet Homesick",
    "description": "When the Girls go to Camp, Blossom has a hard time leaving her schoolwork at home."
  },
  {
    "year": 2016,
    "season": "2",
    "episode_nr": "16",
    "title": "Memory Lane of Pain",
    "description": "While going through the Professor's scrapbook, Bubbles starts to question if she's ever been a hero."
  },
  {
    "year": 2016,
    "season": "2",
    "episode_nr": "17",
    "title": "Spider Sense",
    "description": "When a monster ruins their relaxing vacation, the Girls run into a familiar face."
  },
  {
    "year": 2016,
    "season": "2",
    "episode_nr": "18",
    "title": "Imagine That",
    "description": "Imagine That: The Girls have to battle Him after he causes Bubbles' imagination to run wild. / Phantasm Chasm: After getting sucked into Jared's favorite board game, Buttercup is forced to team-up with him in order to save her sisters."
  },
  {
    "year": 2016,
    "season": "2",
    "episode_nr": "19",
    "title": "Phantasm Chasm",
    "description": "After getting sucked into Jared's favorite board game, Buttercup is forced to team-up with him in order to save her sisters."
  },
  {
    "year": 2016,
    "season": "2",
    "episode_nr": "20",
    "title": "Tooth or Consequences",
    "description": "Blossom Tries to evade the Dentist at all cost."
  },
  {
    "year": 2016,
    "season": "2",
    "episode_nr": "22",
    "title": "Monkey Love",
    "description": "When Blossom Makes a bad call, She fears that if she tries again she might mess it up even worse."
  },
  {
    "year": 2016,
    "season": "2",
    "episode_nr": "23",
    "title": "Bridezilla",
    "description": "When Mojo and Barbarus announce their wedding, the girls are convinced that they're up to no good."
  },
  {
    "year": 2016,
    "season": "2",
    "episode_nr": "24",
    "title": "Find Your Bliss",
    "description": "The Powerpuff Girls learn they have an older sister named Bliss."
  },
  {
    "year": 2016,
    "season": "2",
    "episode_nr": "24",
    "title": "Bliss Reminisce",
    "description": "The Powerpuff Girls learn they have an older sister named Bliss."
  },
  {
    "year": 2016,
    "season": "2",
    "episode_nr": "24",
    "title": "Blisster Sister",
    "description": "The Powerpuff Girls learn they have an older sister named Bliss."
  },
  {
    "year": 2016,
    "season": "2",
    "episode_nr": "24",
    "title": "Breaking Bliss",
    "description": "The Powerpuff Girls learn they have an older sister named Bliss."
  },
  {
    "year": 2016,
    "season": "2",
    "episode_nr": "24",
    "title": "Blisstersweet Symphony",
    "description": "The Powerpuff Girls learn they have an older sister named Bliss."
  },
  {
    "year": 2016,
    "season": "2",
    "episode_nr": "25",
    "title": "Midnight at the Mayor's Mansion",
    "description": "When the Mayor's mansion is stalked by a vicious, ghostly monster, he calls the Powerpuff Girls for help."
  },
  {
    "year": 2016,
    "season": "2",
    "episode_nr": "26",
    "title": "The Trouble with Bubbles",
    "description": "When Bubbles is overworked, she uses her coding skills to come up with a new solution."
  },
  {
    "year": 2016,
    "season": "2",
    "episode_nr": "27",
    "title": "You're a Good Man, Mojo Jojo!",
    "description": "The holidays are Mojo's favorite time...for ruining everything! But this year, he may just learn the reason for the season."
  },
  {
    "year": 2016,
    "season": "2",
    "episode_nr": "28",
    "title": "Never Been Blissed",
    "description": "With a parasitic alien on the loose in their school, the Powerpuff Girls and Bliss have to find a way to stop it before the big dance."
  },
  {
    "year": 2016,
    "season": "2",
    "episode_nr": "29",
    "title": "Sugar, Spice, and Super Lice",
    "description": "When Buttercup gets super lice, her sisters must battle them to save her."
  },
  {
    "year": 2016,
    "season": "2",
    "episode_nr": "30",
    "title": "The Buttercup Job",
    "description": "Buttercup joins Jemmica in a quest for adventure, but how far will she go?"
  },
  {
    "year": 2016,
    "season": "2",
    "episode_nr": "31",
    "title": "A Slight Hiccup",
    "description": "The Girls must overcome their supersonic hiccups to stop the Gnat's latest evil plan!"
  },
  {
    "year": 2016,
    "season": "2",
    "episode_nr": "32",
    "title": "Toy Ploy",
    "description": "When Mojo kidnaps the girls' favourite snuggle toys, he gets more than he bargained for."
  },
  {
    "year": 2016,
    "season": "2",
    "episode_nr": "33",
    "title": "Derby Dollies",
    "description": "When Bubbles joins the Derbytantes, Buttercup finds herself on the sidelines."
  },
  {
    "year": 2016,
    "season": "2",
    "episode_nr": "34",
    "title": "Bubbles the Blue",
    "description": "When Bubbles isn't her normal, bubbly self, her sisters don't know how to handle it."
  },
  {
    "year": 2016,
    "season": "2",
    "episode_nr": "35",
    "title": "Deb O'Nair",
    "description": "A classy queen of etiquette makes the Utoniums question their superhero way of life."
  },
  {
    "year": 2016,
    "season": "2",
    "episode_nr": "36",
    "title": "Man Up 3: The Good, the Bad, and the Manly",
    "description": "After Bubbles gets blasted with Man Boy's beard ray, she wreaks havoc in the most manly and adorable way possible."
  },
  {
    "year": 2016,
    "season": "2",
    "episode_nr": "37",
    "title": "The Blossom Files",
    "description": "Blossom's skepticism is put to the test when she believes she's encountered a space alien."
  },
  {
    "year": 2016,
    "season": "2",
    "episode_nr": "38",
    "title": "Aliver",
    "description": "The Girls compete for the title of World's Greatest Superheroes!"
  },

  {
    "year": 2016,
    "season": "3",
    "episode_nr": "1",
    "title": "Not So Secret Service",
    "description": "After Mojo Jojo's latest creation threatens to blast him into tiny bits, the Powerpuff Girls are forced to take Mojo in."
  },
  {
    "year": 2016,
    "season": "3",
    "episode_nr": "2",
    "title": "Worship",
    "description": "When the Fashionistas unveil their new mind controlling perfume, The Powerpuff Girls must find a way to stop them before Townsville falls under their spell."
  },
  {
    "year": 2016,
    "season": "3",
    "episode_nr": "3",
    "title": "Blossom3",
    "description": "After being blasted by Duplikate, Blossom turns into a triple threat."
  },
  {
    "year": 2016,
    "season": "3",
    "episode_nr": "4",
    "title": "Mojo the Great",
    "description": "In an effort to make himself \"great,\" Mojo steals the powers that makes the each of the Powerpuff Girls the heroes they are."
  },
  {
    "year": 2016,
    "season": "3",
    "episode_nr": "5",
    "title": "Trouble Clef",
    "description": "When Morbucks realizes that The Powerpuff Girls see her as a villain and not a friend, she sets out to turn the town against them."
  },
  {
    "year": 2016,
    "season": "3",
    "episode_nr": "6",
    "title": "Save the Date",
    "description": "Ms. Keane is nervous about a first date."
  },
  {
    "year": 2016,
    "season": "3",
    "episode_nr": "7",
    "title": "Can't Buy Love",
    "description": "When Morbucks falls in love, she finds the first thing money can't buy."
  },
  {
    "year": 2016,
    "season": "3",
    "episode_nr": "8",
    "title": "Largo",
    "description": "When a mysterious rain cloud plagues Townsville, Bubbles learns things aren't what they seem."
  },
  {
    "year": 2016,
    "season": "3",
    "episode_nr": "9",
    "title": "Blundercup",
    "description": "Buttercup is knocked off-kilter by a mysterious force."
  },
  {
    "year": 2016,
    "season": "3",
    "episode_nr": "10",
    "title": "Ragnarock and Roll",
    "description": "When an ancient prophecy spells doom for Townsville, the girls must race to stop it."
  },
  {
    "year": 2016,
    "season": "3",
    "episode_nr": "11",
    "title": "Total Eclipse of the Kart",
    "description": "The Powerpuff Girls compete in a race against some of their most vicious villains, to win whatever is in the Mayor's \"Mysterious Box Of Mystery.\""
  },
  {
    "year": 2016,
    "season": "3",
    "episode_nr": "12",
    "title": "The Long Skate Home",
    "description": "After they get accused of a crime they didn't commit, The Powerpuff Girls and The Derbytantes have to find a way to clear their name!"
  },
  {
    "year": 2016,
    "season": "3",
    "episode_nr": "13",
    "title": "Quarantine",
    "description": "After a chemical spill, the girls and Mojo find themselves trapped together."
  },
  {
    "year": 2016,
    "season": "3",
    "episode_nr": "14",
    "title": "In the Doghouse",
    "description": "Buttercup must go it alone to save her family from a kidnapping."
  },
  {
    "year": 2016,
    "season": "3",
    "episode_nr": "15",
    "title": "Salamander",
    "description": "When the professor is kidnapped, the girls must go to a mysterious island to save him."
  },
  {
    "year": 2016,
    "season": "3",
    "episode_nr": "16",
    "title": "small world: abra-disaster",
    "description": "The Powerpuff Girls are sent to the arctic on a dangerous mission to find the key to saving the day."
  },
  {
    "year": 2016,
    "season": "3",
    "episode_nr": "16",
    "title": "small world: heart to heartstone",
    "description": "The Powerpuff Girls are sent to the arctic on a dangerous mission to find the key to saving the day."
  },
  {
    "year": 2016,
    "season": "3",
    "episode_nr": "16",
    "title": "small world: maze daze",
    "description": "The Powerpuff Girls are sent to the arctic on a dangerous mission to find the key to saving the day."
  },
  {
    "year": 2016,
    "season": "3",
    "episode_nr": "16",
    "title": "small world: stone cold spider",
    "description": "The Powerpuff Girls are sent to the arctic on a dangerous mission to find the key to saving the day."
  },
  {
    "year": 2016,
    "season": "3",
    "episode_nr": "17",
    "title": "Witch's Crew",
    "description": "On Halloween Night, Morbucks summons a monster that she didn't expect. And the Powerpuff girls now as withes must to a stop to it."
  },
  {
    "year": 2016,
    "season": "3",
    "episode_nr": "18",
    "title": "The Gift",
    "description": "The girls must replace the Professor's Christmas present on Christmas Eve."
  },
  {
    "year": 2016,
    "season": "3",
    "episode_nr": "19",
    "title": "Oh, Daisy!",
    "description": "Buttercup is not a fan of Bubbles' newly created digital assistant."
  },
  {
    "year": 2016,
    "season": "3",
    "episode_nr": "20",
    "title": "Brain Freeze",
    "description": "When a mysterious new ice cream flavor takes Townsville by storm, the girls suspect there might be foul play."
  },
  {
    "year": 2016,
    "season": "3",
    "episode_nr": "21",
    "title": "Lights Out!",
    "description": "When Bliss brings a new tech product to town, it's more powerful than imagined."
  },
  {
    "year": 2016,
    "season": "3",
    "episode_nr": "22",
    "title": "Bucketboy!",
    "description": "When the girls tell Barry he's a hero, he takes it too far."
  },
  {
    "year": 2016,
    "season": "3",
    "episode_nr": "23",
    "title": "The Fog",
    "description": "A new villain arrives in Townsville and gives the old villains an enticing offer."
  },
  {
    "year": 2016,
    "season": "3",
    "episode_nr": "24",
    "title": "The Spoon",
    "description": "A crash landing sends Townsville over the edge."
  },
  {
    "year": 2016,
    "season": "3",
    "episode_nr": "25",
    "title": "Cat Burglar",
    "description": "An alarmingly familiar cat burglar terrorizes Townsville."
  },
  {
    "year": 2016,
    "season": "3",
    "episode_nr": "26",
    "title": "Hustlecup",
    "description": "When Buttercup loses the Professor's latest invention, she'll have to beat The Gangreen Gang at their own game to get it back."
  },
  {
    "year": 2016,
    "season": "3",
    "episode_nr": "27",
    "title": "Rebel Rebel",
    "description": "The Professor makes new friends, but they may be the wrong crowd."
  },
  {
    "year": 2016,
    "season": "3",
    "episode_nr": "28",
    "title": "Our Brand Is Chaos",
    "description": "Bubbles and Buttercup make a deal without realizing the consequences."
  },
  {
    "year": 2016,
    "season": "3",
    "episode_nr": "29",
    "title": "Tagalong",
    "description": "Buttercup is tired of Bubbles following her everywhere."
  },
  {
    "year": 2016,
    "season": "3",
    "episode_nr": "30",
    "title": "Brainlord",
    "description": "A new superhero arrives in Townsville with a dark secret."
  },
  {
    "year": 2016,
    "season": "3",
    "episode_nr": "31",
    "title": "Checkin' Out",
    "description": "A trip to the supermarket has bizarre consequences."
  },
  {
    "year": 2016,
    "season": "3",
    "episode_nr": "32",
    "title": "Drama Bomb",
    "description": "The school play goes off the rails when the drama teacher interferes."
  },
  {
    "year": 2016,
    "season": "3",
    "episode_nr": "33",
    "title": "Watch It!",
    "description": "The Powerpuff Girls are tasked with keeping a priceless gem safe from thieves."
  },
  {
    "year": 2016,
    "season": "3",
    "episode_nr": "34",
    "title": "Man Up 4: The Donnyest Game",
    "description": "With Man-Boy on the loose, Donny must be prepared for anything."
  },
  {
    "year": 2016,
    "season": "3",
    "episode_nr": "35",
    "title": "The Oct-Father",
    "description": "When Princess Morbucks steals Octi, Bubbles' reaction surprises everyone, even her sisters."
  },
  {
    "year": 2016,
    "season": "3",
    "episode_nr": "36",
    "title": "Sideline Dad",
    "description": "When the Girls start playing soccer, the Professor goes overboard."
  }
]
