[
  {
    "episode": "Stuck Up, Up, and Away",
    "dialog": [
      "Narrator: The city of Townsville, and it's a shiny new day, with a shiny new limousine heading for Pokey Oaks Kindergarten.",
      "Narrator: Seems there will be a shiny new face joining the class today.",
      "Princess Morebucks: I'll need some milk money for my first day of new school.",
      "Princess: I suppose it'll do.",
      "Ms. Keane: Well, hi there. It's nice to finally meet you. Come on in. Everyone, can I have your attention? I'd like you all to give a nice, warm welcome to our new friend, Princess Morbucks.",
      "Class: Hi, Princess!",
      "Princess: Hmm.",
      "Mitch: Hi, Princess! Wanna help us build a skyscraper?",
      "Princess: When I want to build a skyscraper, my daddy builds me a real one in any city I want. ",
      "Boy: Hey, Princess! Get on aboard the choo-choo es-prex! ",
      "Princess: I only travel first class, on my daddy's private Lear jet. ",
      "Harry: Hey, Princess! Do you dig dirt?",
      "Princess: Yecch! No!",
      "Girl 2: Hi, Princess. Wanna play with Twiggy, our class hamster?",
      "Princess: Ewww, no! I do not want to play with your smelly, mangy little rat! Blecch!",
      "Narrator: Oh, no! In Twiggy's distressed state, her frantic attempt to get far away has caused a nut to work itself loose from her scamper wheel!",
      "Ms. Keane: Twiggy! ",
      "Blossom: Buttercup, vaporize the cage! Bubbles! You, me! Fastball Special!",
      "Princess: Wow, that was amazing! How did you do that?",
      "Bubbles: It's easy!",
      "Blossom: We're superheroes.",
      "Buttercup: Yeah, we're the... ",
      "Girls: Powerpuff Girls!",
      "Princess: Ah. Well, then, I'm gonna be a Powerpuff Girl too.",
      "Blossom: Well, uh, we're not really accepting new members at this time, but thank you for your interest in our group.",
      "Princess: What?! You can't just blow me off like some common peon! I'm Princess, and my daddy buys me anything I want! AND I WANNA BE A POWERPUFF GIRL!",
      "Blossom: Well, I'm sorry, but you can't. We're superheroes.",
      "Bubbles: We were born with superpowers.",
      "Buttercup: You can't justbuysuperpowers.",
      "Princess: Oh, yeah. Tell that to Batman!",
      "Buttercup: I don't think I like that Princess at all.",
      "Bubbles: Yeah. Why was she so rotten to everyone?",
      "Blossom: Well, she's new here and probably doesn't know how to make friends. We should give her a chance.",
      "Narrator: Meanwhile, across town at Morebucks Manor...",
      "Princess: DADDY! Daddy, Daddy, Daddy, Daddy, Daddy, Daddy!",
      "Princess: My first day of new school and everyone was mean to me! I just wanted to make friends, but everyone ignored me, especially the Powerpuff Girls! Everyone loves the Powerpuff Girls, so I wanted to be a Powerpuff too, but they were being selfish and spoiled and they told me I couldn't! They told me I couldn't! But I wanna! I wanna be a Powerpuff Girl!  I wanna, I wanna, I WANNA!",
      "Narrator: The next day at school... coloring time proceeds as usual, until...",
      "Princess: All hail Princess! The newest and best-loved Powerpuff Girl of all time!",
      "Buttercup: WHAT?!",
      "Princess: See? I told you I was gonna be a Powerpuff Girl.",
      "Bubbles: Uh... I like your outfit. ",
      "Princess: Of course you do. It's just like yours, except better.",
      "Buttercup: Girl... ",
      "Blossom: I'll handle this. Now, Princess, sweetie, maybe we didn't explain well enough.",
      "Blossom: Yeah, Mayor? A robbery? First National Bank?",
      "Princess: Why dotheyget to answer the fancy phone?",
      "Blossom: Don't worry, Mayor. We're on it!  Come on, girls! ",
      "Princess: Hey! Wait for me!",
      "Narrator: Meanwhile... deep in the bowels of Townsville...",
      "Narrator: a crime is afoot.",
      "Bagman: That takes care of that.",
      "Gunman: Ha! Great!  Thank you, Townsville, for lettin' us have all your money!",
      "Blossom: Not so fast, crooks!",
      "Crooks: The Powerpuff Girls!",
      "Blossom: Why do they always want to do it the hard way?",
      "Buttercup: Okay. Let's take care of these knuckleheads and get back to school!",
      "Princess: Don't worry, Powerpuff Girls. I'll save you!",
      "Girls: Huh?",
      "Princess: Evildoers, beware the wrath of the Powerpuff Princess!  Hai-yah! Hai-yah! Hai-yah!",
      "Buttercup: Hey!",
      "Bubbles: Watch it!",
      "Gunman: Sorry we couldn't leave all the money like you asked, but we'd like to leave you a little present anyway.",
      "Gunman: I love it when a plan comes together!",
      "Buttercup: They're getting away!",
      "Blossom: No time!  The bomb!",
      "People: Hooray, Power... puff... Gi...",
      "Bubbles: Sorry. We're not really in the mood right now.",
      "Buttercup: What's wrong with you?! You ruined everything! Catching robbers should have been a piece of cake, butno!You had to come swinging in with your little toys... 'Look at me, Powerpuff Princess...'  Ooh, I oughta... ",
      "Blossom: Look, Princess. Now do you see why we don't let extra members on our team? Crime-fighting is dangerous business... and you don't really have superpowers or any kind of experience. So you see, it really is for your own safety when I say you just can't be a Powerpuff Girl, all right?",
      "Princess: DAAAAAADDDDDDYYYYYY!!!",
      "Princess: Daddy, Daddy, it was awful! I was being a good Powerpuff Girl, but they were jealous, and then the man grabbed me and put a bomb on me and everyone laughed at me!  And it's all YOUR fault'cause that super suit you bought me STINKS!  I thought you loved me, but I guess not if all I get is cheap JUNK! A real daddy who really loved his daughter wouldn't care what it cost and...",
      "Princess: Now that's the love I'm talking about.",
      "Narrator: Oh, boy. The following morning, back at Pokey Oaks Kindergarten...",
      "Bubbles: Gee, I haven't seen Princess yet today.",
      "Buttercup: Yeah, I bet she's still at home crying.",
      "Blossom: Well, she probably feels pretty silly about the way she...",
      "Princess: POWERPUFF GIRLS!!",
      "Bubbles: Looks like she went shopping this morning...",
      "Princess: All I ever wanted was for everyone to instantly love me as much as they love you. No!  You turned everyone against me!  You humiliated me!  You told me I could never be a Powerpuff Girl!  Wellif I can't be a Powerpuff Girl, then there won't be any POWERPUFF GIRLS!",
      "Ms. Keane: Ah, Princess, uh, the girls already know this rule, but you're new, so I'll let you know. I don't allow fighting in the classroom.",
      "Princess: Oh. I'm sorry. We'll take it outside!",
      "Princess: So! Who said money can't buy superpowers?",
      "Buttercup: You've been asking for this for a long time!",
      "Bubbles: Buttercup!",
      "Princess: As you can see, my new cybertomic armor increases my speed and strength far above that of your average Powerpuff Girl.",
      "Bubbles: Oh! You...!",
      "Princess: Oh, please.",
      "Princess: Talk to the hand.",
      "Blossom: Bubbles!",
      "Princess: Let's see. Blaster rays, flight boots, super-strength force fields... I guess with this new suit, the Powerpuff Princess has got you beat all around!",
      "Princess: So, Blossom, are you jealous? Are you scared? Seeing how easily I thrashed your sisters without even breaking a sweat.",
      "Princess: Well, what's the matter?",
      "Princess: Cat got your tongue?  Very well. Prepare to bow to your Princess!",
      "Blossom: Buttercup!",
      "Buttercup: Bubbles!",
      "Bubbles: Blossom!",
      "Princess: Huh?! WHOOOOOOOOAAAAAAAAAA!",
      "Princess: Why won't you let me be a Powerpuff Girl?",
      "Blossom: Because you're just a spoiled brat. And being a Powerpuff Girl isn't about getting your way, or having the best stuff, or being popular or powerful. It's about using your own unique abilities to help people and the world we all live in. And you, little girl, have done nothing worthy of the name 'Powerpuff'!",
      "Buttercup: Ooh, nice bracelets.",
      "Bubbles: Oh, they'll just be smashing with your new prison wardrobe! ",
      "Princess: Why you-you can't do this to me! I'm the Princess! Do you know who my daddy is?  My daddy knows people! And my daddy knows people like money!",
      "Narrator: Well, Princess, the only 'cha-ching' you'll be hearing from now on is the sound of prison doors! ",
      "Narrator: And so once again the day is saved, thanks to therealPowerpuff Girls!"
    ]
  },
  {
    "episode": "Substitute Creature",
    "dialog": [
      "Narrator: The city of Townsville!  Where the children can't wait to wake up for school.",
      "DJ: Good morning, Townsville kindergartners! Are you ready for another super day of scholarship?",
      "DJ: Gimme a K!",
      "Boy 1: K! ",
      "DJ: Gimme an E!",
      "Girl 1: E! ",
      "DJ: Gimme an A!",
      "Boy 2: A! ",
      "DJ: N!",
      "Boy 3: N!",
      "DJ: E!",
      "Boy 4: E!",
      "DJ: What's that spell?",
      "Boys 2, 3, 4: Keane! ",
      "DJ: What's that spell?",
      "Boy 5: Keane! ",
      "DJ: I can't hear you!",
      "Girl 3: Keane!",
      "Boy 6: Keane!",
      "Girl 4: Keane!",
      "Kids: KEANE!",
      "Boy 1: K is for Kindhearted,",
      "Girl 1: E is for Evenhanded,",
      "Boy 5: A is At Any Expense!",
      "Boys 2, 3, 4: N is for Never Late, we never wait for class at eight-",
      "Boy 6: E is for Excellence!",
      "Kids: K is for Kindhearted, E is for Evenhanded, ",
      "  A is At Any Expense!",
      "  N is for Never Late, we never wait for class at eight,",
      "Trucker: E is for Excellence!",
      "Kids: Keane! Keane!",
      " She's so keen, she's the queen!",
      " She's on the scene, she's good and clean,",
      " She's one cool bean, now move that beam,",
      " You know what I mean!",
      "Kids: K is for Kindhearted, E is for Evenhanded,",
      " A is At Any Expense!",
      " N is for Never Late, we never wait for class at eight,",
      " E is for Excellence!",
      "Blossom: It's 8: 01! Ms. Keane's never late for class at eight!",
      "Figure: I am afraid that I am the bearer of some rather... unfortunate news. Ms. Keane is unable to attend to your instruction, on account of the onset of a very sudden and unexpected... illness.",
      "Figure: I am Mr. Green-  -your substitute teacher.",
      "Figure : All right, class. Now let's get down to busin-",
      "Mr. Green: Sorry about that, kids. Just getting over a little cold myself. All right. Now let's get down to business. If you pull out your nutrition assignment from yesterday-",
      "Mr. Green: -does anyone know what the four major food groups are?  Uh, yes. You there. ",
      "Buttercup: 'A very sudden and unexpected illness'?  Ha! This creature teacher has done something with Ms. Keane. I just know it!",
      "Blossom: I think you're right, Buttercup. But what? What has he done? ",
      "Mr. Green: That's correct. Milk and dairy is a very important food group.",
      "Buttercup: Maybe he ate her!",
      "Ms. Keane: This substitute creature tricked me! Now I'm one of his four major food groups! ",
      "Mr. Green: Yes! I, the evil and despicable Mr. Green,didtrick you, Ms. Keane! Nowyou'regoing to completemybalanced meal!",
      "Mr. Green: Now, does anyone know the last remaining food group?",
      "Buttercup: How about teacher, Dr. Lecter?",
      "Mr. Green: Right... Okay, uh, well... the last food group is meats. Now let's move on to our next lesson.",
      "Buttercup: Come on, let's flunk this bad apple and find Ms. Keane.",
      "Blossom: But we can't, Buttercup. Not while he's holding all our classmates hostage. I wonder what he's planning to do next.",
      "Mr. Green: Ahh! Well, children, I have a very special lesson planned for you today.",
      "Bubbles: Oh, no! He's reaching for something!",
      "Buttercup: Get him!",
      "Mr. Green: You three? You know, you're beginning to get on my nerves, ladies. Don't try my patience. Back to your seats now.",
      "Mr. Green: Uh, you with the bow. You stay. I have a task for you.",
      "Blossom: A... task? For me? ",
      "Mr. Green: Uh, Blossom, is it? Blossom... I have a secret I want to tell you.",
      "Blossom: A... secret?",
      "Mr. Green: Yes. A secret. You see, I have these... cookies... that I want you to pass out to the students.",
      "Blossom: Um... but- ",
      "Mr. Green: Come on now. Off you go. One for everyone. Shoo, shoo!  You crazy kid. ",
      "Bubbles: What the heck is Blossom doing?",
      "Buttercup: I think she's giving something to Susie Jenkins.",
      "Bubbles, Buttercup: POISON!!",
      "Susie: Blossom! What areyoudoing here?",
      "Blossom: I... I... I brought you these, Susie. ",
      "Susie: Mmm! Cookies!",
      "Blossom: And they're from mean Mr. Green. He baked them especially for you. ",
      "Susie: Mr. Green... no...",
      "Blossom: You evil creature! You made me poison my classmate!",
      "Mr. Green: That's right, Blossom. And I won't stop until all of your classmates are poisoned!",
      "Bubbles: No, Susie, no! ",
      "Buttercup: Come on, Bubbles. Let's show this creep how the cookie crumbles!",
      "Buttercup: I think that's all of 'em. ",
      "Blossom: Oh, no!",
      "Boy 7: Mmm! Chocolate chip!",
      "Mr. Green: That's it. No recess for you.",
      "Mr. Green: Hey!  Julie Bean!  Do you want me to push you?",
      "Julie: No! Stop pushing me, Mr. Green!",
      "Mr. Green: Hey!  Elmer Sglue! Why don't you let me spin you?",
      "Elmer: No, Mr. Green! I don't want to spin!",
      "Mr. Green: Hey!  Harry Pitt! I hear you like to play in the mud!",
      "Harry: No, Mr. Green! Not the mud!",
      "Harry: Powerpuff Girls! Help!",
      "Blossom: That does it!  Let's kick some substitute butt!",
      "Blossom: HEY!! GREEN!!",
      "Mr. Green: Huh? Is someone calling me? ",
      "Blossom: THAT'S RIGHT, GREEN!! I'M TALKING TOYOU!!YOU'VE SAT IN ON YOUR LAST CLASS!!",
      "Girls: COSMIC CANNONBALL!!",
      "Mr. Green: Hello?",
      "Kids: Powerpuff Girls, no! Mr. Green is nice!",
      "Girls: Nice?! ",
      "Bubbles: But... Julie Bean! I heard you screaming. Didn't Mr. Green vault you into space?",
      "Julie: Vault me into space? He was nice enough to push me on the swing.",
      "Buttercup: And didn't he spin Elmer into the earth?",
      "Blossom: And drown Harry in a sea of mud?",
      "Elmer: He was nice enough to spin me around.",
      "Harry: And let me play in the mud!",
      "Blossom: But he's a monster.",
      "Buttercup: He's icky.",
      "Bubbles: And green!",
      "Mr. Green: I get it. Listen, girls. Just because I have big horns and like to wear long flowing capes doesn't make me a bad guy.",
      "Mr. Green: Yes, Iama monster, but I love children. And I want to help them learn and grow.",
      "Buttercup: We're sorry, Mr. Green.",
      "Blossom: I guess we shouldn't judge someone by what they look like.",
      "Bubbles: Even if they're as ugly as you. ",
      "Mr. Green: That's right!  Besides, you girls aren't what you appear to be. For three sweet little girls, you really can pack a punch.",
      "Narrator: Aw, Mr. Green, you're the best substitute creature ever.",
      "Mr. Green: Don't you mean 'teacher'?!? ",
      "Narrator: Er, right. Sorry. Teacher. Substitute teacher. Heh.",
      "Narrator: So once again the day is saved-",
      "Narrator: -thanks to the Powerpuff Girls!"
    ]
  },
  {
    "episode": "Sun Scream",
    "dialog": [
      "Narrator: The city of Townsville... is having another beautiful sunny day!",
      "Narrator: And the Powerpuff Girls are soaking it all up. At the beach!",
      "Girl: Can you really fly?",
      "Fat woman: Have you always been so cool?",
      "Boy: Who are you gonna beat up next? ",
      "Professor: Hey! Any questions for me?  You know, I invented the Powerpuff Girls. ",
      "Fat woman: They're so awesome!",
      "Lifeguard: What is that?",
      "Fainting woman: It's heading straight for us! ",
      "Blossom: Time for the old super vision.",
      "Professor: Girls, what is it?",
      "Blossom: Looks like some kinda sun flare. ",
      "Professor: A SOLAR FLARE IS HEADING STRAIGHT FOR US!!",
      "Buttercup: Amateurs. ",
      "Blossom: Let's rock this thing, girls! ",
      "Professor: Girls, you forgot your sunscreen!",
      "Blossom: Professor, we're kinda in a hurry.",
      "Bubbles: Yeah, we're cool.",
      "Buttercup: And, uh, sunscreen is for nerds.",
      "Professor: Oh, do you girls also wear sunscreen? Did you know that it was invented by a scientist? ",
      "Young woman: Nerd!",
      "Blossom: All right, ladies, let's see what we've got here.",
      "Bubbles: Looks like a big one.",
      "Buttercup: Yep.",
      "Blossom: Nothing a little Atomic Twister can't handle.",
      "Bubbles: Yeah!",
      "Buttercup: All right!",
      "Blossom, Bubbles: We did it again!",
      "Blossom: Now let's go soak up some of that glory.",
      "Bubbles: What are they laughing at? ",
      "Buttercup: We're sunburned!",
      "Lifeguard: Amateurs.",
      "Bubbles: It hurts so bad. ",
      "Blossom: The sunburn or the humiliation?",
      "Bubbles: Both. ",
      "Buttercup: And the worst part is, there was nothing we could have done to prevent it.",
      "Bubbles: Maybe we should get the Professor's, uh, help.",
      "Buttercup: I don't need nobody's help, and I don't need nobody laughing at my sunburn!",
      "Blossom: Buttercup's right. We have to maintain our professional image.",
      "Bubbles: Well, then, how are we gonna fight crime?",
      "Buttercup: Yeah. We can barely even move.",
      "Blossom: I think that we should have faith in the goodness of Townsville's citizens.",
      "Blossom: All right. I'll get it.",
      "Blossom: Bubbles!",
      "Bubbles: Yeah?",
      "Blossom: A little... help?",
      "Bubbles: Okay.",
      "Blossom: Ow!",
      "Buttercup: Ow!",

      "Mayor: Powerpuff Girls, I need your help! There's trouble downtown! Big trouble!",
      "Blossom: Uh-huh. Okay, Mayor. We'll be right there.",
      "Buttercup: Well, I ain't going in my swimsuit. ",
      "Buttercup: Can't move.",
      "Blossom: Too restricting.",
      "Bubbles: Need more flowy outfits.",
      "Bubbles: Everybody's gonna laugh at us.",
      "Blossom: No, they won't. Lots of superheroes wear capes.",
      "Buttercup: Well, they don't wear sheets.",
      "Blossom: Well, whatever. We have to wear something to protect us from the sun.",
      "Blossom: Ow! ",
      "Bubbles: Ouch! ",
      "Blossom: Ow! I've never even noticed the bugs before. ",
      "Bubbles: Ow! We've been squishing bugs?",
      "Buttercup: Not me. I guess it's my lucky day.",
      "Monty: This could be your lucky day, folks. Step right up and give it another try. Just pick the ace and win yourself a dollar.",
      "Mayor: Ooh! That one! It's that one!",
      "Slim: I say it's, um, that one. ",
      "Monty: Right you are, sir,",
      "Monty: and here you go. ",
      "Slim: Thank you, stranger. ",
      "Monty: You're welcome, stranger. ",
      "Mayor: Hey, what's going on here? Are we winking or are we playing? ",
      "Monty: We are definitely playing.",
      "Blossom: Hold it right there, Monty.",
      "Blossom: Your swindling days are over. ",
      "Monty: If it isn't the Wonder Girls. I wonder when they're gonna learn-  -that when you fly too close to the sun, ",
      "Monty, Slim: You get burned.",
      "Blossom: Very funny. Get 'em, girls!",
      "Buttercup: Owwwwwwwwwww!",
      "Slim: Nice try.",
      "Blossom: ",
      "Monty: And now, for the wittlest Wonder Girl.",
      "Bubbles: NOOOOOOOOOOOOOOOOOOOOOOOOOOO!!!!!!!!!",
      "Blossom: Looks like it's time for the old Atomic Twister.",
      "Bubbles: Yep.",
      "Buttercup: Works every time.",
      "Monty, Slim: Uh-oh.",
      "Professor: Girls!",
      "Professor: Girls!  Oh, thank goodness. I've been looking everywhere for you. Why are you laying on the ground like that? What happened to my babies?",
      "Buttercup: Sunburns.",
      "Professor: Sunburns?  Oh, yeah! ",
      "Buttercup: It's not funny!",
      "Professor: And you thought sunscreen would make you look like dorks! ",
      "Blossom: Okay. We get it. We're sorry. ",
      "Bubbles: Please, help us, Professor.",
      "Professor: Well, lucky for you, us science nerds didn't stop at inventing sunscreen. You see, we knew that people would be too cool for sunscreen when we invented it. So instead of conning stupid people out of their money with lame tricks... ",
      "Monty, Slim: Hey! ",
      "Mayor: Hey! ",
      "Professor: us scientists use our brains to cash in on people's ignorance.",
      "Slim: Who is this nerd? ",
      "Professor: Take this product, for instance. Aloe vera. Verais, of course, the species, whileAloedenotes the genus.",
      "Slim: We'll show him who's the geniuses!",
      "Monty: Let's get him!",
      "Mayor: Hey! Not bad!",
      "Buttercup: Not bad at all!",
      "Blossom: This stuff really works!",
      "Bubbles: I feel tingly! ",
      "Buttercup: What... what's happening? ",
      "Bubbles: We're... breaking!",
      "Professor: Oh, you are not. You're peeling. ",
      "Mayor: Ugh. You meanun-appealing! That'sunappealing.",
      "Monty: That is the most...",
      "Slim: disgusting thing I ever seen! ",
      "Monty, Slim: We can't take it anymore!",
      "Monty: Please! Just take us to jail! ",
      "Buttercup: You wish, Monty!",
      "Blossom: We've got a better idea.",

      "Slim: You know, they did give us sunscreen.",
      "Monty: Sunscreen is for nerds!",
      "Narrator: And so once again the day is saved-thanks to...",
      "Narrator: the Professor! ",
      "Professor: Hey! Who wantsmyautograph?",
      "Narrator: Don't push your luck. Nerd. "
    ]
  },
  {
    "episode": "Super Sweet 6",
    "dialog": [
      "Mayor: The Townsville is under attack! I'm too young and attractive to die! ",
      "Morbucks: There is no escape!  From the fun you're going to have at Morbucks' sweet 6th birthday party!",
      "Mayor: Ooh, I love birthdays! I have one every year.",
      "Morbucks: There will be an all-you-can-eat ice cream fountain.",
      "Barry: Yeah!",
      "Morbucks: An anti-gravity skating rink.",
      "Derbytantes: Woo-hoo!",
      "Morbucks: And dancing under the stars with Townsville's most eligible bachelors.",
      "Miss Keane: Ooh. Now you're talking.",
      "Morbucks: Anybody plus anybody is gonna be there.",
      "Bubbles: There's going to be a giant cotton candy machine!",
      "Blossom: What?",
      "Buttercup: And a Build-A-Tank Workshop!",
      "Blossom: What are you guys talking about?",
      "Professor: Oh, my gosh! I just got invited to Morbucks' birthday party! There's gonna be a cappuccino machine! With bionic molecular distillation and dual propane foam injectors. It combines my two favorite things, coffee and science!",
      "Blossom: Oh. I... I didn't get invited.",
      "Bubbles: Don't worry. I'm sure it's gonna be here soon.",
      "Buttercup: Yeah. She, like, invited everyone in the whole town.",
      "Blossom: Well, I guess I'm excited to get my invitation, too.",
      "Morbucks: Attention, citizens of Townsville. All of my invitations to my super sweet 6th birthday party has officially gone out. Meaning if you haven't even gotten one, Blossom, you're not invited, Blossom. Bye-bye! Bossom!",
      "Bubbles, Buttercup and the Professor: Bye!",
      "Bubbles: What a nice lady!",
      "Bubbles, Buttercup and the Professor: Party, party, party!",
      "Blossom: Wait! You're not actually gonna go, are you? She clearly invited everyone but me just to get under my skin!",
      "Buttercup: You sure you didn't do something to not deserve to not be invited?",
      "Blossom: What? I am always, always so nice to Morbucks even if she is a horrible, horrible monster! ",
      "Professor: You're right, Blossom. If we're not invited as a family, none of us should go.",
      "Buttercup and Bubbles: WHAT?!",
      "Blossom: Thanks, guys.",
      "Professor: Yes, this is the right thing to do. Even if it is the most perfect cappuccino in scientific history. ",
      "Blossom: We don't need Morbucks' 6th party to have a great time. We'll have our own party right here in the house! ",
      "Blossom: Whoo! I just reached the next tax bracket. Bubbles, you owe me 50,000 dollaes. Come on. Tonight is about family time. Ooh! I know what this party needs. Snacks!  How about some unsalted crackers and lukewarm water? With a lemon wedge? ",
      "Buttercup: Bloss, give it up. Why don't you just let us go... ",
      "Blossom: To the living room? To watch TV? That's a great idea! ",
      "Newsman: Welcome. We're coming to you live with some breaking news. Morbucks' sweet 6th birthday is the best party ever. ",
      "2 Unnamed Girls: Woo-hoo! Yeah! ",
      "Blossom: ",
      "Nature Woman: Ah, the crown spot. ",
      "Blossom: Now this is more like it. ",
      "Professor: ",
      "Nature Woman: Seen here running at full speed, it is often described as the most boring of all animals.",
      "Unnamed Girl With A Pink Shirt: Now let's get into the Morbucks party. Party slug! ",
      "Blossom: Okay, no more TV! We are just gonna sit here and stare at each other like a family. ",
      "Professor: Hey, well, we're running low on lukewarm water. I'll get some more at the store. ",
      "Blossom: No, thanks, Professor. I'll just get it from the Towns... ",
      "Professor: Whoo-hoo! ",
      "Bubbles: Hey, look, it's the Professor. ",
      "Professor: This cappuccino is all I ever wanted. ",
      "Blossom: How could he? ",
      "Buttercup: That traitor! Don't worry, Blossom. I'm gonna go down there and give him a piece of my mind. ",
      "Blossom: Thank you, Buttercup. ",
      "Buttercup: YEAH! ",
      "Buttercup: Don't worry, Blossom. I'm gonna give the Professor a piece of my mind when I find him! ",
      "Blossom: Bubbles, you're going to stay with me, right? We're having fun. RIGHT, RIGHT, RIIIIGHT?! ",
      "Bubbles: Of course. Oh, no, Blossom, what'd that behind you? ",
      "Blossom: Bubbles, I'm not going to turn around. ",
      "Bubbles: Oh, okay. Well, I'm just gonna go. Oh, my gosh! A giant cotton candy machine! It's like floating on a cloud. ",
      "Morbucks: I know, right? Isn't this fun? I certainly feel bad for anyone who wasn't invited. BLOSSOM! ",
      "Blossom: ",
      "Blossom: Hello, Morbucks.",
      "Morbucks: Well, well, look who showed up. The one person in Townsville who wasn't invited to my party. Wait a second, you actually stood in line to crash my party?",
      "Blossom: I'm not crashing your lame party that I wasn't invited to! I'm here to get my family so we can spend time together like a family!  Aah! What is this stuff?",
      "Morbucks: Indestructible icing! The latest in super hero trapping technology! I knew you'd show up eventually. I just needed some time to capture your sisters.",
      "Bubbles: Hi, Blossom!",
      "Buttercup: Hey, Bloss.",
      "Blossom: Guys!",
      "Morbucks: Without you leading them, they fell right into my trap just like you and with you losers out of the way, I'm finally gonna get my biggest birthday wish ever... to be the only super hero in Townsville!",
      "Blossom: You'll never get away with this! The professor is here, he'll save us!",
      "Morbucks: Hmm, I think he might be a little preoccupied."
    ]
  },
  {
    "episode": "Super Zeroes",
    "dialog": [
      "Blossom: The metropolis of Citysburg is in trouble.",
      "Blossom: Boom!",
      "Blossom: 'Huh?'  'The Morality Mobile? No! It can't be!'",
      "Blossom: 'Freedom Gal?!'  'With my Lasso of Regret, you will feel bad about your actions and give up!'",
      "Blossom: 'You're right. I'm sorry.'  'Justice is served!'",
      "Buttercup: Boring! That's not hard at all. Check out...",
      "Buttercup: ... 'Spore'!",
      "Buttercup: Out of the darkness he rises to kick butt!",
      "Buttercup: Kerak!  Blam!",
      "Buttercup: That hurt you more than it hurt me!",
      "Bubbles: Ooooh, I'm all tormented! Where's the magic? Where's the funny? You need to read...",
      "Bubbles: ... 'Chiisai Banii-Banii no Kawaii Bouken Monogatari'!",
      "Blossom, Buttercup: In English!",
      "Bubbles: Oh. Sorry. 'The Great Funtime Adventures of... Bunny-Bunny and Friend'!",
      "Bubbles: 'Wareras! An obstacle is evident!'  'Whoa!'  'Why wasn't shifting your decision?'  'Being a rock, I am without movement.'",
      "Bubbles: 'I am filled with solutions!'",
      "Bubbles: 'Whee!'",

      "Blossom: Man, Bubbles, Bunny-Bunny isn't even a superhero. At least Freedom Gal stops bad guys. ",
      "Buttercup: Yeah, and Spore has scabs that never heal. ",
      "Bubbles: Bunny-Bunny could heal 'em. ",
      "Blossom: No, she couldn't. She's not a hero.",
      "Buttercup: And they never heal!",
      "Professor: Girls?  Girls! What's the problem? You're the Powerpuff Girls. You're better than any of those heroes. ",
      "Blossom: Are you kidding? We don't have cool outfits and vehicles. ",
      "Buttercup: And we're not all dark and tormented! ",
      "Bubbles: And we never get out of scrapes with clever gadgets! ",
      "Professor: So you think if you get the gadgets, costumes, and attitude, you'll be better heroes?",
      "Girls: EXACTLY!  Thanks, Professor! ",
      "Professor: Oh, to be young and impressionable.",
      "Professor: 'Dr. Atom Magnum, M.D., Ph.D., Wizard.' 'Darn it, Jane! I'm not just mixing beverages here! The antidote is humanity's only hope!'  'Oh, I didn't mean to challenge your actions, Dr. Magnum. It's just...'  '... I'm so alone now.'",
      "Professor: Oh, Dr. Magnum. You dog, you.",
      "Professor: Girls! The hotline!",
      "Professor: GIRLS!",
      "Professor: Powerpuff hotline.",
      "Mayor: Oh, this is terrible! Terrible! ",
      "Professor: Well, Mr. Terrible, I'm sorry, but this line is reserved for -",
      "Mayor: No, no, no! This is the Mayor! I need the girls immediately!",
      "Professor: Sorry, Mayor. See, I thought you were-  Sorry. Hold on, Mayor. Girls! Emergency!",
      "Professor: Girls!  What are you doing in there?!",
      "Professor: Girls, what in blazes is going on?!",
      "Professor: Girls, emergency! Hop to it!",
      "Professor: I'm sorry, Mayor, they're not answering. Can I take a message?",
      "Mayor: Yes! Townsville is doomed! ",
      "Professor: Okay, hold on, Mayor. Let me try again.",
      "Professor: THE CITY OF TOWNSVILLE IS IN GRAVE DANGER! THEY COULD REALLY USE THE POWERPUFF GIRLS ABOUT NOW!",
      "Blossom: The Powerpuff Girls aren't here!",
      "Professor: Wh-what do you mean, 'not here'?! Who am I speaking to?!",
      "Blossom: Hold on!",
      "Professor: Hold on, Mayor.",
      "Mayor: HURRY!!!",
      "Professor: Gir -",
      "Blossom: Okay!  Presenting... Townsville's newest heroes!",
      "Blossom: Liberty Belle!",
      "Buttercup: Mange.",
      "Bubbles: And don't forget...",
      "Bubbles: Harmony Bunny!",
      "Blossom/Liberty Belle: And we are...",
      "Professor: Too late.",
      "Professor: Better heroes, huh?",
      "Narrator: Hey, I'm finally in the show! The next day...",
      "Professor: Okay, I'll try. Gir- ",
      "Bubbles/Harmony Bunny: We slept in our outfits...",
      "Blossom/Liberty Belle: so we'd be ready!",
      "Buttercup/Mange: What's the problem?",
      "Mayor: The monster's back! HEEEELLLLPPPPPP!!!",
      "Blossom/Liberty Belle: Evildoers beware! For when the Liberty Belle tolls... it tolls for thee!  To the Freedom Mobile! ",
      "Blossom/Liberty Belle: Oh...",
      "Bubbles/Harmony Bunny: When trouble is near... I am not slow... for it's hop, hop, hop... and away I go!",
      "Bubbles/Harmony Bunny: I am not slow... for it's hop, hop, hop... and away I... go?",
      "Bubbles/Harmony Bunny: For it's hop, hop... oh, wait, wait... for it's hop, hop... hold on! I got it... for it's hop, hop, hop...",
      "Bubbles/Harmony Bunny: Hold it! Hop, hop, hop, hop... where is it?! Hop, hop... Aha!  For it's hop, hop, hop...",
      "Bubbles/Harmony Bunny: and away... I... pogo!",
      "Bubbles/Harmony Bunny: Thanks, Professor! ",
      "Professor: You're welcome. Hurry up, now. ",
      "Bubbles/Harmony Bunny: Harmony Bunny is not slow!",
      "Bubbles/Harmony Bunny: For it's... hop, hop, hop... and away... I... go!",
      "Professor: Well... aren'tyougoing?",
      "Buttercup/Mange: Uh-uh. Too bright. Mange only travels at night. ",
      "Mayor: Confound it!  Where can those blasted girls be?!",
      "Mayor: Oh! ",
      "Blossom/Liberty Belle: Sorry we're late, Mayor.",
      "Bubbles/Harmony Bunny: But we're here!",
      "Buttercup/Mange: And ready to fight!",
      "Mayor: Splendid! But there's a teensy little problem. THE MONSTER LEFT!!  Better heroes, huh?!",
      "Blossom/Liberty Belle: So you're back!",
      "Bubbles/Harmony Bunny: Well, we stayed here all night...",
      "Buttercup/Mange: so we'd be ready.",
      "Blossom/Liberty Belle: Well, monster, prepare to face... Liberty Belle... Harmony Bunny... and Mange!",
      "Buttercup/Mange: Um, it's a little bright, so, I'm just gonna sit this one out, okay?",
      "Blossom/Liberty Belle: Using my Lariat of Guilt, I will force the monster to admit his wrongdoing!",
      "Blossom/Liberty Belle: Now, don't you feel bad about what you've done?  Give in to those feelings and surrender!",
      "Bubbles/Harmony Bunny: Hyah! Hyah! Hyah!",
      "Bubbles/Harmony Bunny: There!  Now you're covered with happy stickers!  Their good sweet powers will take hold of you and make you smile!",
      "Blossom/Liberty Belle: He's not giving in!",
      "Bubbles/Harmony Bunny: I used my stickers!",
      "Blossom/Liberty Belle: Mange, help us!",
      "Buttercup/Mange: Uh, maybe later.",
      "Bubbles/Harmony Bunny: This'll... make you... happy!",
      "Blossom/Liberty Belle: Succumb to the Lariat! Feel your guilt and admit defeat!",
      "Monster: STOOOOOPPPPP!!",
      "Blossom/Liberty Belle: Huh?",
      "Bubbles/Harmony Bunny: Wha...?",
      "Buttercup/Mange: Huh?",
      "Monster: Better heroes, huh?  Listen, girls. My name is Steve. I'm a monster. I've been coming here for three days, causing all sorts of damage to your town. And what do I get? Two days of no-shows, and now this. A flag girl who does rope tricks, some rabbit, and Little Miss Darkness who's afraid of a little sun.",
      "Buttercup/Mange: Hey! Do you have any idea who you're talking to?! ",
      "Bubbles/Harmony Bunny: We're superheroes! ",
      "Blossom/Liberty Belle: Real ones!",
      "Monster : Yeah, well, that's great and all, but-but, what am I supposed to tell the guys back on Monster Isle?",
      "Steve: You see, when a monster visits Townsville... he must fight the Powerpuff Girls. And if he can hold his own... and make it back to Monster Isle alive... he's a hero!",
      "Steve: Now this new bit is just not gonna cut it. Sure, you didn't have a thirst for vengeance... stickers with your face on them... or souped-up vehicles...",
      "Steve: ... 'cause you didn't need 'em! See...",
      "Steve: even if you take away the costumes, props, and angst, you still have all the bravery and courage it takes to save the day. So what do you say?",
      "Steve: Powerpuff Girls? ",
      "Blossom: Let's get him, girls! ",
      "Steve: Now that's better...",
      "Narrator: So once again the day is saved...",
      "Narrator: with no thanks to Liberty Belle, Harmony Bunny, or Mange...",
      "Narrator: but to the one and only Powerpuff Girls!"
    ]
  },
  {
    "episode": "Superfriends",
    "dialog": [
      "Narrator: The city of Townsville... is peacefully quiet at the break of dawn...",
      "Narrator: as all of its citizens...",
      "Narrator: beautiful friends...",
      "Narrator: and family alike are fast asleep.",
      "Narrator: Including our precious little girls... Blossom, Buttercup, and Bubbles.",
      "Bubbles: Can't be garbage day already... ",
      "Buttercup: What's all the ruckus?",
      "Blossom: Let's go see.",

      "Blossom: Get over here!",
      "Bubbles: What?",
      "Blossom: Get down!",
      "Bubbles: Blossom! ",
      "Blossom: What?",
      "Bubbles: I don't get it. What are we hiding behind the bush for?",
      "Blossom: Shhh! This is a covert operation.",
      "Blossom: If you don't lower your voice... people will know that we're spying. Now keep your voice down and lay low.",
      "Blossom: Hey!  Look at all that plastic ware. ",
      "Bubbles: What if our new neighbor is a beautiful lady and falls madly in love with the Professor?",
      "Buttercup: Just because you see plastic ware, doesn't mean it has to be a girl.",
      "Blossom: Yeah. Boys need a place to put leftovers, too.",
      "Bubbles: All right already!",
      "Buttercup: Yeah! I bet our neighbor's a swinging bachelor! ",
      "Bubbles: Whoa!  Look at all those weights!",
      "Bubbles: I bet our new neighbor is strong and very manly. ",
      "Blossom: Bubbles! Women lift weights, too. I bet she's probably a highly intelligent female bodybuilder. ",
      "Bubbles: That falls madly in love with the Professor? ",
      "Buttercup: I hope not. Look!",
      "Blossom: That can only mean one thing.",
      "Girls: Married.",
      "Buttercup: Ick!",
      "Blossom: I bet they're just another boring couple like everyone else on our block.",
      "Bubbles: Hey, look! Check out that big box of toys! ",
      "Blossom: Now, Bubbles, you know that lots of old people play with toys too.",
      "Bubbles: You're right. Look at that little man standing right next to 'em.",
      "Buttercup: Bubbles! That's not a little man, that's a girl.",
      "Blossom: You think she can see us?",
      "Bubbles: Yoo-hoo!",
      "Buttercup: Yep.",
      "Bubbles: Yoo-hoo! Yoo-hoo!  Hey! Hey! Hey, you! Yoo-hoo! Hello?  Whoo! Whoo-hoo! Over here! Yoo-hoo! You!  Hey, you! Yoo-hoo, yoo-hoo!",
      "Bubbles: I think she saw me!  Come on! Let's go say hi!",
      "Bubbles: Hi. I'm Bubbles, what's your name, what grade are you in, what's your favorite color, what's your favorite animal, do you like drawing?",
      "Girl: Hi. Um... I'm Robin Snyder. Let's see, uh... kindergarten... um, elephants, and... yeah, I like drawing.",
      "Bubbles: Your favorite color is elephant?",
      "Bubbles: Hey! This is Robin. I like her. She draws. These are my sisters, Blossom...",
      "Blossom: On behalf of all the citizens of Townsville, I'd like to welcome you to our neighborhood.",
      "Bubbles: and Buttercup.",
      "Buttercup: Yeah, wassup? ",
      "Girl : Hey, do you all go to Pokey Oaks?",
      "Blossom, Bubbles: Uh-huh.",
      "Robin: I'm starting there next week. ",
      "Bubbles: You'll love it! They have arts and crafts.",
      "Blossom: And story time.",
      "Buttercup: And recess.",
      "Robin: Do they have dodgeball? ",
      "Buttercup: Uh-huh.",
      "Robin: I love to do all those things, but I haven't gotten to 'cause all my toys and books have been packed up.",
      "Bubbles: Well, then, why don't you come over to our house to play? We got everything.",
      "Robin: You really mean it?",
      "Bubbles: Yeah!  Right?",
      "Blossom: Correct.",
      "Buttercup: Right on.",
      "Bubbles: Come on! Let's go!",
      "Bubbles: This is our house. Our room is upstairs.",
      "Bubbles: This is our dad. This is Robin from next door.",
      "Professor: Why, hello there, Robin. It's very nice to have you as our new neighbor. I'm the Professor.",
      "Bubbles: Yeah. He made us in his laboratory by accident.",
      "Professor: Well, what can I say? ",
      "Robin: Don't worry, Professor. I was an accident too.",
      "Robin: Your dad is funny. ",
      "Girls: Let's play!",

      "Professor: Oh, girls...",
      "Bubbles: Hi, Professor!",
      "Bubbles: We're jumping!",
      "Professor: Yes, I can see that, Bubbles. Um, Robin's mother called. It's time for her to go home. Robin's got a lot of unpacking to do.",
      "Girls, Robin: Awww...",
      "Professor: Come on now, girls, there's always tomorrow.",
      "Girls, Robin: Yaaaay! ",
      "Bubbles: So, you think you can come over tomorrow?",
      "Robin: Sure. I just have to ask my -",
      "Girls: Are you okay?",
      "Robin: Am I okay? Are you okay? You... you're all floating! ",
      "Blossom: Floating...? ",
      "Girls: Oops. ",
      "Blossom: Sorry, Robin. We forgot to tell you... we have superpowers.",
      "Robin: Okay. I have superpowers too.",
      "Girls: Really?",
      "Robin: Yeah, watch.",
      "Bubbles: I think it's done.",
      "Girls, Robin: Ooooh... ahhhh...",
      "Buttercup: It looks delicious!",
      "Blossom: So... uh... Robin...",
      "Blossom: what do you think of Townsville? ",
      "Robin: I love it! It's the best place I've ever lived! ",
      "Buttercup: Know what else is the best?",
      "Buttercup: Sleeping under the stars.",
      "Blossom: Yeah, and you know what else?",
      "Blossom: Cats!",
      "Robin: I have a cat.",
      "Bubbles: You do?",
      "Robin: Uh-huh.",
      "Robin: Her name's Ginger. She catches mice, but she doesn't eat 'em.",
      "Bubbles: We had a cat for about a week once...",
      "Bubbles: but he turned out to be an evil kitty.",

      "Buttercup: The Professor once invented the perfect pet for us.",

      "Buttercup: He was really cool and smart and funny...",
      "Buttercup: but he had a little problem. He ate too much.",
      "Blossom: Too much? What do you mean, too much? You landed on Broad Street and that's how much rent is, so pay up.",
      "Bubbles: Fine! Here you go!",
      "Bubbles: Robin, go!",
      "Bubbles: Go, Robin, go!",
      "Blossom: Heather Tiffany, Garrett's here to pick you up. Have fun!",
      "Robin: Thanks, Aunt Brashley. Where's your date... Chadwick?",
      "Bubbles: Here I am. Ready for a night on the town? ",
      "Robin: But my favorite thing about Townsville is my new friends.",
      "Blossom: Me too.",
      "Buttercup: Me three.",
      "Bubbles: Me four. ",
      "Mayor: Mmmm.... mmmm... mmm-hmm-mmm... pie!... mmm....",
      "Ms. Bellum: Mayor, a monster is attacking Townsville. He just stepped on your house. But don't worry... your wife is safe, and all that's gone is your prized rosebushes.",
      "Mayor: HEEEELLLLPPPP!!!",
      "Robin: We're almost there!  Keep your eyes closed. No peeking.",
      "Robin: Okay, you can open your eyes now.",
      "Robin: My dad built it for us. ",
      "Blossom: Come on!",
      "Robin: I see you!",
      "Blossom: I see you! ",
      "Mayor: Oh, folderol!  It's hopeless! My rosebushes are done for, and there's no possible way to get ahold of them- all because the girls won't answer their stupid phone!",
      "Mayor: Oh... yeah.",
      "Robin: It's almost lunchtime. And Mom's made us some yummy sandwiches. ",
      "Blossom: Cool!",
      "Bubbles: Awesome!",
      "Buttercup: Yeah, I'm starved. ",
      "Robin: Hey, what's that?",
      "Robin: What's wrong?",
      "Bubbles: Remember when we told you we had superpowers?",
      "Blossom: Well, we have to use them to save the day and stuff.",
      "Robin: Well, will you be back in time for sandwiches?",
      "Buttercup: I don't think so.",
      "Robin: Well, that's okay. It's not like it happens every day, right?",
      "Blossom: Come on, girls. We better go.",
      "Girls: Sorry, Robin. ",
      "Robin: It's nice of you guys to walk me to school on my first day.",
      "Blossom: Well, it's the least we can do after having to ditch you last week to go save the day.",
      "Buttercup: Besides, we've never walked to school before.",
      "Bubbles: Yeah!  It's fun, but it sure takes a lot longer.",
      "Princess: Hey, girls, let me be a Powerpuff Girl for a day and you can ride in Daddy's limo with me to school.",
      "Blossom: No thanks, Princess. We'd rather walk our new friend Robin to school.",
      "Princess: Very well, then. You obviously don't know a thing about first-class travel. How about five bucks?",
      "Blossom: Would that be five bucks to ride in your limo, or five bucks to be a Powerpuff Girl?",
      "Princess: Let's go, Alfred. This is a waste of time.",
      "Robin: Who was that?",
      "Blossom: That's just Princess. She's pretty harmless.",
      "Blossom: Here we are. Are you ready to meet Ms. Keane and all the kids?",
      "Robin: You bet! ",
      "Ms. Keane: Girls? Girls! The Mayor called. He needs you pronto!",
      "Blossom: Here we go again. Sorry, Robin. You'll have to introduce yourself to the class without us. We'll see you later.",
      "Princess: Hey, kid, cheer up. You need to stick with me. I'll show you a good time. Let me tell you a little story... about me, of course.",
      "Princess: You know, it's really difficult being a kid... especially a really, really rich one. There are so many things to do, places to be, so many places to GOOOOOO!",
      "Princess: It's sickening, just thinking about how much money I have to spend every day.",
      "Princess: I get no rest... and as you can guess... I can't live without my beauty sleep.",
      "Princess: So you see, it's not that easy being rich. It takes training and practice.",
      "Princess: Did I say that it's not easy being rich? I mean, there's no time to relax or anything.",
      "Princess: Enough about me. Tell me something about you. Wait, shut up. The show's about to start.",
      "Princess: So... where was I?",
      "Princess: Listen! I own it and you rent it, so pay up now or get the heck out! What part of that don't you understand?  Hmph! Poor, lowly tenants.",
      "Princess: LIKE I SAID, THERE ARE SO MANY THINGS TO DO, THINGS TO BUY, CARS TO OWN...",
      "Princess: dolls to play with... Hey, stop! Stop!",
      "Princess: You're not supposed to be kissing Dirk! Where's Taylor? Taylor?  Taylor'! Get over here! You're supposed to be kissing Dirk!",
      "Princess: Like I was saying, being wealthy is not for the weak of heart. It's never an easy ride.",
      "Princess: That's for sure.",
      "Woman: Say good night, sucker. It's way past your bedtime.",
      "Man: No... please... don't... I didn't... ",
      "Princess: Ooh! ",
      "Woman: Maybe now you'll tell me where I can find Francisco's hideou -",
      "Whitfield: We interrupt this broadcast to bring you the latest news involving the Powerpuff Girls' earlier encounter with the creature seen here retreating back to Monster Isle.",
      "Whitfield: What seemed to be a short exchange of dialogue...",
      "Whitfield: escalated into yet another classic example of superhero know-how.",
      "Princess: Aw, man, we're missing our show! I don't remember asking for a Powerpuff Girls news bulletin, do you?",
      "Robin: Um...",
      "Princess: They're always running around saving stuff, helping people, trying to make everyone feel safe!",
      "Robin: But they have to. That's their job.",
      "Princess: Yeah, they fed me the same line. ",
      "Robin: They did?",
      "Princess: I mean, if I don't like someone, I just say so. 'Oh, we have to go save the day now!'  If I had a nickel for every time I've heard that one, I'd be rich!... Well, richer.",
      "Robin: I just wanted to be friends.",
      "Princess: It's not your fault. The Powerpuff Girls don't have time for friends... but I do. ",
      "Robin: Hmmm...",
      "Princess: Boy. You must be really mad at the girls.",
      "Robin: Well...",
      "Princess: I don't blame you. If someone I considered to be my friends did to me what they did to you, I'd want to do the same thing.",
      "Robin: What thing?",
      "Princess: Get back at 'em, of course!  And I know just how to do it.",
      "Princess: Okay. This is the spot. You know what to do.",
      "Robin: I don't know, Princess.",
      "Princess: What? Don't you want to pull one over on those dumb Powerpuffs?",
      "Robin: Well... um...",
      "Princess: I thought we were supposed to be friends.",
      "Robin: We are!",
      "Princess: Well, prove it! Go in there and get what we came for!",
      "Princess: I'll be right here.",
      "Princess: You're doing great!",
      "Mayor: Hello, Mayor here.",
      "Princess: Yeah, Mayor? We've got a shoplifter down at the mini-mart.",
      "Mayor: You don't say!",
      "Princess: You better call the Powerpuff Girls. This one looks dangerous.",
      "Blossom: Running is futile! There's no escape!",
      "Princess: That won't be necessary, Blossom.",
      "Girls: Princess?!",
      "Princess: I've taken care of everything.",
      "Girls: Robin?! ",
      "Blossom: What's going on, Princess?",
      "Princess: I caught this little shoplifter red-handed. Seems she couldn't control her sweet tooth. Luckily, I, Princess, was here to put an end to her sticky fingers. Pretty impressive, huh, girls?",
      "Blossom: Robin, is this true?",
      "Princess: Well, there you have it. I guess you'll finally have to let me be a Powerpuff Girl. ",
      "Bubbles: Not so fast, Princess!",
      "Buttercup: Robin deserves a chance to tell her side of the story.",
      "Robin: It's true. I was going to steal the candy.",
      "Robin: I was just so upset with you for always leaving me to go save the day.",
      "Blossom: That doesn't make it okay to steal... ",
      "Princess: That's right, you... stealer!",
      "Robin: But stealing candy was your idea!",
      "Princess: No! You're a liar and a thief, and I caught you! And for that, I deserve to be a Powerpuff Girl!",
      "Robin: Why are you doing this? I thought we were supposed to be friends!",
      "Princess: Don't you realize I just used you? I don't need any friends! I need to be a Powerpuff Girl!",
      "Princess: You're just some poor dork that thinks the Powerpuff Girls like you!",
      "Princess: And why would the Powerpuff Girls want to hang out with you, when they could be friends with me?",
      "Princess: Someone who actually has the potential to be a superhero! Not just any superhero- a super-duper-hero! Feared and in...",
      "Princess: Hey! Where do you think you're going? I am not finished! Come back here!",
      "Bubbles: Hey, Robin, we're sorry...",
      "Buttercup: we left you behind all the time.",
      "Blossom: It was never because we didn't like you. It's just...",
      "Robin: I know. That's your job.",
      "Professor: Hello?",
      "Mayor: Professor, quick! Get the girls! It's an emergency!  My pickle jar's stuck, and I'm starving!",
      "Professor: You don't say. Well... the girls are pretty busy right now. Maybe they could come by later.",
      "Narrator: So once again the day, and their friendship, is saved- thanks to the Powerpuff Girls!"
    ]
  },
  {
    "episode": "Supper Villain",
    "dialog": [
      "Narrator: The city of Townsville-an average city with average suburbs and average neighborhoods with average family homes.",
      "Narrator: Here we start with an average family, the Smiths.",
      "Mrs. Smith: You'll never guess what's for breakfast.",
      "Mrs. Smith: Pancakes!",
      "Son: This family stinks!",
      "Professor: Hiya, neighbor! Just trimming the hedges and feeling great.",
      "Professor: My life's going perfect, ju-u-ust perfect! Oh, I think I'll sing the 'My Life Is Perfect' song. My life is so perfect... ",
      "Mrs. Smith: Hi, honey, here's your paper. Oh, by the way, Julie has a few friends over- the Powerpuff Girls!",
      "Julie: Look, Daddy, we're playing jacks!",
      "Son: I hate you!",
      "Announcer: We interrupt this program to bring you a breaking news update.",
      "Reporter: This is Stanley Whitfield, live in front of City Hall,",
      "Reporter : where the evil Mojo Jojo has captured the Mayor and is keeping him hostage inside City Hall.",
      "Whitfield: We've patched into a security camera to get a better view of the situation.",
      "Whitfield: It seems Mojo Jojo has a raygun to the Mayor's head.",
      "Whitfield: How can this be happening?",
      "Whitfield: I'm standing with Police Chief Hiddledee of Townsville Police Department. Chief Hiddledee, what is your assessment of the situation?",
      "Hiddledee: Stanley, when dealin' with Mojo Jojo, we're talkin' pure evil.",
      "Hiddledee: We got guns, we got tanks, we got missiles all aimed at the Mayor's office, but pure evil cannot be stopped by these methods. It seems as though evil will prevail.",
      "Whitfield: Thank you for your time, Chief Hiddledee.",
      "Mrs. Smith: You'll never guess what's for breakfast. Pancakes!",
      "Son: No one understands me!",
      "Announcer: We interrupt this program for a breaking news update.",
      "Whitfield: Hello. This is Stanley Whitfield, live in front of City Hall, where Mojo Jojo still has our beloved Mayor captive. And if this situation isn't already horrific, last night it accelerated to new heights.",
      "Whitfield: On the phone with us is rescue theorist Maria Santiago. Are you there, Maria?",
      "Maria: Yes. Hello, Stanley.",
      "Whitfield: Maria, as we show the viewers last night's footage, could you please comment?",
      "Maria: Yes, of course.",
      "Maria: At approximately 7: 45 P.M. last night, when the situation looked its darkest,",
      "Maria: the Powerpuff Girls arrived at the scene.",
      "Maria: Once inside, it seemed the Powerpuff Girls had Mojo Jojo on the run.",
      "Maria: But just then, the tables turned.",
      "Maria: Mojo Jojo reclaimed his control. Townsville could be in big, big trouble. Stanley?",
      "Whitfield: Thank you, Maria. This is a grim day for Townsville. Not only is the Mayor being held hostage, but so are the Powerpuff Girls.",
      "Mrs. Smith: Dinner will be ready in fifteen, honey.",
      "Mrs. Smith: You'll never guess what's for breakfast. Pancakes!",
      "Son: Leave me alone!",
      "Whitfield: Hello, this is Stanley Whitfield, live in front of City Hall. It's day three of the hostage situation, and we're still at a standstill. What the-?!",
      "Whitfield: Wha? Mojo Jojo is captured!  The Mayor is safe!",
      "Whitfield: Thank you, Powerpuff Girls! Bless your huge little heads!",
      "Mrs. Smith: Sorry, dear. No private time tonight. We're having dinner guests.",
      "Mrs. Smith: Oh, good, they're here.",
      "Mrs. Smith: Look who's here!",
      "Professor: Hiya, neighbors!",
      "Girls: Thank you for inviting us.",
      "Mr. Smith: Yeah, uh... hi. Gosh, it's, uh-uh, great to see you. Marianne, I-I don't think tonight's going to, uh, be a good, uh, night, uh, you know, for this, uh... tonight.",
      "Mrs. Smith : Just a moment.",
      "Marianne: You listen to me, Harold! That family has lived a nightmare for the past three days, and we're going to be good neighbors and help them out through these troubled times. Do not, Harold,ruin this dinner!  Come in!",
      "Marianne: Now isn't this nice? ",
      "Professor: Oh, yes. It's nice to relax with friends after a long battle against evil.",
      "Son: That's right. You really took care of Mojo Jojo, huh?",
      "Mr. Smith : You know, Buddy, I-I really, uh, think that... maybe we-we-we should talk about something else.",
      "Son : Okay, Dad, let's talk aboutyouramazing day. How many mustard jarsdidyou fill?",
      "Blossom: We don't mind telling the story.",
      "Buttercup: And to start, villains are stupid. ",
      "Harold: Hi, excuse me. Hi, hi-ho, I'm just going to just quickly use the bathroom. ",
      "Buttercup: So anyway, we busted in on Mojo, and-",
      "Harold: All right, Harold, you can... you can do this. Just make it through this one night-just one night. Break.",
      "Bubbles: Then, I started to smash his face!",
      "Blossom: Basically, there's no villain around that could take us.",
      "Harold: Oh, really? ",

      "Marianne: What a joker Harold is. You're joking, right, Harold?",
      "Harold: No. I'm finally free, Marianne. I'm the arch-villain I always wanted to be. No more mustard jars and routine days for me! And definitely no more average Harold Smith! I am now supervillain-uh, Harold Smith!",
      "Buddy: All right, Dad!",
      "Marianne: So tell me, Harold. What are you going to do with this newfound identity? Hmmm? ",
      "Harold: I'm glad you asked, Marianne. I'm going to take this raygun-  -andmelt the Professor's head clear off his shoulders, ha, ha, ha, ha!",
      "Harold: And that's just for starters.",
      "Marianne: Stop it! Stop it, stop it!  You are not going to ruin this dinner, I've worked too hard on it!  Everyone to the table-NOW!!  We are going to have a nice evening together.",
      "Harold: Mmm-hmm. But the second that meal is over, GOODBYE, PROFESSOR HEAD!",
      "Marianne: Bon Appetit.",
      "Marianne: Isn't this nice?",
      "Julie: Does anyone want to play jacks after dinner?",
      "Buddy: Man, Dad, you're the coolest.",
      "Harold: I'm done. ",
      "Professor: This issooogood, Mrs. Smith, that I'm going to just take my time with this plate here. ",
      "Buttercup: I'm done.",
      "Blossom: I'm done.",
      "Bubbles: I'm done.",
      "Marianne: Well... we should do this more often.",
      "Julie: Does anybody want to play jacks after dinner?",
      "Buddy: Man, Dad, you're the coolest!",
      "Harold: Eat your pea, Professor.",

      "Harold: Eat it!",
      "Harold: SWALLOW IT!!",
      "Marianne: Who wants dessert?",
      "Professor: I do!",
      "Harold: AW, FOR CRYING OUT LOUD, MARIANNE! ",
      "Marianne: It's... coconut cream pie.",
      "Marianne: I made one for each of you.",
      "Harold: Well, you do make great coconut cream pies, Marianne.",
      "Blossom: Then-eat up, Harold!",

      "Harold: Why, you little brat!",
      "Marianne: Harold...?",
      "Julie: Does anybody want to play jacks after dinner? ",
      "Buttercup: Take that, kin of evil!",
      "Buttercup: Bubbles!",
      "Blossom: STOOOOPPP!! Have you all gone mad?! ",
      "Policeman: What's going on in here?!",
      "Girls, Professor: He's got a gun!",
      "Professor: Thanks for a wonderful time, Mrs. Smith. We should do it again real soon. Uh... bye. ",
      "Marianne: Those Powerpuff Girlsruined my dinner!",
      "Narrator: Uh-oh. Looks like evil runs in the family.",
      "Narrator: So once again the day is sav-uh, I mean, dinner is ruined, thanks to the Powerpuff Girls!"
    ]
  },
  {
    "episode": "Sweet 'N Sour",
    "dialog": [
      "Narrator: The city of Townsville! ",
      "Blossom: It's the same old same old, I tell you.",
      "Bubbles: Ooh, little puppy, I love you... and I love you..... and I-... think you're swell. ",
      "Buttercup: ",
      "Bubbles: Buttercup, stop! You're hurting my babies! Stop! ",
      "Buttercup: Geez, Bubbles, they're just stuffed animals.",
      "Bubbles: I don't care, they're cute and fuzzy, and I love them.",
      "Blossom: You wouldn't hurt them if they were real. And they're real to Bubbles, so cool it. ",
      "Buttercup: Saps! That's what you are, a bunch of saps. ",
      "Blossom: Hello? Yeah Mayor, what's up?  Oh, okay, we'll be right there. Another robbery at the bank. Come on. Alright, who is this... ",
      "Bank Manager: Here's the last bag of money. Now don't forget to come on back and rob us again tomorrow. Ohh, you're so cute. ",
      "Bubbles: Look! The bank's being held up by little baby animals. Isn't that sweet?",
      "Buttercup: Watch out, they could be dangerous. I'll take of this! ",
      "Blossom: Wait! Buttercup! ",
      "Buttercup: Hey! Where do you think you're going with Townsville's money?",
      "Cuddly Bunny: Ow! You hurt me! ",
      "Puppy Wuppy: Please! Have mercy!",
      "Lady #1: Oh poor things!",
      "Man #1: Did you see how she almost tore off his arm?",
      "Bank Manager: I've never seen such unnecessary brutality in my life! ",
      "Bubbles: What should we do?",
      "Blossom: They might be cute and cuddly but they still broke the law.",
      "Cuddly Bunny: Please!  We're sorry. We didn't know we was wrong. ",
      "Puppy Wuppy: We're just poor little orphans.",
      "Fluffy Kitty: Please. We won't do it again. ",
      "All the people: Awwwww.",
      "Bubbles: We can't turn them in. They're just harmless little furries.",
      "Blossom: Ohhh. Okay, you can go. Come on, let's go.",
      "Buttercup: So we're just going to let 'em go just like that?  Hmmm. Not even a mansion that can hold up a bank.",
      "Blossom: Come on, Buttercup. Lightning up. How harmful could they really be? ",
      "Bubbles: The Townsville Jewerly Store? We'll be right there! ",
      "Blossom: It's you!... Again.",
      "Jewel Owner Woman: Is there anything else you like to steal? ",
      "Puppy Wuppy: Help! Don't let her hurt me!",
      "Jewel Owner Man: Please take another diamond. ",
      "Cuddly Bunny: Ohhh. The pain. ",
      "Man #2: Hey look. It's those little adorable animals. And those big ugly Powerpuff Girls. ",
      "The Fluffy Bunch: Please! Help us!",
      "Cuddly Bunny: Please don't let them harm us!",
      "Fluffy Kitty: We're very very sorry.",
      "Puppy Wuppy: We'll never do it again.",
      "Woman #2: You're not taking them to jail, are you?",
      "Man #3: They don't know any better.",
      "Man #2: They're just babies for crying out loud.",
      "Bubbles: I'm sorry. They have to learn their lesson. ",
      "Puppy Wuppy: Listen hear, you bug eyed creeps. We won't last one minute in that jail!",
      "Cuddly Bunny: Yeah. Not with our... cute little faces.",
      "Fluffy Kitty: Yeah. So why won't you do us all a favor and let us go now?",
      "Blossom: No way! ",
      "Bubbles: Here are the convicts we told you about.",
      "Policeman: Hey there, little guys. This is a prison, not a pet shop. What am I suppose with them?  Aww come here, you little... Ohhh. ",
      "Bubbles: No one believes us.",
      "Buttercup: Now you still think they're cute? Huh?  Hunchback! I thought you were gone forever! ",
      "Blossom: Of course, we'll be right there. Hold it! Right there! ",
      "Guide: Please. If there's anything you need. ",
      "Buttercup: You can't fool us.",
      "Leprechaun: You're the only fools here!",
      "Woman #3: Why don't you leave the poor innocent things alone?",
      "Old Lady: What are you going to do? Put muzzles on them?",
      "Bubbles: Where are we going to take them? We can't take them to jail.",
      "Blossom: I know. We'll take them to the Mayor. He'll know just what to do. ",
      "Mayor: I know just what to do. Give em a full pardon for all their adorable crimes. And shame on you, Powerpuff Girls. You terrible, terrible people. What are ya? Animal haters?  Ohhh, you cute poodily woodlies. Uh come to daddy!  Oh ho ho ho! They're steaming up my harmarnical. Ho ho. ",
      "Puppy Wuppy: You're going down, Powerpuffs. ",
      "Buttercup: Oh yeah, we'll see about that. ",
      "Bubbles: ",
      "Man #4: Go home, Powerpuff Girls!",
      "Bubbles: We are home, doo-doo brain! ",
      "Blossom: Bubbles, it's no use. Everyone hates us.",
      "Radio: So what if the few little animals are thieves? Does that mean they should be punished? ",
      "News Lady: The Fluffy Bunch is gaining city wide attention with their cuddly crimes. They are so adorable. ",
      "All the people: Yaaay! ",
      "Boy nerd: ",
      "Ladies: Whoohooooooooooooooo! ",
      "Mayor: I can't wait to hear about your next robbery. ",
      "Bubbles: Talk to me, kitty, say something! What? So you now you all hate me, is that it? ",
      "Buttercup: We're helpless. What are we going to do?",
      "Bubbles: Maybe if we wait six months, then they'll be all grown up and we can beat 'em up.",
      "Blossom: We don't have that kind of time! The Fluffy Bunch is robbing Townsville blind.",
      "Bubbles: They're just... so... CUTE! Everyone loves them too much! ",
      "Blossom: That's it! ",
      "Puppy Wuppy: What a week. We sure have Townsville fooled.",
      "Cuddly Bunny: Yeah. We stolen just about everything in sight.",
      "Fluffy Kitty: I feel ya, though. I can't wait to get out of this place. All the hugging and cuddling and cute talking... is driving me crazy!",
      "Puppy Wuppy: Don't worry. We'll be outta here in no time. Whoa! Look! A new bank! Let's hit it! ",
      "Kids: ",
      "Girl: Look! Cute fuzzy animals! Let's hug em! ",
      "The Fluffy Bunch: AAAAAAAH! ",
      "Puppy Wuppy: Ooh. Ow. Yow! Cut it out! Stop! Yow! That's hurt! OWWW!",
      "Cuddly Bunny: OW OW OWW. OOH No. OWW. Watch the ears! My toe! Oww.",
      "Fluffy Kitty: Ugh. Ow. Ugh. Aah! Meoooow. Ugh Ooh. Uhhhhh!",
      "Kids: ",
      "Fluffy Kitty: Help! Help!",
      "Cuddly Bunny: Help! Help! Help!",
      "Puppy Wuppy: HELP! HELP! HELP! ",
      "Kids: Yaaaaaaay! ",
      "The Fluffy Bunch : PLEASE HELP US! HELP! ",
      "Bubbles: Well, do you think that was enough punishment for their crimes?",
      "Buttercup: Definitely.",
      "Blossom: Well you know what they say, 'If you can't beat 'em, love 'em.' ",
      "Narrator: Too bad the day was saved by the Powerpuff Girls, because they were so cute and furry and snuggily and huggable. MMMMM."
    ]
  },
  {
    "episode": "That's Not My Baby",
    "dialog": [
      "Narrator: The city of Townsville... is being attacked by an angry monster!",
      "Man 1: And it's headed straight for that baby carriage!",
      "Boy: Yay! Hooray for the Powerpuff Girls!  Geez, can you imagine if there had been a baby in that carriage?",
      "Narrator: And once again peace is restored. ",
      "Woman 1: Oh, thank goodness! ",
      "Bubbles: Here you go, lady. You have a really cute baby.",
      "Woman 1: I know. But that's not my baby.",
      "Bubbles: Oh. Sorry. Here you go.",
      "Woman 2: That's not my baby.",
      "Bubbles: Is it your baby?",
      "Woman 3: Nope.",
      "Bubbles: Is it your baby?",
      "Woman 4: No.",
      "Bubbles: Is it your baby?",
      "Man 2: Yeah. Ow!... Uh, no, that's not my baby.",
      "Buttercup: Hey, people!  Doesn't anybody know whose baby this is?",
      "Buttercup: So now what?",
      "Blossom: I guess we find more moms.",
      "Bubbles: Do you know whose baby this is?",
      "Woman 5: I'm sorry, doesn't belong to anyone I know. ",
      "Buttercup: Have you ever seen this baby?",
      "Woman 6: Nope, sorry, not familiar at all. ",
      "Blossom: Is this your baby?",
      "Woman 7: My baby? That thing don't look nothin' like me!",
      "Woman 7: Nope! ",
      "Blossom: I don't get it.",
      "Bubbles: I know. She looked like a big baby.",
      "Blossom: No, I mean we've asked every woman in Townsville, and nobody has ever even seen this baby before.",
      "Buttercup: So let's just find a babysitter.",
      "Ms. Keane: Girls! What are you doing here?  School got out five hours ago.",
      "Girls: Ummm...",
      "Buttercup: We brought you something. ",
      "Ms. Keane: Oh! Is it an apple? Well, I just love sweet little a-",
      "Ms. Keane: -aaaaaa!  A baby?",
      "Bubbles: See? I told you she'd love a sweet little baby. ",
      "Ms. Keane: Girls, where did you get that thing?",
      "Blossom: Well, we're looking for his mother, and we just need someone to look after him for a little while. ",
      "Girls: Pleeeeeease?",
      "Ms. Keane: Ohhh, no, girls, no, no, no. I'm sorry.",
      "Bubbles: But, Ms. Keane, I thought you loved kids.",
      "Ms. Keane: Well, of course I do.",
      "Ms. Keane: That's why I'm here, grading homework so all of my twenty-three kids can get the education they deserve-  -because I love kids.",
      "Girls: But... but...",
      "Ms. Keane: All righty, girls, let's get moving. Big day tomorrow. ",
      "Girls: Okay.",
      "Ms. Bellum: You want me to take care of a baby? Look, girls. I'd love to help you, but I already have a baby to take care of. ",
      "Bubbles: You have a baby, Ms. Bellum?",
      "Mayor: Why can't we name Main Street after me? Hmph!",
      "Ms. Bellum: As you can see, girls, a big baby.",
      "Mayor: Ooh, baby? I'll take a baby. I looooove babies! ",
      "Blossom: Uh, sorry, Mr. Mayor. Uh, you seem really busy around here. ",
      "Mayor: What? I'm not doing anything.",
      "Ms. Bellum: Oh, Mayor! It's time for your warm milk!",
      "Mayor: Ooh, milky! Milky, milky!",
      "Buttercup: Baby!",
      "Blossom: You look like you like kids.",
      "Blossom: Well, girls, it looks like we're looking after a baby. ",
      "Buttercup: I think it's a bad idea!",
      "Blossom: Well, until we can find his mother, we don't have a choice.",
      "Bubbles: Maybe if we show that we can take care of a baby, the Professor'll let us have a hamster.",
      "Blossom: Yeah!",
      "Buttercup: A hamster!",
      "Bubbles: I mean, how hard can it be? We're superheroes!",
      "Bubbles: Is it broken?",
      "Blossom: Maybe it's hungry.",
      "Buttercup: What do they even eat? ",
      "Bubbles: I know just the thing!",
      "Bubbles: Veggie burger! ",
      "Buttercup: Babies don't even have teeth, stupid! He can't chew a veggie burger!",
      "Bubbles: That's why I chewed it for him.",
      "Blossom, Buttercup: Bubbles! ",
      "Blossom: That is so gross! ",
      "Bubbles: Birds do it, and they're not gross.",
      "Buttercup: They eat worms!",
      "Blossom: Okay. Let's think of something that's already soft. How about chili?",
      "Buttercup: P-U!",
      "Bubbles: Ewww! Looks like he already had chili. ",
      "Buttercup: Ugh! What do we do now? ",
      "Bubbles: I guess it's time for you to change him, Blossom. ",
      "Blossom: Me?! Why should I have to do it? ",
      "Buttercup: She's right, sis. As the responsible one, it's your duty. Get it? Your doody? ",
      "Bubbles: Doody!",
      "Blossom: Why don't you do it? You like to stink.",
      "Buttercup: I only like my own stink. Why doesn't Bubbles do it? She knows all about being a baby.",

      "Blossom: Okay, girls. Let's pull ourselves together. We'll do it as a team.",
      "Blossom: This is gonna be easy!",
      "Bubbles, Buttercup: Yeah! Hamster!",
      "Blossom: Ow!  Ow!",
      "Blossom: Ow!... Ow!... Ow!... Ow! ",
      "Bubbles: Gee, Blossom, what happened to 'this is gonna be easy'?  See how cute he is with Octi?",
      "Bubbles: Just look at the cu-EWWW!! Okay, let's play nice now.",
      "Bubbles: Octi! ",
      "Buttercup: Oh, quit being such a baby, Bubbles. We're superheroes. Hey, watch it!",
      "Buttercup: Oh, we gotta get rid of this thing!",
      "Bubbles: Okay.",
      "Blossom: All right, then.",
      "Blossom: Tomorrow we find his mom, and everything will be back to normal. Now let's just get a good night's sleep.",
      "Blossom, Buttercup: Your turn, Bubbles!",
      "Bubbles: You have to admit, he does make cute noises.",
      "Buttercup: What was in that milk?",
      "Bubbles: Nothing... except veggie burger.",
      "Bubbles: Girls! Girls!  The baby's gone!",
      "Blossom: Spread out!",
      "Bubbles: Baby! ",
      "Blossom: Baby! ",
      "Buttercup: Here, baby, baby!  Uh... girls?",
      "Bubbles: Do you think he went outside?",

      "Bubbles: Maybe we should just tell the Professor.",
      "Buttercup: Are you crazy? He won't even let us have a pet, remember?",
      "Bubbles: Do you have a better idea, tough guy?",
      "Blossom: Hey, guys!  There he is!",
      "Buttercup: We should probably keep a better eye on that thing. ",
      "Blossom: And we really need to watch what we feed him.",
      "Bubbles, Buttercup: Uh-huh.",
      "Blossom: My back is killing me.",
      "Buttercup: That crying is what's killing me.",
      "Bubbles: All I can think about is how tired I am. ",
      "Buttercup: Oh, we gotta ditch that thing. It's not our baby!",
      "Blossom: I know. But we can't just leave it in a basket on someone's doorstep.",
      "Buttercup: Why not? They do it on TV.",
      "Bubbles: Well, we're not on TV!",
      "Blossom: She's right. We've got to do the right thing.",
      "Bubbles: I saw some baskets downtown.",
      "Blossom: Where did you see those baskets?",
      "Blossom: Hey! There's that monster from yesterday!",
      "Buttercup: Let's go sock it in the face!",
      "Bubbles: It looks sad.",
      "Monster: My baby! ",
      "Blossom: Nice try, monster, but this baby doesn't look anything like you. See?",
      "Blossom: He melted!",
      "Buttercup: Oh, yes! ",
      "Monster: No, he didn't melt.",
      "Monster: He just molted.",
      "Monster: That form you saw him in was just an ugly larva stage. ",
      "Girls: Ewww! ",
      "Monster: He's Mommy's little terror, hmm? ",
      "Blossom: Yeah, that sounds about right.",
      "Male voice: Hey, watch it! ",
      "Buttercup: She can't do that!  Hey! ",
      "Blossom: Let it go, Buttercup. That baby is punishment enough. ",
      "Narrator: And so once again the diaper is changed-thanks to the Powerpuff Girls! Ooh, hold the chili."
    ]
  },
  {
    "episode": "The Bare Facts",
    "dialog": [
      "Mayor: The city of Townsville... is entirely mine! I love this job!",
      "Mayor: There's just so much to love about being the Mayor! Meeting new people, visiting exotic places, soaring to new heights. And I love my office!",
      "Mayor: I love my phone-  Hello, this is the Mayor. I'd like to order a pizza. Put it on my tab. I love the power!  Ah, my wife. I love my-uh, pen. And I just love the responsibility and the active decision-making that comes with being one man in charge of an entire city!  Uh, Ms. Bellum... what am I supposed to do?",
      "Ms. Bellum: Good morning, Mayor. Well, you can start by signing some very important documents on your desk.",
      "Mayor: Important documents? Where would those be? Important documents... Oh! 'Im-por-tant... nnnnnew... lllllaw.' Hmmm! Wonder what this is all about. Well, it must be important. I'll sign it.",
      "Mayor: Hi, Ms., uh, Bellum, ah-",
      "Ms. Bellum: M... A... Y... O... R.",
      "Mayor: Oh, uh, yes. Thank you, Ms. Bellum. Oh, my!",
      "Mayor: What's all that glass doing on the floor?",
      "Mayor: Oh, it's you... You won't get away with this... Mojo Jo-",
      "Mayor: Oh, my head!  Oh! Where am I? Why can't I see?... Wait! And why can't I move my arms and legs?!",
      "Mojo: Oh, shut up already!",
      "Mayor: Who's that? Is that you, Mommy?",
      "Mojo: No, dummy! It's me, the evil Mojo Jojo! I blindfolded and tied you up in order to keep the whereabouts of my secret lair a secret!",
      "Mayor: Oh! You mean the observatory on the top of the volcano in the middle of Townsville Central Park?",
      "Mojo: Ooh, shut up, I say! I say 'shut up' because I am going to become powerful. But before I can become powerful, I must be taken seriously. And the only way to be taken seriously is to rule the city of Townsville as the Mayor! But in order for me to become Mayor, you cannot be Mayor, and that is why I had to strip you of your-",
      "Blossom: Not-",
      "Buttercup: -so fast-",
      "Bubbles: -Mojo Jojo!",
      "Mojo: Powerpuff Girls! Ooh, take this!",
      "Blossom: Ow!  That's it, Mojo. Now you're gonna get it!",
      "Blossom: Let's get the Mayor!  Are you okay, Mayor?",
      "Buttercup: Yeah, are you okay? ",
      "Mayor: What's so funny?",
      "Blossom: Oh, nothing. Come on! ",
      "Mayor: Oh! Hi, Blossom. Hey, where am I?",
      "Blossom: Back in your office, safe and sound. Are you okay? ",
      "Mayor: A-OK, I think. Why, that was some fight I heard. Thank you for saving my life-although what was so gosh darn funny?  Why were you all laughing?",
      "Blossom: Well... you don't want to hear it. It... it's such a long story.",
      "Bubbles, Buttercup: Yeah, long story.",
      "Mayor: I got time.",
      "Blossom: Well, you see, it goes like this.",
      "Bubbles: We were all at school.",
      "Bubbles: And I was drawing a pretty picture of a red daisy.",
      "Bubbles: But then Blossom came along and said that the red daisy was bi... bi-o-ge... netical... biogenetically impossible!",
      "Bubbles: So then I made it a yellow one, but I really liked the red one. Maybe I should have just made two flowers, one red and one-",
      "Buttercup: Bubbles!",
      "Buttercup: The Mayor doesn't want to hear about your stupid baby stories. He just wants to know the bare facts. Who cares about some dumb old flower anyway? Mayor, I'll tell you what really happened. See-",
      "Blossom: I was at school...",
      "Blossom: brushing up on my conversational Chinese, when all of a sudden, my hotline phone rang. I knew there was trouble, and I had to act fast. I rushed to the phone-",
      "Buttercup: Why is everything always about you? We were there too.",
      "Bubbles: Yeah! And I was drawing a very important picture. Although now I can't remember if it was a yellow flower or a pink flower-hey, Blossom, do you remember what color it-",
      "Blossom: Anyway, like I was saying...",
      "Blossom: I answered the phone-  -oh, and Buttercup and Bubbles were there too, I guess.",
      "Blossom: It was Ms. Bellum on the phone. She informed me that you'd been kidnapped! ",
      "Bubbles: Hey, you mean Mayor-napped, don't you? He's not a little kid, you know.",
      "Buttercup: Yeah, he's no spring chicken.",
      "Bubbles: Yeah, he's no chicken.",
      "Blossom: Shush!  Mr. Mayor, you had written an elaborate note telling Ms. Bellum that you'd gone home to write your election speech.",
      "Mayor: I did? How smart of me!",
      "Blossom: That's not what I mean! See, you didn't actually write the note.",
      "Mayor: But you just said I wrote the note!",
      "Blossom: Ms. Bellum said that you couldn't have possibly written the note because she writes all of your speeches.",
      "Mayor: Me and Bellum wrote the note?",
      "Blossom: NOOOO!!! Neither you nor Ms. Bellum wrote the note!",
      "Mayor: Then who wrote the note? I'm sorry, Blossom, but this is all terribly confusing.",
      "Blossom: I knew that there was only one evil menacing character cunning enough to do this.",
      "Bubbles: Mojo Jojo!",
      "Mayor: Mojo Jojo?",
      "Girls: Yes! Yes!",
      "Mayor: Mojo Jojo wrote my speech?  I'll have to thank him.",
      "Buttercup: AAAAAAHHH!!!! MOJO WROTE THE NOTE!!! MOJO WROTE THE NOTE!!!",
      "Buttercup: We got to the observatory-  -busted in-  -beat up Mojo-  -rescued you-",
      "Buttercup: -and here we are! Can we go home now?",
      "Blossom: Buttercup! There's more to the story than that!",
      "Mayor: Why were you laughing so much? My life was at stake! I don't see what was so funny.",
      "Blossom: Well, I'm trying to get to that, Mayor-  -if Buttercup would just butt out and let me tell the story!",
      "Blossom: We quickly forged out on our mission to defeat Mojo Jojo, in a typical V-pattern formation.",
      "Bubbles: Yeah. We were flying to Mojo Jojo's house. I like flying. Oh, and then there were these really pretty clouds. And there was one that was shaped like a heart, and there was this one that looked like a pretty pony, and there was one that looked like a cloud-",
      "Blossom: As I was saying...",
      "Blossom: I devised a tactical plan based on past scenarios we have encountered. Abiding to my Powerpuff Girls plan book-  -we surrounded the perimeter of the evil Mojo Jojo compound, as outlined in section Ten-A.",
      "Buttercup: WHAT ARE YOU TALKING ABOUT?!",
      "Buttercup: I busted in-SMASH!  And there was Mojo. 'Arrrr,' he said. 'Not so fast,' I said. 'Grrrr,' Mojo said. It was just me and Mojo. 'Ha-ha!' he said. Suddenly he was holding a giant laser. KA-BOOM! He fired!",
      "Bubbles: And there was a very pretty shiny blue color.",
      "Buttercup: It was coming at us. Blossom was helpless. WHOOSH! And SMASH against the wall!",
      "Bubbles: Yeah! Mojo did a very silly thing, he did-  -blowing a hole in his house.",
      "Bubbles: Boy, was he mad. There was steam coming out of his ears.",
      "Bubbles: But I knew that deep down inside he was a sad, poor little monkey.",
      "Blossom: Stop it, stop it, STOP IT! You're not making any sense! The Mayor isn't following your stories at all!",
      "Buttercup: Well, if you would butt out, maybe he would!",
      "Bubbles: Yeah! Butt out! Let me tell the story. I tell it the bestest. Besides, I remember everything like it happened yesterday.",
      "Blossom: IT HAPPENED TODAY! See? This is what I mean!",
      "Buttercup: OH, SHUT UP!!!",
      "Bubbles: You don't even know how to tell a good bedtime story!",
      "Mayor: Girls! Girls! I just want to know why you were all laughing!",
      "Bubbles: Your turn, Blossom. ",
      "Blossom: Mojo surprised me by deviating from his usual textbook maneuver by employing his fighting Robo Mojo. ",
      "Bubbles: Yeah. It was a big machine. Bigger than his laser machine, even.",
      "Bubbles: Even bigger-bigger than any bigger machine! Or even bigger than the biggest machine that's bigger than bigger!",
      "Blossom: Mojo directed his missiles-",
      "Buttercup: -but I was ready. He fired-  It was coming at me, and I jumped. SMASH! Hup!  Ooooh!  And then I flew at him, and SMASH! CRASH!  WHAM! Two-fisted punch! POW! ZAH! High kick! Head smash! Bash, sucker!",
      "Bubbles: Buttercup hurt Mojo's head. And I would have kissed his widdle boo-boo, but then I remembered he was a bad monkey, so I KICKED IN HIS FACE! ",
      "Blossom: All of a sudden, from nowhere, Mojo Jojo deployed these... ninja thingies.",
      "Buttercup: Nunchucks.",
      "Buttercup: And WHOOSH-WHOOSH, WHOOSH, WHOOSH, WHOOSH! He was all kung fu style!  But I was ready.",
      "Blossom: Then we initiated the attack again. I led the team, of course.",
      "Buttercup: But then Blossom got smashed. BASH! Right in the kisser.",
      "Bubbles: And he almost got me. ",
      "Blossom: And then Mojo Jojo turned around and swung a mind-blowing blow!  And he hit Buttercup. As she fell limp, that's when I knew that it was up to me to save the day!",
      "Buttercup: Um...",
      "Buttercup: I wasn't hit that hard.",
      "Bubbles: And what about me, huh?",
      "Blossom: Uh... you drew the pretty picture, remember?",
      "Bubbles: Oh, yeah.",
      "Mayor: But what about all the laughing?",
      "Buttercup: Now I was really mad. Mojo was gonna get it!  SMASH! CRASH! I punched him!",
      "Blossom: And I gave him a good one of my own!",
      "Bubbles: I helped too.",
      "Blossom: Buttercup was beating up Mojo pretty good, according to plan.",
      "Bubbles: Yeah! And there were some guts. Oh. I didn't like the guts, yuck.",
      "Blossom: I took Mojo into custody in order to keep Buttercup from beating him up-",
      "Blossom: -and deposited him in a safe place-",
      "Blossom: -and then saved you and raced back here.",
      "Bubbles: And then we took off your blindfold, and then you asked us, 'Hey, what happened?' And then I told you I was drawing a picture of a pretty flower, and then Blossom said-",
      "Blossom, Buttercup: YOU'RE TELLING THE WHOLE STORY ALL OVER AGAIN!!!",
      "Bubbles: Sorry.",
      "Mayor: Girls! That's all okey-dokey, peachy keen, and dandy, but you never explained what was so gosh darn funny!",
      "Buttercup: Oh, look at the time.",
      "Blossom: Yeah, we got to go.",
      "Bubbles: See you, Mayor.",
      "Girls: Bye! ",
      "Mayor: Wait! Why were you laughing?",
      "Mayor: Why were you girls laughing?",
      "Narrator: Oh, Mayor, looks like Mojo stripped you of even more than your power.",
      "Narrator: But the girls couldn't bear to tell you the naked truth. Ha, ha, ha, ha! So once again, the day is saved, thanks to... the Powerpuff Girls. Mayor, you cheeky devil."
    ]
  },
  {
    "episode": "The Boys are Back in Town",
    "dialog": [
      "Narrator: The city of Townsville!",
      "Narrator: Where boys will be boys.",
      "Narrator: And girls will be girls!",
      "Narrator: Besides manhandling the common criminal...",
      "Narrator: in just one day, three particular girls have managed to...",
      "Narrator: massacreMojo!",
      "Narrator: Pummel Princess!",
      "Narrator: Grapple with the Gangreen Gang!",
      "Old woman: Yahoo! Go, Powerpuff Girls!Whoo!",
      "Narrator: And infuriate Fuzzy!",
      "Narrator: And in their day, these girls have even managed to humble... 'Him.'",
      "Buttercup: Yeah, it was rough in the beginning, but I paced myself and just wore the monster down.",
      "Blossom: We were just glad to be of service.Good job, girls!",
      "'Him': 'We were just glad to be of service. Good job, girls!'Blah!",
      "'Him': Blast the Powerpuff brats! They disgust me! So effortless.They seem to be unbeatable.",
      "'Him': All the years and all the villains have produced nothing.So much time, such little results.",
      "'Him': There must be a way. There must be someone who can knock those brats down to size!",
      "'Him': Oh, boy.",
      "'Him': Oh, boy.",
      "Blossom: Good job, girls! ",
      "Buttercup: What now?",
      "Blossom: Get ready for anything, girls.",
      "Blossom: TheRowdyruffBoys?!",
      "Buttercup: But that's impossible!",
      "Bubbles: We blew you guys up! ",
      "Brick: Yeah? Well you can't stop a good thing, babe!",
      "Brick: Stop laughing! What are you laughing at?",
      "Blossom: Oh, no, lookwho'sback with mean hair!",
      "Bubbles: Oh, whatever shall we do?",
      "Buttercup: Howcan we defeat their scary new hairdos?",
      "Brick: SILENCE! You stupid wimpy lame-o girls talk too much!",
      "Blossom: Stupid?!",
      "Buttercup: Wimpy?!",
      "Bubbles: Lame-o?!",
      "Brick: You girls just got lucky last time. This time there's no way you'regonnabeatmy boys!",
      "Butch: Butch!",
      "Boomer: Boomer!",
      "Brick: And me, Brick!",

      "Brick: Pay attention! ",
      "Bubbles: Are you guys sure you're ready for another beating?",
      "Boomer: You girls aregonnaeat your words, spit 'emout, and eat 'emagain! ",
      "Blossom: That doesn't even make sense.",
      "Boomer: I know you are, but what am I?",
      "Buttercup: Enough! Talk is cheap. Let's do this!",
      "Butch: Thisisgonnabe fun!",
      "Blossom: Come on, girls. We have to work together. We're too evenly matched one on one.",
      "Buttercup: Yeah! A little teamworkoughtawhupthose dorks into shape!",
      "Brick: Come on, guys! We can't let a bunch of dumb girls show us up!",
      "Blossom: All right, girls. I think we know what we have to do. Let's give 'emsome sugar!",
      "Bubbles: Ooh, ooh! I want the blond! I think he's cute!",
      "Buttercup: Man, you're weird.",
      "Blossom: Let's go, girls!",
      "Brick: Here it comes, boys!",
      "Bubbles: I don't understand. How come nothing is happening? Weren't they supposed to explode?",
      "Blossom: Well, let'sreallylay it on 'em!",
      "Brick: Your cootie kisses only make us bigger!",
      "Boomer: Stronger!",
      "Butch: Andtougher!",
      "Brick: Youstupid lame-o girls never learn. Now it's time to put these babies to bed!",
      "'Him': Hello, girls. ",
      "Girls: 'Him'!",
      "'Him': Sogood to see you again.How's things?  Not so good? Having a little boy trouble, hmm? Or should I say... bigboy trouble?",
      "'Him': Hello, boys. You're doing just fine. So, how does it feel, girls, to know defeat is just around the corner-  -and victory for me is at hand?",
      "Blossom: So you're behind this, 'Him'! What did you do to make our kisses powerless?",
      "'Him': Oh, that. That's my little secret. You see, I realized that the boys' only weakness-  -was your pathetic little kisses. And since I knew you would resort to that, I added a little something extra-a cootie vaccination. Circle-circle-dot-dot, now you have a cootie shot!  I got the spell off the Internet.",
      "'Him': But your kisses are nottotallyuseless, girls. They make my boys bigger and more powerful!",
      "'Him': At last, I win!",
      "'Him': Have fun, girls. Ta-ta! Ha-ha!",
      "Blossom: Stand your ground, girls! They're trying to psych us out by grossing us out!",
      "Blossom: Whew!",
      "Boomer: Mmm-mmm-mmm!",
      "Buttercup: Hold your ground, Bubbles!  It's just a bunch of dumb boy tricks, but we can take it.Right?",
      "Buttercup: Go ahead, gross us out all you want-  -but we're stillgonnakick your big-boy butts!",
      "Brick: Oh, you are, are you? Well, then, I guess it's...",
      "Brick: RUMBLE TIME!",
      "Butch: Rumble time! Rumble time!",
      "Brick: Let the rumble begin!",
      "Blossom: Let's go, ladies!",
      "Blossom: Quick! Get up! Get up!",
      "Boomer: But I thought we was-",
      "Brick: Shutit! We're playing a new game now, and the game is...",
      "Brick: ROLLERBRAWL!",
      "Butch: Roller Brawl! Roller Brawl! Goody, goody, goody!",
      "Brick: Let the brawl begin!",
      "Butch: And he's going for the-",
      "Boomer: And he's going for the... slap shot!",
      "Boomer: SCORE! Whoo-hoo-hoo! Yeah!",
      "Buttercup: That's it! The puck stops here!",
      "Buttercup: What gives?",
      "Blossom: Wegottahide.",
      "Buttercup: Hide? Are you- ",
      "Bubbles: Shhh! They'll hear you!",
      "Buttercup: Okay, we're hiding. Now what?",
      "Bubbles: Yeah. Those boys are beating our butts!",
      "Blossom: I don't know. I think we've... ",
      "Buttercup: Don't say it!",
      "Blossom: met our match.",
      "Buttercup: That's what they want us to think!We can still whip those big dummies. I mean, come on!  They're too stupid to even find us up here!",
      "Brick: You calling us stupid?!?",
      "Boomer: We'll show you stupid!",
      "Brick: You'rein for it now, losers, 'cause it's time for...... theawesomestgame! ULTIMATE FIGHT!",
      "Butch: Ultimate Fight! Ultimate Fight!",
      "Brick: Welcome, fans, to the first annual...",
      "Brick: ULTIMATE FIGHT! In this corner... the Baron of Berserk... Butch!",
      "Brick: And in that corner... the Dumber than the Dumbest... Boomer!",
      "Boomer: Yes! Yes! Yes! Yes! Yes! Yes!",
      "Brick: And here in the center... the Master Masher... the King of Crushing... the Duke of Destruction... the reigning worldchampeen...",
      "Brick: Brick the Bludgeoner!And now... let the bludgeoning begin!",
      "Brick: Oh, no! It looks like the dreaded...... Do-Si-Do of Destruction!",
      "Brick: And next... it's the Saratoga Speed Bag!",
      "Blossom: No!  No!Nooo!No! No!",
      "Brick: Oh. Sorry, dude.",
      "Butch: Dude, check it out. Check it out! ",
      "Brick: Cool!",
      "Butch: I... I bit my tongue!",
      "Blossom: Did you see that? Whenever their masculinity is threatened, they shrink in size.",
      "Blossom: Okay. So all we have to do is... ",
      "Bubbles: Sorry! ",
      "Painter: Hey!",
      "Bubbles: It's working! It's working!",
      "Blossom: Come on, girls. Let's shrink 'emdown to size!",
      "Buttercup: Aww, who's almostwikeawittleman?",
      "Bubbles: Aww, don'tcwy,wittlebaby. Mommy's here.",
      "Blossom: Oh, no. Who'saitty bitty, teeny tiny, dinkywittlecutie pie?",
      "Brick: Stop crying, you sissies! ",
      "Blossom: Aww, aren't they cute?",
      "Bubbles: They look like tiny little dollies.",
      "Buttercup: Yeah. Let's squish 'em!",
      "'Him': Can'tyou little brats do anything right?! I send you to destroy them, and what do you do?  You get all sissified!",
      "'Him': Oh, don't look so smug, girls. Though you may have won this time -it was a lucky victory and you know it- in time, youwillfall, and wewill defeat you! So keep on your toes, stay alert and watch your back. Because the boys are back in town!",
      "Blossom: Oh, boy.",
      "Narrator: 'Oh, boy' is right. It seems the battle of the sexes has begun!",
      "Narrator: Let's just hope that the day is saved-thanks to the Powerpuff Girls!"
    ]
  },
  {
    "episode": "The Boys Are Back in Town",
    "dialog": [
      "Narrator: The city of Townsville!",
      "Narrator: Where boys will be boys.",
      "Narrator: And girls will be girls!",
      "Narrator: Besides manhandling the common criminal...",
      "Narrator: in just one day, three particular girls have managed to...",
      "Narrator: massacreMojo!",
      "Narrator: Pummel Princess!",
      "Narrator: Grapple with the Gangreen Gang!",
      "Old Woman: Yahoo! Go, Powerpuff Girls!Whoo!",
      "Narrator: And infuriate Fuzzy!",
      "Narrator: And in their day, these girls have even managed to humble... 'Him.'",
      "Buttercup: Yeah, it was rough in the beginning, but I paced myself and just wore the monster down.",
      "Blossom: We were just glad to be of service.Good job, girls!",
      "'Him': 'We were just glad to be of service. Good job, girls!'Blah!",
      "'Him': Blast the Powerpuff brats! They disgust me! So effortless.They seem to be unbeatable.",
      "'Him': All the years and all the villains have produced nothing.So much time, such little results.",
      "'Him': There must be a way. There must be someone who can knock those brats down to size!",
      "'Him': Oh, boy.",
      "'Him': Oh, boy.",
      "Blossom: Good job, girls! ",
      "Buttercup: What now?",
      "Blossom: Get ready for anything, girls.",
      "Blossom: TheRowdyruffBoys?!",
      "Buttercup: But that's impossible!",
      "Bubbles: We blew you guys up! ",
      "Brick: Yeah? Well, you can't stop a good thing, babe!",
      "Brick: Stop laughing! What are you laughing at?",
      "Blossom: Oh, no, lookwho'sback with mean hair!",
      "Bubbles: Oh, whatever shall we do?",
      "Buttercup: Howcan we defeat their scary new hairdos?",
      "Brick: SILENCE! You stupid wimpy lame-o girls talk too much!",
      "Blossom: Stupid?!",
      "Buttercup: Wimpy?!",
      "Bubbles: Lame-o?!",
      "Brick: You girls just got lucky last time. This time there's no way you'regonnabeatmy boys!",
      "Butch: Butch!",
      "Boomer: Boomer!",
      "Brick: And me, Brick!",

      "Brick: Pay attention! ",
      "Bubbles: Are you guys sure you're ready for another beating?",
      "Boomer: You girls aregonnaeat your words, spit 'emout, and eat 'emagain! ",
      "Blossom: That doesn't even make sense.",
      "Boomer: I know you are, but what am I?",
      "Buttercup: Enough! Talk is cheap. Let's do this!",
      "Butch: Thisisgonnabe fun!",
      "Blossom: Come on, girls. We have to work together. We're too evenly matched one on one.",
      "Buttercup: Yeah! A little teamworkoughtawhupthose dorks into shape!",
      "Brick: Come on, guys! We can't let a bunch of dumb girls show us up!",
      "Blossom: All right, girls. I think we know what we have to do. Let's give 'emsome sugar!",
      "Bubbles: Ooh, ooh! I want the blond! I think he's cute!",
      "Buttercup: Man, you're weird.",
      "Blossom: Let's go, girls!",
      "Brick: Here it comes, boys!",
      "Bubbles: I don't understand. How come nothing is happening? Weren't they supposed to explode?",
      "Blossom: Well, let'sreallylay it on 'em!",
      "Brick: Your cootie kisses only make us bigger!",
      "Boomer: Stronger!",
      "Butch: Andtougher!",
      "Brick: Youstupid lame-o girls never learn. Now it's time to put these babies to bed!",
      "'Him': Hello, girls. ",
      "Girls: 'Him'!",
      "'Him': Sogood to see you again.How's things?  Not so good? Having a little boy trouble, hmm? Or should I say... bigboy trouble?",
      "'Him': Hello, boys. You're doing just fine. So, how does it feel, girls, to know defeat is just around the corner-  -and victory for me is at hand?",
      "Blossom: So you're behind this, 'Him'! What did you do to make our kisses powerless?",
      "'Him': Oh, that. That's my little secret. You see, I realized that the boys' only weakness-  -was your pathetic little kisses. And since I knew you would resort to that, I added a little something extra-a cootie vaccination. Circle-circle-dot-dot, now you have a cootie shot!  I got the spell off the Internet.",
      "'Him': But your kisses are nottotallyuseless, girls. They make my boys bigger and more powerful!",
      "'Him': At last, I win!",
      "'Him': Have fun, girls. Ta-ta! Ha-ha!",
      "Blossom: Stand your ground, girls! They're trying to psych us out by grossing us out!",
      "Blossom: Whew!",
      "Boomer: Mmm-mmm-mmm!",
      "Buttercup: Hold your ground, Bubbles!  It's just a bunch of dumb boy tricks, but we can take it.Right?",
      "Buttercup: Go ahead, gross us out all you want-  -but we're stillgonnakick your big-boy butts!",
      "Brick: Oh, you are, are you? Well, then, I guess it's...",
      "Brick: RUMBLE TIME!",
      "Butch: Rumble time! Rumble time!",
      "Brick: Let the rumble begin!",
      "Blossom: Let's go, ladies!",
      "Blossom: Quick! Get up! Get up!",
      "Boomer: But I thought we was-",
      "Brick: Shutit! We're playing a new game now, and the game is...",
      "Brick: ROLLERBRAWL!",
      "Butch: Roller Brawl! Roller Brawl!",
      "Brick: Let the brawl begin!",
      "Butch: And he's going for the-",
      "Boomer: And he's going for the... slap shot!",
      "Boomer: SCORE! Whoo-hoo-hoo! Yeah!",
      "Buttercup: That's it! The puck stops here!",
      "Buttercup: What gives?",
      "Blossom: Wegottahide.",
      "Buttercup: Hide? Are you- ",
      "Bubbles: Shhh! They'll hear you!",
      "Buttercup: Okay, we're hiding. Now what?",
      "Bubbles: Yeah. Those boys are beating our butts!",
      "Blossom: I don't know. I think we've... ",
      "Buttercup: Don't say it!",
      "Blossom: met our match.",
      "Buttercup: That's what they want us to think!We can still whip those big dummies. I mean, come on!  They're too stupid to even find us up here!",
      "Brick: You calling us stupid?!?",
      "Boomer: We'll show you stupid!",
      "Brick: You'rein for it now, losers, 'cause it's time for...... theawesomestgame! ULTIMATE FIGHT!",
      "Butch: Ultimate Fight! Ultimate Fight!",
      "Brick: Welcome, fans, to the first annual...",
      "Brick: ULTIMATE FIGHT! In this corner... the Baron of Berserk... Butch!",
      "Brick: And in that corner... the Dumber than the Dumbest... Boomer!",
      "Boomer: Yes! Yes! Yes! Yes! Yes! Yes!",
      "Brick: And here in the center... the Master Masher... the King of Crushing... the Duke of Destruction... the reigning worldchampion...",
      "Brick: Brick the Bludgeoner!And now... let the bludgeoning begin!",
      "Brick: Oh, no! It looks like the dreaded...... Do-Si-Do of Destruction!",
      "Brick: And next... it's the Saratoga Speed Bag!",
      "Blossom: No!  No!Nooo!No! No!",
      "Brick: Oh. Sorry, dude.",
      "Butch: Dude, check it out. Check it out! ",
      "Brick: Cool!",
      "Butch: I... I bit my tongue!",
      "Blossom: Did you see that? Whenever their masculinity is threatened, they shrink in size.",
      "Blossom: Okay. So all we have to do is... ",
      "Bubbles: Sorry! ",
      "Painter: Hey!",
      "Bubbles: It's working! It's working!",
      "Blossom: Come on, girls. Let's shrink 'emdown to size!",
      "Buttercup: Aww, who's almostwikeawittleman?",
      "Bubbles: Aww, don'tcwy,wittlebaby. Mommy's here.",
      "Blossom: Oh, no. Who'saitty bitty, teeny tiny, dinkywittlecutie pie?",
      "Buttercup: Aaaww, poor wittwe doo-boo!",
      "Bubbles: Aww hello little doopy dewbilee!",
      "Blossom: Aaaw, the baby poo-poo baby boo-boo ga-ga!",
      "Brick: Stop crying, you sissies! ",
      "Blossom: Aww, aren't they cute?",
      "Bubbles: They look like tiny little dollies.",
      "Buttercup: Yeah. Let's squish 'em!",
      "'Him': Can'tyou little brats do anything right?! I send you to destroy them, and what do you do?  You get all sissified!",
      "'Him': Oh, don't look so smug, girls. Though you may have won this time-  -it was a lucky victory and you know it. In time, youwillfall-and wewill defeat you! So keep on your toes, stay alert-  -and watch your back. Because the boys are back in town!",
      "Blossom: Oh, boy.",
      "Narrator: 'Oh, boy' is right. It seems the battle of the sexes has begun.",
      "Narrator: Let's just hope that the day is saved thanks to the Powerpuff Girls."
    ]
  },
  {
    "episode": "The Mane Event",
    "dialog": [
      "Narrator: The city of Townsville... where at this very moment, our girls are tangled in another hair-raising situation! ",
      "Bubbles: Oh, Blossom, your hair issooooo beautiful. ",
      "Buttercup: Yeah. All you need are a couple of barrettes-  -and some of this for hold. ",
      "Buttercup: And there you have it. A racetrack with hairpin turns! ",
      "Bubbles: That's stupid! ",
      "Buttercup: Oh- ",
      "Buttercup: -but Fluffy the Hair Bunny is cool?  ",
      "Bubbles: Yes. Blossom loves Fluffy. Don't you, Blossom? ",
      "Blossom: CUT IT OUT!",
      "Blossom: And give me arealhairdo. ",
      "Bubbles: Sure, sure. Just gotta comb out a few tangles. ",
      "Buttercup: And get rid of a... couple of... knots! ",
      "Bubbles, Buttercup: Oh! ",
      "Blossom: What's going on back there?  ",
      "Buttercup: Oh-nothing. ",
      "Bubbles: Uh-just gotta trim a few split ends. ",
      "Blossom: I got it! ",
      "Blossom: Yes, Mayor?... Whoa. No way!... Right. We're on it! ",
      "Blossom: Girls! Trouble! Move out! ",
      "Blossom: What? ",
      "Blossom: Whatever. Sometimes you guys are so weird. Come on!  ",
      "Narrator: Go, girls! Go!  ",
      "Pilot 1: Roger, Bravo Delta, this is Sitting Duck. I have bogey clean in my sights, and I'm, uh, gonna shoot bullets at it now. ",
      "Pilot 2: Did you get him? ",
      "Woman: I can't believe it! ",
      "Man 1: I think this is the end! ",
      "Man 2: Ay-ay-ay! ",

      "Blossom: I'm gonna teach you a lesson-  -Mr. Evil Eye! So, you think you can just roll into town and start vaporizing everything in sight?! Well, look here, buddy, you can't! ",

      "Blossom: This is a happy and peaceful place- ",
      "Blossom: -and folks here don't take kindly to this type of behavior. Now-  -I'm gonna give you a chance to stop this senseless destruction, once and for all. ",
      "Blossom: So, champ-  -what's it gonna be? ",
      "Blossom: What? ",
      "Blossom: What? ",
      "Blossom: What's so funny? ",
      "Bubbles, Buttercup: You! ",
      "Blossom: Me? But what's so funny about- ",
      "Bubbles: Blossom, wait! It's not that bad!  ",
      "Buttercup: Bubbles... this isn't working. We need to- ",
      "Bubbles: Try a sneak attack? ",
      "Buttercup: Bingo! ",
      "Whitfield: This has been the scene all afternoon. ",
      "Whitfield: It seems the monster's ability to see everything at all times has virtually eliminated any chance of attack by the Powerpuff Girls.At this time, all we can do is wait for our tragic, inevitable doom. ",
      "Blossom: Oh... ",
      "Whitfield: But as we do, let's remember the things that brought us joy, like... Blossom's haircut!  What's the matter, Blossom? Did you get in a fight with a pair of scissors and lose?  ",
      "Whitfield: Boy, did she look stupid. ",
      "Professor: Blossom? ",
      "Blossom: Go away! ",
      "Professor: What's the matter, honey?  Why are you sitting here alone in the dark?  Are you okay? ",
      "Blossom: I'm fine! ",
      "Professor: You don't sound fine to me. Now come out from under there and show me a smile. ",
      "Blossom: No! ",
      "Professor: Aw, come on, Blossom. I bet it can't bethatbad. ",
      "Professor: Whoa!  I mean, uh... oh! You've... cut your hair? ",
      "Blossom: No, Bubbles and Buttercup butchered it. And they and Townsville and even the monster all laughed at me. I'm never going outside again. ",
      "Professor: But, Blossom, your sisters need your help. ",
      "Blossom: But everyone'll laugh at me. ",
      "Professor: And that's a bad thing? Blossom, you need to turn this hair-don't-  -into a hair-do. Understand? ",
      "Blossom: Yes!  Thank you! ",
      "Buttercup: It's no use! We can't hide! ",
      "Bubbles: Oh, no! Look! ",
      "Narrator: Oh, myopia! It looks like this is it for our girls! Oh, I can't bear to watch! ",
      "Blossom: Hey, four-hundred-eyes! ",
      "Blossom: What do you think? Toupe or not toupe?  All these dreaded locks. I can't do anything with 'em!  So, I went to the doctor to get some medicine. He said, 'What's the problem?' And I said, 'Doc, I have this terrible coif!' ",
      "Bubbles: Buttercup! Look! ",
      "Blossom: Okay, okay, I know. My hair looks stupid. ",
      "Buttercup: No, Blossom. We're laughing 'cause we're happy. ",
      "Bubbles: Yeah. We thought we were goners! ",
      "Buttercup: But we're all really sorry we laughed at you. ",
      "Bubbles: Yeah. ",
      "Blossom: Really?  But still, I do look really stupid! ",
      "Buttercup: I'll say!  Stupid...",
      "Bubbles: So we're even? ",
      "Blossom: Yeah. We're even. ",
      "Narrator: Who says justice is blind? ",
      "Narrator: So once again the day is shaved- ",
      "Narrator: -thanks to the Powerpuff Girls!"
    ]
  },
  {
    "episode": "The Powerpuff Girls Rule!!!",
    "dialog": [
      "Narrator: The city of Townsville!  Ahh, what a nice, calm, beautiful, and peaceful da-aw, man!",
      "Narrator: Figures! It's Mojo Jojo, the big dumb ruiner of everything!",
      "Mojo: Go, Mobile Jojo! Go!",
      "Man: BOOOOO!",
      "Blossom: 'Kay, girls. Chimpy's out of his cage again. Giggles, flank right. Sourpuss, left. It's bedtime for Bonzo!",
      "Bubbles: Ahh, Mojo, Mojo, Mojo. What are you doing?  Are oo twying to take over the world again? ",
      "Mojo: Yes, I'm twying to take over the world again. And I'm gonna do it, too!",
      "Computer: Hull breach. Hull breach.",
      "Buttercup: Sure you are, with your big dumb smelly robot!",
      "Mojo: It's not a big dumb smelly robot! It's a big awesome robot that does cool stuff!  Like this!",
      "Blossom: Look, we go through this every day. You're all-  -'I, Mojo Jojo, with my blah-blah-blah-blah-blah, shall-'  '-rule the world!'  'I will be the one in control!'  'Total global power shall be my responsibility!'  'I- '",
      "Mojo: I do not repeat myself like that! I am clear, concise, and to the point!  Reiterating is not my thing!  I-",
      "Blossom: And every time, Bubbles, Buttercup, and I stop you.",
      "Blossom: When are you gonna learn that you're never, never, never gonna take over the world? Because no matter what you do, all your little plans-  -are gonna keep blowing up in your fa- ",
      "Mojo: I'm not a fool. I know I could rule this whole wide world What I would do To control you forevermore. Ruined, my plan! They don't understand,Those stinkin' Powerpuff Girls! Bright young Chimpy Who's not a wimpy, ready to stand.",
      "Mojo: I wanna control all the people nowGive 'em my orders and get some actionBe super-awesome and declareThat I-what's the word?RULE! I got a plan, An awesome plan, To control all of man!I'd be so coolWish I could rule",
      "Mojo: All of the world.",
      "Prisoner: Beautiful.",
      "Narrator: Ahh. Now, with Mojo behind bars, our little crime-fighters finally get to take a break, relax, and take her easy for a while.",
      "Narrator: Gosh-darn it!",
      "Professor: Girls, what is it? Too much salsa on the eggs?  Bad dad! Bad dad! Bad dad!",
      "Blossom: No, Professor. It's not that, it's this!",
      "Professor: 'Key to the World Arrives in Townsville Today!'  Oh, how nice.",
      "Bubbles: It's not nice! It's terrible!  Keep reading!",
      "Professor: 'Keys. They open our cars, our homes, our hearts. But one k-'",
      "Buttercup: No, no, no, read... this!",
      "Professor: The Key to the World travels the globe, spending one day in each city. It may seem just like an empty symbol of goodwill and brotherhood, but in actuality, the law clearly states that whoever possesses the Key to the World...'  '... actually does rule the world'?!?",
      "Professor: Well, that's just dumb. ",
      "Blossom: I know! We always knew about the Key, but we never thought anyone would be dumb enough to send it here! I mean, Townsville is practically Villain City, USA!",
      "Professor: Girls, girls, girls, don't worry. I'm sure the Mayor's taken the proper measures to make sure the Key is safe. ",
      "Blossom: Ah, you're right, Professor.",
      "Buttercup: It's all cool.",
      "Bubbles: We were all-  'Aah! The Key! The Key!'  So dumb.",
      "Blossom: Yes, Mayor?",
      "Mayor: I lost it! I lost the Key!",
      "Narrator: All of the villains and all of the bratty ones and all the fuzzy ones and all the icky ones and all the sticky ones and all the scary ones and all the villains are-",
      "Mojo: One of us is not here!",
      "Mojo: Go, monkey, go!  Mojo Jojo!",
      "Narrator: Go, girls! Go!",
      "Fuzzy: Fuzzy went a-shootin' to find the Key,",
      "Princess: I want that Key and I want it now! So do what my daddy pays you to do and tear it all down!",
      "Mojo: Mojo went shooting- ",
      "Fuzzy: -to find the Key!",
      "Mojo: Look at all these keys!",
      "Princess: No... no... no... no... no... no... no... no!",
      "Blossom: Whoops, sorry.",
      "Buttercup: A little help, please?",
      "Mojo: Key, Key, Key... is that the Key?... is that the Key?  Excuse me... pardon me... coming through!",
      "Mojo: Any... of you... seen... a... Key?",
      "Bubbles: What?!?  Oopsie.",
      "Group 1: WHATEVER!",
      "Buttercup: I'm on it!",
      "Group 1: OH, GREAT!  NICE!",
      "Blossom: Awesome!",
      "Group 2: REAL NICE!",
      "Buttercup: Everyone okay?",
      "Buttercup: Great! See, girls? At least someone isn't messing up around here!",
      "Ace: Key to the World, Ma! Key to the World!",
      "Blossom: Uh-",
      "Buttercup: Yeah, yeah!",
      "'Him': Ooh, it pays to have a magnetic personality.",
      "Mojo: Yes, yes, yes! Finally the Key to the World is mi-",
      "Mayor: Girls!",
      "Mayor: Girls! Girls!  I found it!",
      "Mayor: My precious porcelain poodle!",
      "Mayor: I thought I lost this puppy.",
      "Ms. Bellum: Don't ask.",
      "Ms. Bellum: Oh, he's picked up another scent!",
      "Ms. Bellum: Good boy! But... Key. Find the Key, not...",
      "Ms. Bellum: my bonus checks. Key.",
      "Ms. Bellum: Okay, wait for me... no, no, do not pee on that!",
      "Blossom: Okay... okay, okay. I can figure this out. I'm smart. Come on, think! Think!  Girls! Girls, what do we know? ",
      "Buttercup: This stinks! ",
      "Blossom: Right. What else? ",
      "Bubbles: We stink! ",
      "Blossom: Exactly! This situation is hopeless, and we totally can't handle it. So if we can't beat 'em, then we gotta... join 'em!",
      "Blossom: We gotta find that Key.",
      "Narrator: And so, in a fast time-saving action sequence, the girls use their super speed to scour every nook and cranny of Townsville, trying to find that Key. But, once they reach the outskirts of Townsville Forest, all hope seems lost, as well as the Key.",
      "Buttercup: We... looked... everywhere! ",
      "Blossom: Every... last... logical place... it would make... sense... to lose a key!",
      "Bubbles: Girls! Sense? Sense? Sense?",
      "Why are we talking about sense?",
      "Bubbles: This is the Mayor we're talking about!",
      "Blossom, Buttercup: Uh-huh. ",
      "Bubbles: He doesn't make any sense!",
      "Blossom, Buttercup: Uh-huh. ",
      "Bubbles: He's a dope!",
      "Blossom, Buttercup: Uh-huh. ",
      "Bubbles: He's the dopiest person we know! ",
      "Blossom, Buttercup: Uh-huh. ",
      "Bubbles: What's the dopiest place the big dope would lose the dopey Key?",
      "Blossom: Right in his desk drawer!",
      "Buttercup: Right under his nose!",
      "Blossom, Buttercup: THAT MAKES NO SENSE!!",
      "Mojo: Makes sense to me.",
      "Mojo: Now if you'll excuse me... I have a world to take over!",
      "Buttercup: How did we not notice a tank following us?!?",
      "Blossom: Who cares? We can stop him!  Come on, girl-",
      "Bubbles: How did we not-",
      "Blossom: Come on, gir-",
      "Blossom: How did we-",
      "Professor: Call it father's intuition, but the important thing right now is that you beat those villains from getting to the Key first.",
      "Professor: I made it!",
      "Bubbles: Wow, Professor, that's a really pretty dune buggy.",
      "Blossom: But if it's all the same to you...",
      "Buttercup: we're just gonna, you know, like, fly.",
      "Professor: Oh, okay, I guess. It's just that I made it special for you and all, but if you want to fly, that's fine.",
      "Professor: WHOO-HOO!!",
      "Mojo: What the-",
      "Mojo: Cur-",
      "Mojo: -ses! ",
      "Professor: Yee-ha! Whoo-hoo-hoo! Neener-neener-neener!",
      "Professor: Yoo-hoo!",
      "Blossom: If you don't behave, I'm gonna turn this car around!",
      "Professor: Ooh, ooh! Push that button, push that button!",
      "Blossom: What? Why? ",
      "Professor: 'Cause it's awesome!",
      "Mojo: CUUUUUUUUURRRRRRSSESSSSSSSSS!!!!!!",
      "Mojo: Curses, curses, curses, curses, curses!!!! ",
      "Computer: Thank you for activating the self-destruct system. Total annihilation in ten... nine... eight...",
      "Mojo: Great. Just gr-",
      "Computer: seven... six... five... four... three... two... one...",
      "Professor: Whoo-hoo! Go, girls, go! We're in the lead! We're gonna wi-",
      "Professor: Oh, all ri-",
      "Mojo: CUR-",
      "Mojo: No. You know what? That's it. I'm done.",
      "Mojo: I quit. I give up. I tried, I really tried. For years and years I've been trying to take over the world- but I guess the universe doesn't want me to have it. So I'm out. I'm gone. Forget it. The only sad thing is, the world would have ruled if I was in charge. But now-",
      "Buttercup: Hah! ",
      "Mojo: -but do you know what? You'll never know. You'll never know. And so, my sweets, I, Jojo, am Mojo no mo'. And so, I go-go.",
      "Blossom: Key to the World, Key to the World!",
      "Buttercup: We got it, we got it!",
      "Bubbles: Whoop-whoop!",
      "Girls: YEAH!! ",
      "Blossom: Phew. What a crazy day. Well, at least the Key is safe in our hands. ",
      "Bubbles: Yeah. If any of our villains got ahold of this, they would be in charge. ",
      "Buttercup: Yeah, like this! 'I, Buttercup, rule the world! Everyone has to do what I say! Now drop and give me twenty!'",
      "Bubbles: Sir, yes, sir!",
      "Blossom: Wait a minute. Bubbles, stop.",
      "Bubbles: Sir, yes, sir!  What? She's in charge now.",
      "Blossom: Exactly. Girls, listen. We spend all our time fighting to make the world a better place. But with this Key-  -we don't need to fight anymore. 'Cause with it, we actually do rule the world.",
      "Bubbles, Buttercup: Whoa... ",
      "Blossom: My first order of business will be to...",
      "Blossom: fashion the perfect society, based on the social structure of the mighty African elephant, where the wisest and most experienced female leads an impartial and fair democracy of her fellow sisters!",
      "Blossom: And all those dumb smelly boys have to do all the cooking and cleaning!",
      "Buttercup: Nooo...",
      "Buttercup: It's much easier than that!  There's only one way to rule the world!",
      "Buttercup: Just tell everybody exactly what to do and when to do it! And if any of 'em got a problem with it, they can take it up with Punchy McGee and Fisty O'Flanagan!",
      "Bubbles: You guys are so totally dumb. That's not how you get world peace. You know how you get world peace?",
      "Bubbles: FREE PUPPIES FOR EVERYONE!!",
      "Blossom, Buttercup: No! ",
      "Blossom: Just let me handle it. I mean, I already am the leader. ",
      "Buttercup: You talk too much! It's time for action! ",
      "Bubbles: Hel-lo? Happiness is a warm puppy!",
      "Villains: I'll take the Key to the World! ",
      "Girls: No, it's mine!",
      "Jojo: Welcome to your life",
      "There's no turning back",
      "Even while we sleep",
      "We will find you",
      "Acting on your best behavior",
      "Turn your back on Mother Nature",
      "Everybody wants to rule the world.",
      "Jojo: It's my own design",
      "It's my own remorse",
      "Help me to decide",
      "Help me make the",
      "Most of freedom and of pleasure",
      "Nothing ever lasts forever",
      "Everybody wants to rule the world.",
      "Girls: Professor, tell them I should rule the world! ",
      "Blossom: Professor, tell them to give it! I'm the leader, I'm the only one qualified to rule the world!",
      "Buttercup: Who's the strongest? Who's the toughest? Who's the coolest? Who should rule? ME! ME! ME!",
      "Bubbles: PUPPIES PUPPIES PUPPIES PUPPIES!! All I gotta say is, PUPPIES!!!",
      "Girls: Oh.",
      "Girls: Ohh. Ohh.",
      "Girls: Ohh. Ohh.",
      "Girls: Ohh. Ohh.",
      "Girls: Ohh!  Ohh! ",
      "Talking Dog: I have nothing to say. ",
      "Girls: Mayor?",
      "Blossom: What... what can we say?",
      "Buttercup: We have no idea what got into us.",
      "Bubbles: Free puppies is not the answer.",
      "Blossom: There's only one thing that can right this wrong.",
      "Girls: We are so sorry. ",
      "Mayor: Oh, girls, that's okay. The important thing is that today you learned a very valuable lesson. WITH GREAT POWER... comes great responsibility.",
      "Jojo: Can I see that?",
      "Mayor: Oh, yeah, sure.",
      "Mojo: Yes! Yes, yes, yes, YES!!  Finally, I, Mojo Jojo, RULE THE WORLD!!  For years I have dreamed of changing things to the way I want them to be!",
      "Mojo: My ideas for right and wrong shall be law! I will make the decisions! I will control! I will dictate! I am the decider!",
      "Mojo: After today... the world will never be the same again!",
      "Mojo: And now... with the Key in my hand... no one can stop me!",
      "Mojo: I've dreamed of this moment. I've sung about this moment!",
      "Mojo: And now it's here!  It's really...",
      "Mojo: Okay! Now it's here!",
      "Mojo: We're good to go!  And with one push of a button...",
      "Mojo: I, Mojo Jojo, with the aid of my Global Jojo machine...",
      "Mojo: will unleash a power that will change the world forever! First I will...",
      "Mojo: end world hunger.",
      "Mojo: Stop global warming.",
      "Mojo: Save the whales.",
      "Mojo: Cure all disease.",
      "Mojo: End all war.",
      "Mojo: And finally...",
      "Mojo: FREE PUPPIES FOR EVERYONE!!",
      "Narrator: Um... wow! Just... wow! What can I say other than... So for the first and, I guess, ultimate time, the day-heck, all the days-are saved-thanks to...",
      "Narrator: Mojo Jojo! Man, who'd-a guessed it? Mojo, a good guy after all. Had me fooled, but bravo, Mr. Jojo, bravo!  I really love my puppy, seriously. Thank you.",
      "Narrator: The city of Townsville!  Ahh, what a nice, calm, beautiful, and peaceful day-for reals this time!",
      "Mojo: Oh, no, the pleasure is all mine. It's the least I could do, Mr. President. Okay, well, thank you. Tell the people to enjoy the free electricity for life... Okay, bye-bye.",
      "Mojo: Girls, girls, it's great to see you!",
      "Mojo: How you been? Hope those talking unicorns I made for you aren't giving you any trouble. ",
      "Blossom: No, they're fine... heck, everything's fine.",
      "Buttercup: All the time.",
      "Bubbles: That's why we wanted to talk to you.",
      "Girls: We're really sorry. We didn't know we...",
      "Blossom: All that stuff you used to do...",
      "Bubbles: it all seemed so... so...",
      "Buttercup: bad.",
      "Mojo: Yes, yes, yes.",
      "Mojo: Some of my methods might have seemed unorthodox, crazy even, but my heart was in the right place. I had a dream, a passion to make the world a better place. I just needed an opportunity to do it. And I would've done it sooner if you little scamps didn't always stop me. Why I oughta... I kid, I kid.",
      "Mojo: You just misunderstood. It's fine. All water under the bridge. ",
      "Blossom: Thank you, Mojo.",
      "Buttercup: Seriously.",
      "Bubbles: Thank you.",
      "Mojo: No, thank you!",
      "Girls: Peace out, Mojo!",
      "Mojo: Ah, yes. Peace. Wonderful peace. Incredible peace. Nice peace. Quiet peace.",
      "Mojo: Boring peace.",
      "Mojo: It's driving me CRAZY!",
      "Mojo: Take that!",
      "Mojo: And that!",
      "Dove: What are you waitin' for? Get him! Pulverize him! Knock his block off! Give him what for! Make him answer to Punchy McGee and Fisty O'Flanagan!",
      "Blossom: Not-",
      "Buttercup: -so-",
      "Bubbles: -fast-",
      "Girls: -Mojo Jojo! ",
      "Narrator: The city of Townsville, on a crazy, tense, and dangerous day!",
      "Narrator: But a day that will be saved-thanks to the Powerpuff Girls! Whoo-hoo! Go, girls! Go!"
    ]
  },
  {
    "episode": "The Powerpuff Girls' Best Rainy Day Adventure Ever",
    "dialog": [
      "Narrator: The city of Townsville. And it's raining. ",
      "Narrator: No one on the streets, because it's raining. ",
      "Narrator: No government today- ",
      "Narrator: -because it's raining. Not even any crime, because it's raining. ",
      "Narrator: Run, little guy. Run and hide, because it's raining. ",
      "Narrator: And definitely no crime-fighting today-  -because it's raining. ",
      "Buttercup: This stinks!  I hate rainy days. There's nothing to do, there's nowhere to go. I need action. I need adventure. I need to punch! ",
      "Blossom: Hey!  I want to solve crimes and fight evil too, but I'm not taking it out on Bubbles. ",
      "Bubbles: Me neither. ",
      "Blossom: So it's raining. What are we to do? ",
      "Bubbles: I have an idea! Since we can't be the Powerpuff Girls outside-  -maybe we couldplaythe Powerpuff... Girls and... fight crime... right here... at home? ",
      "Bubbles: Sorry. ",
      "Blossom, Buttercup: That's a great idea! ",
      "Bubbles: But where do we begin? ",
      "Blossom: Right here. ",
      "Blossom: The city of Townsville. A harmonious community of happy little people. ",
      "Blossom: Look at all the happy little people. I'm happy, I'm driving, I'm happy and I'm driving. Hi, Joe, what do you know? ",
      "Blossom: Hey!  What do you think you're doing? ",
      "Buttercup: I'm a monster, and I'm eating Joe. I do that. ",
      "Blossom: Give me that! I haven't completely set up Townsville yet. Joe still has to go to the market and pick up milk for his children. I'll tell you when you can come! ",
      "Buttercup: No one tellsmewhen to come! I'm a monster! I surprise. ",
      "Blossom: Well,I'mrunning Townsville, soyouwait. ",
      "Buttercup: No!I'mrunning Townsville! ",
      "Blossom: I'mrunning Townsville! ",
      "Bubbles: No! ",
      "Bubbles: I'mrunning Townsville! ",
      "Blossom, Buttercup: Yes, sir, Mr. Mayor, sir! ",
      "Blossom: Here's your chair, sir. ",
      "Bubbles: Thank you. ",
      "Buttercup: And your desk, sir. ",
      "Bubbles: Uh-thank you. ",

      "Bubbles: Okay, now let's see what's on the agenda today... Oh! Call Ms. Bellum and ask her how to run the city. Hmm. Ms. Bellum-could you please come in here for a second?  Ms. Bellum, I'm waiting! ",
      "Blossom: Just a second, Mayor!  ",
      "Bubbles: I'm waiting, Ms. Bellum! ",
      "Blossom: Just a second, Mayor! ",
      "Blossom: Sorry, Mayor. There was traffic this morning. ",
      "Bubbles: Well, don't let it happen again! Anyway, is there anything going on today that I should know about?  ",
      "Blossom: If you look out your window, sir-  -you'll see a giant alligator destroying Townsville. ",
      "Buttercup: Now? ",
      "Blossom: Now. ",
      "Bubbles: I'm gonna hide under my desk like I always do. ",
      "Blossom: Don't you think you should call the Powerpuff Girls? ",
      "Bubbles: The Powerpuff Girls?  Oh, yeah, the Powerpuff Girls. Please, pick up! ",
      "Mayor: Hello?  Yes, Mayor?... A giant alligator?! I'm on my way! ",
      "Mayor: Uh... I fell in the mud. ",
      "Bubbles: Please, girls! Hurry! ",
      "Buttercup: Blossom here. What's the trouble? ",
      "Blossom: Hey! What do you mean, 'Blossom here'? ",
      "Buttercup: I'm Blossom now. ",
      "Blossom: No, no, no, no, no, no, no. I actually am Blossom, so you can't be Blossom. ",
      "Buttercup: Could you hold on a sec, Mayor?  We're playing pretend, right? ",
      "Blossom: Right. ",
      "Buttercup: Then I'mpretendingto be Blossom. ",
      "Blossom: Well... you can't. ",
      "Buttercup: Why not? ",
      "Blossom: Because... because you were playing the monster. ",
      "Buttercup: Well, now I'm playing Blossom. ",
      "Blossom: Well, then who am I supposed to be? ",
      "Buttercup: Bubbles. ",
      "Blossom: No way!  You be Bubbles! ",
      "Buttercup: No way!  You be Bubbles! ",
      "Blossom: You'reBubbles! ",
      "Buttercup: You'reBubbles! ",
      "Blossom: You'reBubbles! ",
      "Buttercup: You'reBubbles! ",
      "Bubbles: I'll be Bubbles. ",
      "Blossom, Buttercup: YOU CAN'T! ",
      "Blossom: You'reBubbles! ",
      "Buttercup: Yoube Bubbles! ",
      "Blossom: You'reBubbles! ",
      "Buttercup: You'reBubbles! ",
      "Blossom: You'reBubbles! ",
      "Professor: Girls, girls!  Will someone please tell me what's going on? ",
      "Professor: One at a time, one at a time!  Bubbles?  ",
      "Bubbles: We were playing the Powerpuff Girls-  -and Buttercup was a monster and I played the Mayor and Blossom was Ms. Bellum. Then Buttercup wanted to pretend she was Blossom, but Blossom wanted to be Blossom, and I wanted to be Bubbles, but they told me I couldn't. And no one wants to be me! ",
      "Professor: Can't you three play nice? I've got a lot of work to do today. So, how can we solve this problem? ",
      "Girls: Well... ",
      "Buttercup: Girls, the Mayor just called. There's a giant alligator destroying Townsville. ",
      "Blossom: Roar! ",
      "Buttercup: Let's fly! ",
      "Buttercup: Bubbles! ",
      "Buttercup: Let's go! ",
      "Buttercup: Choo, choo, choo, choo... choo, choo... ",
      "Blossom: Roar! Choo, choo, choo, choo.... ",
      "Buttercup: Oh, no! I'm going dooooooowwwnnn! ",
      "Blossom: Roar!  ",
      "Bubbles: I'm gonna kick your butt, evil monster!  Choo, choo, choo, choo... Give up, monster! ",
      "Blossom: Never!  Choo, choo, choo, choo... ",
      "Bubbles: Oh, no! I also am going dooooooowwwnnn! ",
      "Bubbles, Buttercup: Bubbles! Help us! ",
      "Professor: You havegotto be kidding me. I don't have time for this. ",
      "Buttercup: You gotta help us! ",
      "Bubbles: And the faster you help us, the faster you can go back to work! ",
      "Professor: You promise? ",
      "Bubbles, Buttercup: Yes! Now help us! ",
      "Professor: All right. Fly, fly, fly, fly, fly-  -pow-  -bye, bye, bye, bye, bye. ",
      "Bubbles, Buttercup: And the day is saved -thanks to the Powerpuff Girls! ",
      "Blossom: I don't think so!  We still have to figure out who the mastermind is behind the beast. It couldn't have been the Gangreen Gang. ",
      "Bubbles: It could have been Fuzzy Lumpkins. ",
      "Bubbles: Yee-haw! With my magic banjo, I brought the beast to life!  ",
      "Blossom: No... I don't think Fuzzy can be that creative. ",
      "Buttercup: Maybe it was me. ",
      "Buttercup: I have the power, the skill, and the wardrobe-  -to create such a beast. ",
      "Blossom: No! It was not you! ",
      "Blossom: It was me! Mojo Jojo! Only the greatest scientific mind this side of the galaxy could create such a beast. And because I have yet to meet a greater scientific mind this side of the galaxy, I can comfortably say that sentence comfortably. ",
      "Buttercup: That's so true!  ",
      "Blossom: Do not try and stop Mojo-  -uh! ",
      "Bubbles: Take that, Mojo Jojo!  ",
      "Blossom: Bubbles! What part of this pretend game don't you get?! ",
      "Bubbles: What do you mean? ",
      "Blossom: I'm not the real Mojo Jojo. I'm Blossom in a bucket!  ",
      "Bubbles: Well, you were just so convincing. What do you want me to do? ",
      "Blossom: PRETEND!! ",
      "Buttercup: Dummy!",
      "Blossom: All right, then. I, as thepretendMojo Jojo, will hide in my secret hideout. While you two, as the Powerpuff Girls-  -will try to hunt me down and stop me from my most diabolical plan. ",
      "Buttercup: And once we find you, the most important battle of our lives will ensue! ",
      "Blossom: Yes, yes, yes!  But pretend, of course. ",
      "Bubbles: I know. ",
      "Blossom: Now, close your eyes and count to sixty. ",
      "Bubbles, Buttercup: One, two-  -three, four, five, six, seven-  ",
      "Blossom: No... no... no... Yes! This is perfect!  ",
      "Bubbles, Buttercup: -fifty-eight, fifty-nine, sixty!  ",
      "Bubbles: Ready or not, Mojo Jojo- ",
      "Buttercup: -here we come! ",
      "Blossom: Those Powerpuff Girls will never find me! ",
      "Blossom: Aw, for Pete's sake! ",
      "Bubbles: Jump over the water! Jump over the water! ",
      "Blossom: What's going on? ",
      "Buttercup: We gave up looking for you hours ago. ",
      "Blossom: You don't want to finish what we were doing? ",
      "Bubbles: We're way finished. We're playing video games now. Jump over the water!  ",
      "Buttercup: I'm trying! ",
      "Blossom: Oh. I see. You two left me alone in a cupboard for two and a half hours, and you're not gonna try and stop my newest diabolical plan at all? ",
      "Buttercup: And what possibly could your diabolical plan be? Hmm? A stuffed animal? ",
      "Bubbles: Or maybe you're gonna throw your big shiny bucket at me. ",
      "Blossom: Behold! Mojo Jojo's finest diabolical plan ever!  ",
      "Bubbles: What are you doing?! ",
      "Buttercup: You wouldn't dare! ",
      "Bubbles: All right, Mojo! ",
      "Buttercup: Let's get it on! ",
      "Blossom: Hello? ",
      "Mayor: Blossom! It's the Mayor. Mojo Jojo has just unleashed a giant alligator upon Townsville! Oh, save us! ",
      "Blossom: Ohh, do we have to? Okay. ",
      "Narrator: The city of Townsville. And it's sunny. ",
      "Narrator: Playtime is over, so once again the day will be saved for real...",
      "Narrator: thanks to the Powerpuff Girls. Ohh, I wanted to be Bubbles!"
    ]
  },
  {
    "episode": "The Rowdyruff Boys",
    "dialog": [
      "Narrator: The city of Townsville...",
      "Narrator: is under attack by Mojo Jojo!",
      "Narrator: Go, Girls, Go!",
      "Mojo: Curse you-  -Powerpuff-  -Girls!",
      "Narrator: The city of Townsville is under attack!",
      "Mojo: Curse you, Powerpuff Girls!",
      "Narrator: The city of Townsville is under attack!",
      "Buttercup: Give it up, Mo-joke!",
      "Bubbles: You will never defeat us. So there! ",
      "Blossom: The Powerpuff Girls never lose!",
      "Mojo: Curse those accursed Powerpuff Girls. They always defeat my plans!  I must devise a plan so diabolical, so sinister, it will bring those tiny titans to their knees!  I need to beat them at their own game. I need to fight fire with fire! I need-  I need to make a phone call. ",
      "Inmate: Hey! Shut up in there! ",
      "Narrator: The Powerpuff Girls' house!",
      "Bubbles: Hello?",
      "Mojo: Hello-uh, may I speak to Professor Utonium?",
      "Bubbles: Who shall I say is calling?",
      "Mojo: Oh, no one he'd know, just a curious stranger. ",
      "Bubbles: PROFESSOR! THERE'S A STRANGER ON THE PHONE!",
      "Professor: Hello, Mr. Stranger. What can I do for you?",
      "Mojo: Oh. Uh, hi, I'm calling from Townsville Community College, and I'm doing a report on the Powerpuff Girls, and I was wondering-  -what exactly are those little girls made of?",
      "Professor: Aha-oh, well, the Powerpuff Girls. Well, let's see now. Eight cups of sugar, a pinch of spice-  -one tablespoon of everything nice, and-now, this one's important. Accidentally add a drop of Chemical X. And voila!",
      "Mojo: That's it?!  I mean-wow, thanks.",
      "Professor: I also have a great recipe for pound-",

      "Mojo: Sugar and spice and everything nice? That's too girlish. I need something tougher. Harder. More manly. Hmmm...",
      "Mojo: What are little boys made of?",
      "Mojo: I'll have the escargots, please. Thank you.",
      "Talking Dog: Ouch.",
      "Mojo: Let's see now. Snips and snails and a puppy dog tail. All that leaves is -",
      "Mojo: Chemical X! There's gotta be something around here with that potency. Hmm-let's see...",
      "Mojo: Aha!",
      "Mojo: Yes. Definitely, chemical-  -X! Mmmm...",
      "Mojo: Ahh-the moon is in proper alignment.",
      "Mojo: The cauldron awaits.",
      "Mojo: And the ingredients are ripe. Let the seeds of evil bear fruit!",
      "Mojo: Yes-Yes-Yes!",
      "Mojo: Ah, my children!",
      "Brick: Hands off! Who do you think you are anyway, Pops?!",
      "Mojo: Why, yes, I am your FATHER!!",
      "Mojo: CHILDREN!!",
      "Boomer: Hey! We ain't no babies!",
      "Boys: We're the Rowdyruff Boys! ",
      "Boomer: Boomer!",
      "Brick: Brick!",
      "Butch: Butch!",
      "Brick: We're here to kick some butt! And since yours is the only one around, we're gonna start with you!",
      "Mojo: Oh, no, no, boys. You don't want to kick my butt. My butt is as rotten as yours. What you want are butts settled on the throne of justice.",
      "Boys: Yeah!",
      "Mojo: Butts planted in the soil of nobility!",
      "Boys: Yeah!",

      "Mojo: Butts nestled between the pillars of peace and love! The butts you want to kick are the butts of-the Powerpuff Girls!",
      "Boys: Let's get 'em!",
      "Mojo: I'd be glad to take you to them if we only had a way out of heeeeeeee-",
      "Narrator: Boy, oh, boy! Those boys are b-b-bad to the bone!",
      "Narrator: The city of Townsville... is under attack!",
      "Blossom, Buttercup: Bubbles, look out!",
      "Bubbles: Go away, ladybugs! Go away! Huh?",
      "Bubbles: Go away, ladybugs! Fly! Fly away!",
      "Bubbles: Uh-oh.",
      "Blossom: Bubbles, are you okay?",
      "Bubbles: I think so, I-",
      "Brick: Why don't you guys pick on someone your own size?",
      "Brick: We're the Rowdyruff Boys, and we wanna fight!",
      "Blossom: What's up with those guys?!",
      "Buttercup: I think they're asking for a hiney-whooping! ",
      "Brick: Hey! What's wrong with you girls?! You're supposed to start crying when we hit you!",
      "Boomer: Yeah!",
      "Blossom: What are you guys, new?",
      "Bubbles: Yeah! We're the Powerpuff Girls!",
      "Buttercup: And it takes a lot more than a couple of cheap shots to make us cry.",
      "Brick: Well, then. I guess we'll just have to serve it up!",
      "Brick: Ballistic barrage!",
      "Blossom: Acrobattack!",
      "Shopkeeper: Bubbles! Are you all right?!",
      "Bubbles: Yeah, I'm okay. Sorry about your window, Mr. Looper. ",
      "Shopkeeper: It's Cooper! Cooper!",
      "Mayor: And furthermore, every Wednesday will be Pretzel Day.",
      "Mayor: Hello, Blossom!... Uh, goodbye, Blossom... Hello, Bubbles!... Uh, goodbye, Bubbles... Hello, Buttercup!... Uh, goodbye, Buttercup. What kind of pretzels do you think the girls like, the Bavarian or the tiny twists?",
      "Ms. Bellum: Sir, I think the girls may be in trouble.",
      "Mayor: Whatever makes you say that?",
      "Buttercup: Wh... wh... where'd they go now?",
      "Blossom: I don't know. But if we keep smashing up Townsville like this, I-",
      "Talking Dog: Powerpuff Girls, look out!",
      "Girls: Uh-oh.",

      "Passengers: Hooray for the Powerpuff Girls! We're saved! Hooray! Hooray! ",
      "Blossom: No problem, good citizens. We were happy to- ",
      "Talking Dog: Oh!",
      "Blossom: These guys aren't playing fair!",
      "Buttercup: They're really out to get us!",
      "Bubbles: And they don't care who gets in their way!",
      "Blossom: We better take this fight out of Townsville before some innocent people get hurt! ",
      "Buttercup: Catch us if you can!",
      "Butch: Look at those sissies!",
      "Boomer: Yeah! Running like little chickens!",
      "Brick: Let's get 'em! ",
      "Blossom: Here they come!",
      "Brick: Kick in the afterburners!",
      "Blossom: : Uh-oh! They're gaining fast!",
      "Buttercup: I... can't... see!",
      "Bubbles: I... can't... breathe!",
      "Butch: Good thing we had those burritos for lunch. ",
      "Boomer: Yeah, dude!",
      "Brick: Word!  NOW LET'S FINISH THOSE SISSIES!!!",
      "Boys: YEAH!!!",
      "Man 1: Look! Up in the sky!",
      "Woman 1: It's a missile!",
      "Woman 2: It's a bomb!",
      "Man 2: It's a death ray! ",
      "Ms. Bellum: It's the girls!",
      "Mayor: Oh...",
      "Brick: Well, that takes care of them.",
      "Butch: Let's go back to Mojo's pad and celebrate! ",
      "Narrator: No... no... say it isn't so... say it isn't true... say anything, girls... but please don't say goodbye... ",
      "Mojo: Goodbye, Powerless Girls. Your end has finally come. Your reign of goodness has come to an end, and my reign of evil has just begun!  Oh, you guys.",
      "Mayor: We're... oh, we're too late...",
      "Mayor: Powerpuff Girls! You're alive! ",
      "Blossom: Yes... but... we lost.",
      "Blossom: We failed you, Townsville.",
      "Buttercup: I guess you won't want us protecting you anymore.",
      "Bubbles: We're sure you'll find new, even better superheroes.",
      "Girls: Goodbye, Townsville. ",
      "Ms. Bellum: Girls! Girls, wait!  We don't want new superheroes. We love you.",
      "Girls: What?",
      "Ms. Bellum: Besides, you haven't lost. You've just been attacking the problem from the wrong angle. Listen. What do little boys fear more than anything in the world?",
      "Bubbles: Bugs! ",
      "Buttercup: No, Bubbles. That's what you're afraid of.",
      "Bubbles: Oh, yeah.",
      "Ms. Bellum: Girls-you have what boys fear most. Instead of fighting, try being nice.",
      "Girls: Huh?",
      "Ms. Bellum: You know-nice. ",
      "Blossom: I get it!",
      "Buttercup: Ewww, gross. ",
      "Mayor: What are you people talking about?! ",
      "Blossom: Come on, girls. Let's go... get 'em. ",
      "Ms. Bellum: Good luck, girls.",
      "Boys: WHAT THE-?!",
      "Mojo: GET THEM!!!",
      "Boys: What the-?",
      "Mojo: Curse you again, Powerpuff Girls! I'll be back, but next time I will not be defeated!",
      "Mojo: It is you who will be defeated, and when you're defeated, it is you who will have lost! ",
      "Narrator: Oh, Mojo, shut up!",
      "Blossom: I kinda liked kissing.",
      "Bubbles: Yeah! ",
      "Blossom: How about you, Buttercup? ",
      "Buttercup: Bleah! ",
      "Narrator: Oh, girls, you're growing up so fast. Whoa!",
      "Narrator: So once again the day is saved-thanks to the Powerpuff Girls!"
    ]
  },
  {
    "episode": "Three Girls and a Monster",
    "dialog": [
      "Narrator: The city of Townsville...",
      "Narrator: wins teamwork award!",
      "Mayor: Mmmm! Apple juice!",
      "Blossom: Buttercup! Hotline!",
      "Buttercup: I'm not getting it. You get it.",
      "Blossom: I'm busy drawing up new tactical maneuvers.",
      "Buttercup: Well, I'm busy drawing the carnage from my last battle.",
      "Blossom: Nobody cares to see your gore. Now answer it!",
      "Buttercup: Well, your plans stink. You answer it!",
      "Blossom: You're just a big bully!",
      "Buttercup: And you're Little Miss Bossy Boots!",
      "Blossom: Oh, yeah?",
      "Buttercup: : Yeah!",
      "Blossom: Oh, yeah?",
      "Buttercup: Yeah!",
      "Blossom: Oh, yeah?",
      "Buttercup: Yeah!",
      "Bubbles: Hello, Powerpuff Girls hotline.",
      "Blossom: Ah! Opportunity to put my plans into action! ",
      "Buttercup: No way! It's booty-kicking time! ",
      "Bubbles: Birds!",
      "Blossom: What?",
      "Blossom: Everyone okay?",
      "Bubbles: They're scared!",
      "Buttercup: They're scared of the monster. Well, I'm not scared of any monster. Are you? ",
      "Blossom: Well, then, come on! Let's go!",
      "Bubbles: People!",
      "Girls: Whoa...",
      "Blossom: Attack pattern Alpha-Omega-Atari! Go!",
      "Blossom: Alternate group plan attack G-Thirty-Seven! Ready! ",
      "Buttercup: Hold it! We're not pulling no G-Thirty-Seven!",
      "Blossom: We're not?",
      "Buttercup: We didn't even get a chance to attack him!  So instead of just buzzing around him in some fancy pattern, we're gonna hit him head-on and kick some monster butt! ",
      "Blossom: Well, that worked.",
      "Buttercup: Zip it, Red! Just a minor setback. I'll get him this time!",
      "Blossom: Oh, no, you don't!",
      "Buttercup: What are you doing?",
      "Blossom: You don't want to do it the proper way, then you don't do it!  Come on, Bubbles! ",
      "Buttercup: Fine!",
      "Buttercup: Blossom... are you all right?",
      "Blossom: Yeah, I think so.",
      "Buttercup: You dork! You couldn't beat an egg with one of those moves!  I guess I'll have to take care of this myself. Come on, Bubbles! ",
      "Blossom: Who's the dork now? I told you it takes a tactical plan to take down a monster. ",
      "Buttercup: Are you out of your mind?! You know darn well it takes good old-fashioned butt-whooping!",
      "Blossom: That kind of brutality doesn't work. It never works!",
      "Buttercup: Oh, yeah? Says who?",
      "Blossom: Says me!  Just look at these plans. They're foolproof!",
      "Buttercup: You're the fool!  Look at these muscles. This is what fighting is all about!",
      "Blossom: Brains! ",
      "Buttercup: Brawn!",
      "Blossom: Brains!",
      "Buttercup: Brawn!",
      "Blossom: Brains!",
      "Buttercup: Brawn!",
      "Blossom: It's the brains and I'll prove it to you! ",
      "Buttercup: Oh, no, you don't! You're not stealing all the glory! ",
      "Bubbles: Three... two... one... ",
      "Blossom, Buttercup: YOU-!",
      "Blossom: This is all your fault!",
      "Buttercup: My fault?",
      "Blossom: If you would have just stayed out of the way, my plan could have worked!",
      "Buttercup: You were in my way!",
      "Blossom: Your way won't work!",
      "Buttercup: Baloney! It's your way that won't work!",
      "Blossom: Well, if mine won't work, then neither will yours!",
      "Buttercup: Well, yours certainly won't!",
      "Blossom: Yours won't!",
      "Buttercup: Yours won't!",
      "Bubbles: QUIET!!!",
      "Bubbles: Um... excuse me, Mr. Monster? Um, I was wondering if you would, uh, be so kind as to stop destroying Townsville. We like our town very, very much, and I would appreciate it if you would just... leave. Pretty please with sugar lumps on top?",
      "Bubbles: Thank you! ",
      "Bubbles: There. THAT'S HOW YOU GET RID OF A MONSTER, YOU BIG, FAT, DOO-DOO HEADED NINNIES!",
      "Buttercup: Well, geez, I coulda done that.",
      "Blossom: Really? That's the easy way.",
      "Buttercup: At least I was trying to do it the right way.",
      "Blossom: You mean with a well-formulated plan.",
      "Buttercup: No, with muscle.",
      "Blossom: Nuh-uh. Plan.",
      "Buttercup: Muscle.",
      "Blossom: Plan!",
      "Buttercup: Muscle!",
      "Blossom: Plan!",
      "Narrator: And so once again the day is saved-",
      "Narrator: -thanks to Bubbles!"
    ]
  },
  {
    "episode": "Toast of the Town",
    "dialog": [
      "Narrator: The city of Townsville, which is run by the Mayor. Yes, the Mayor... the tenacious man with the rock-steady fortitude and stability of a concrete pillar, who's able to keep his fair town running like a well-oiledmachine.Yes, he is the very backbone of Townsville... unless he doesn't get his way.",
      "Mayor: Mayorwanttoast!Mayor wanttoast!",
      "Professor: Mr. Mayor, please understand, I am a scientist, not a repairman. You need to take your toaster to a factory-authorized service center and have it professionally serviced by a qualified technician.",
      "Mayor: MAYOR WANT TOAST! ",
      "Professor: All right, all right! I'll have a look at your toaster. But then I'vegot to get back to my experiments.",
      "Mayor: Oh, goody, goody!",
      "Mayor: Is it done yet?",
      "Professor: No.",
      "Mayor: How about now?",
      "Professor: No.",
      "Mayor: Now?",
      "Professor: No.",
      "Mayor: Now it's done, right?",
      "Professor: No, no, no, it's not done. Look, I don't really know what I'm doing, so it'sgonnatake a while. Why don't you just wait over there, and I'll let you know when I'm finished.",
      "Mayor: Oh... Ok.",
      "Professor: Anddon't touch anything! ",
      "Mayor: Ooh... What doesthisbutton do?",

      "Mayor: Whee! Do it again! Do it again! ",
      "Professor: Oh, no.",
      "Professor: You'regonnasit right here, be a good little Mayor, and stay put while I work on your toaster. And if you're quiet, you can have some candy.",
      "Professor: Good boy. ",
      "Mayor: Say, these are all lemon! Somebody ate all the goody cherry candies!  Mayor want cherry! Mayor want cherry!",
      "Professor: Here, cherry. Now please, let me work in peace. ",
      "Mayor: Oh, goody!",
      "Mayor: Oops. Uh-oh.",
      "Mayor: Ooh! Another shiny button.",
      "Mayor: Help! Help!  Huh?",
      "Mayor: Ooh... ",
      "Professor: Mayor?  He's being too quiet.",
      "Professor: Mayor, what are you... doing?!",
      "Mayor: Mayorwanthair.",
      "Professor: No! Mayor, stop!",
      "Mayor: Mayor gotta hair! Mayor gotta hair! Yummy 'X' powder made Mayor's hair grow! Professor. Professor?",
      "Professor: Yourhair wasn't the only thing that grew, Mr. Mayor.",
      "Mayor: Wowie zowie.",
      "Professor: Wowie-zowie, indeed. Have you no shame? A grown man your age gallivanting around like a little child, not doing what you're told! 'Mayorwanta this. Mayor want a that.' You, Mr. Mayor, are nothing but a baby, a big, big, big baby. ",
      "Mayor: Wah! Don'tsay that!",
      "Blossom: Professor, what's going on?",
      "Professor: Oh, it's the Mayor, girls. He got into my Chemical 'X', so I scolded him. And now he's run off pouting.",
      "Blossom: Better get the Antidote X ready. Come on, girls! ",
      "Mayor: Whoa! Neato!  Hello, folks. Having fun on thechoo-choo?",
      "Mayor: Ha, ha, ha! Funny, screamypeople. Ah, cool.",
      "Mayor: YEOW! Ouch! Ouch! Ouch! Ouch! You mean old train.",

      "Mayor: Ow! Ow! Ow, ow, ow, ow, ow! ",
      "Mayor: Ooh! Oh! Oh! Oh, oh, oh! Ow, ow, ow!",
      "Bubbles: Mayor, calm down.",
      "Mayor: Calm?! Mean genie blinded me! Mayor can't see because of the mean genie!",
      "Buttercup: Mayor, it's just a statue. See? ",
      "Mayor: Oh. Well, I nolikey, and I nolikeyall these big, mean, hard, pointy buildings either. They give me boo-boos andouchies. You know, this town should be made of softer, nicer buildings!",
      "Blossom: Mayor, there won't be any town left if you don't come back to the Professor's lab with us and take some Antidote 'X'.",
      "Mayor: But I don'twannatakenoAnimo'X'! ",
      "Bubbles: Mayor?",
      "Blossom: We wanted to see if you were all right.",
      "Buttercup: Yeah. Who knew you were such a big baby?",
      "Mayor: I no baby!Youseis just as mean as that mean old Professor!",
      "Professor: Girls, I've got the Antidote 'X'.",
      "Professor: Oh, Mr. Mayor, I brought you something yummy. It's yummy yum-yum time.",
      "Professor: Make sure he drinks all of it, girls. ",
      "Bubbles: Mmm,looky, Mayor. Yummy-yummyhappy juice.",
      "Professor: It's cherry-flavored!",
      "Mayor: Mayor nowanna!",
      "Professor: Oh, now what?",
      "Ms. Bellum: Mr. Mayor, ",
      "Ms. Bellum: don't you think you're being a bit immature?",
      "Mayor: Oh, stop it! More big, fancy words! I'll show you how amputured I am!",
      "Girls, Professor: Oh, no! He's got Ms. Bellum!",
      "Whitfield: Yes, the Mayor has Ms. Bellum, following an afternoon of hi-jinks that has terrorized Townsville. Let's go to Chopper Pete, who's live on the scene. What can you tell us, Pete?",
      "Pete: Thank you, Stanley. The Mayor seems to keep yelling out something about toast.",
      "Mayor: MAYOR WANT TOAST!",
      "Mayor: Back off, you pesky whirlybirds! You too.",
      "Blossom: Mr. Mayor, will youpleasejust take the Antidote 'X' so we can end this and all go home?",
      "Mayor: Iain'ttakingnothingtill I get what I want.",
      "Blossom: What is it that you want?",
      "Mayor: MAYOR WANT TOAST!",
      "Mayor: That big mean old Professor won't fix Mayor's toaster!",
      "Girls: Professor!",
      "Professor: Oh, all right. I'll do it.",
      "Ms. Bellum: Thisjob definitely doesn't pay enough. ",
      "Bubbles: *Mayor*",
      "Mayor: Wah! I didn't do it. It was the monkey. ",
      "Blossom: Mayor, it's only us.",
      "Mayor: Oh.",
      "Blossom: Webrought you something.",
      "Girls: *Oh, Mayor*",
      "Buttercup: Now what?",
      "Mayor: I want the crusts cut off.",
      "Buttercup: Why, Iought to- Lookout.",
      "Bubbles: Here you go. No crusts.",
      "Mayor: And a glass of milk. ",
      "Buttercup: That does it! I say we kick his-",
      "Blossom: It'sokay, Buttercup.",
      "Blossom: Hold this.",
      "Blossom: Okay, Mayor. Here's your milk. Now will you please eat your toast?",
      "Mayor: Well...",
      "Mayor: Ok.",
      "Mayor: Ah...",
      "Girls: Yay! ",
      "Crowd, Professor, Ms. Bellum: Yay!",
      "Pilots: Yay!",
      "Girls: See you, Mayor.",
      "Mayor: Wah! Mayor too high! Mayor wants to get down! Mayor wants to get down!",
      "Narrator: Ah, quiet, you big baby.Narrator wanna say, 'So once again the day is saved, thanks to... the Powerpuff Girls!'"
    ]
  },
  {
    "episode": "Too Pooped to Puff",
    "dialog": [
      "Narrator: The city of Townsville... is in need of some...",
      "Woman 1: HEEEEELLLLLLPPPPPPP!",
      "Woman 1 : Hooray!",
      "Policeman: Hey, uh... uh, Powerpuff Girls, uh... thanks for catchin' those crooks. We, um... we couldn't a done it without youse. Mmmm... oh, man, this is good. Oh, um... while you're at it, would you, uh, mind, uh... bookin' 'em, too?",
      "Woman 2: Powerpuff Girls... HEEEEELLLLLLPPPPPPP!",
      "Kid 1: Help! ",
      "Woman 2: Help!",
      "Woman 3: Help! ",
      "Curler woman: Hooray!",
      "Fireman 1: Oh, great job, girls. I didn't even have to move a muscle. Oh, and, uh, while you're at it...",
      "Fireman 1: would you mind walking Spot over here? He needs to go.",
      "Man 1: Powerpuff Girls! HEEEEELLLLLLPPPPPPP!",
      "Man 1 : Gee, thanks, Powerpuff Girls. It would have taken us minutes to screw in that light bulb!",
      "Technician: You know, us guys at the power plant aren't cut out to handle these kinds of situations.",
      "Man 2: Powerpuff Girls!  HEELLPP!",
      "Driver: Powerpuff Girls! HEELLPP!",
      "Old woman: Powerpuff Girls! Help!",
      "Kid 2: Help! ",
      "Woman 4: Help! ",
      "Man 3: Help! ",
      "Man 4: Help! ",
      "Woman 5: Help! ",
      "Ms. Keane: Help! ",
      "Mayor: Help! ",
      "Professor: Girls... help...",
      "Girls: No! ",
      "Professor: Huh? ",
      "Girls: We said no!  No, no, no!",
      "Blossom: We're sick and tired of doing everything around here!",
      "Professor: But...",
      "Blossom: It's 'Powerpuff Girls, this,' and 'Powerpuff Girls, that.' We've had enough!",
      "Professor: But...",
      "Blossom: That's it! We're not gonna take it anymore! You can just do it all yourself!",
      "Professor: But...",
      "Girls: But what?!",
      "Professor: But I can't reach it.",
      "Buttercup: Let's get out of here. Come on! ",
      "Bubbles: Do you think we were too hard on the Professor?",
      "Buttercup: No way. ",
      "Blossom: He and the rest of them need to learn to do things for themselves.",
      "Blossom: Let's just see how Townsville likes it when we're not here to pick up after them.",
      "Father: Why look, son. A giant monster's destroying Townsville.",
      "Son: Can we take him home, Dad?",
      "Father: No, we better leave him alone. The Powerpuff Girls'll take care of him.",
      "Pilot: Oh, playful critter. ",
      "Mayor: Oh, look. If it isn't another naughty little monster. He must be hungry. Well, I guess I'll just call the Powerpuff Girls, let them take care of things.",
      "Mayor: Oh, hello, girls. I- ",
      "Blossom: Hello.",
      "Blossom: You've reached the Powerpuff Girls hotline.",
      "Bubbles: Leave a message after the beep, and we'll get back to you... ",
      "Buttercup: when we feel like it! ",
      "Homeboy: Yo, yo, be careful with the G-ride. Yo, B, I think he's about to get jiggy with us.",
      "Bubbles: Can't we do something?",
      "Blossom: No, Bubbles, not this time.",
      "Buttercup: Yeah. Let 'em figure it out for themselves.",
      "Woman 6: Hey, look!  The Powerpuff Girls! There they are!  Woo-ooo! Oh, woo-ooo! Powerpuff Girls! In case you haven't noticed, there's a monster destroying our town.",
      "Man 5: Hey, why don't you little ladies just scoot on down here and take care of this little mess, huh? ",
      "Blossom: Take care of it yourselves.",
      "Narrator: Did we hear correctly? 'Take care of it yourselves'? What will Townsville do now?",
      "Man 6: Powerpuff Girls! Help us! The monster's stuck in the telephone wires!",
      "Blossom: That's good!",
      "Crowd: Hooray! We destroyed the monster!",
      "Blossom: Uh... no, you didn't. ",
      "Crowd: Help! Help! Destroy the monster!",
      "Blossom: We're not gonna destroy the monster,youare!",
      "Man 7: Okay! Let's get him!",
      "Crowd: Yeah, let's get him! Go!",
      "Man 7: Uh... how do we do that?",
      "Bubbles: Well, how do you think?",
      "Woman 7: I would use my superpowers!",
      "Man 8: Or heat ray!",
      "Man 9: I could use my ice breath!",
      "Buttercup: You townspeople don't have superpowers like us, so you have to use your ownnormalpowers. Now, how do you get a monster to stop destroying your town?",
      "Man 10: Destroy him!",
      "Crowd: Yes! Destroy him!",
      "Bubbles: Good. Buthoware you gonna destroy him?",
      "Man 10: Mmmm, uh... we don't know!",
      "Crowd: Yes! We don't know!",
      "Bubbles: Well... the monster is stuck in the electrical wires, so what doesn't mix well with electricity?",
      "Man 11: Uh... feet!",
      "Woman 8: Frankorstein?",
      "Man 12: I know! A rubber chicken!",
      "Bubbles: This is gonna be tougher than I thought.",
      "Blossom: Let's try this another way. Hey! Why shouldn't you put a toaster in a bathtub?",
      "Man 13: Well, duh! You wouldn't be able to make toast in the kitchen!",
      "Woman 9: Yeah! You would have to go to the bathroom every time you wanted toast. What a waste of time!",
      "Blossom: Why shouldn't you put atoasterin a bathtub, full ofwater?",
      "Man 9: Because your toast would get soggy! ",
      "Man 13: So, if we can get the monster to take a bath, his toast will get soggy!",
      "Man 10: Yeah, that's how we destroy him! Make his toast soggy!",
      "Buttercup: No, no,no!What would happen ifyouwere in a bathtub when the toaster fell in?",
      "Man 14: Um... you, uh... get... shocked?",
      "Girls: Yes! Now you have it!",
      "Man 13: So, if we can get the monster to take a bath... then he will get shocked!",
      "Woman 9: But where are we going to find a bathtub to fit the monster?",
      "Man 14: And where do we get a toaster?",
      "Man 13: Do you have a toaster?",
      "Kid 3: I don't have a toaster.",
      "Man 9: I could be soggy toast.",
      "Blossom: There's another way! You already have your toaster. It's the electrical wire wrapped around the monster. Now, what do you fill a bathtub with?",
      "Crowd: Water?",
      "Blossom: Very good!",
      "Fireman 2: Where the heck are we gonna get that much water? ",
      "Girls: FIGURE IT OUT!!!",
      "Voice: Pssst!",
      "Crowd: Ooooh... Ahhhh... Ohhhh...",
      "Girls: You did it! You did it!",
      "Crowd: Did what?",
      "Girls: Destroyed the monster! ",
      "People at front of the crowd: Hooray! We destroyed the monster! ",
      "Woman 8: Who needs those Powerpuff Girls?",
      "Woman 9: We can take care of things on our own!",
      "Blossom: I'm beat.",
      "Buttercup: Yeah, let's go home.",
      "Mayor: Woo-hoo!",
      "Bubbles: It's the Mayor! ",
      "Mayor: Powerpuff Girls, would you come down here, please?  Oh, hello, girls. I want to thank you for teaching the people of Townsville a very important lesson today. I can't quite remember what that was right now, but... oh, well, I gotta get to that party! Later!  Oh, and, girls...",
      "Mayor: would you mind cleaning up Townsville? It's a major pigsty. Thanks a bunch. Woo-hoo! Par-tay!",
      "Narrator: So once again the day is saved- with no thanks to the Powerpuff Girls! Hey... I did that all by myself!"
    ]
  },
  {
    "episode": "Town and Out",
    "dialog": [
      "Professor: The town of Citiesville.",
      "Professor: It's home to the top research lab in the world.",
      "Bubbles: Yeah. But why are we moving there?",
      "Professor: Well, I took a job offer at their lab. And we have to move here for me to work there.",
      "Bubbles: Bye-bye, Townsville.",
      "Professor: I tell you, girls, I'm really excited about this move. A new start, new places, new friends. Oh, I can't wait!",
      "Professor: And if what I've heard is true, Citiesville is a great place to live.",
      "man: Hey, I'm going to work, Jim. I'll be back in a while.",
      "Professor: Here we are. Looks nice and safe.",
      "Professor: Wow! This isgreat! Well, look at that. It's got a bathroom right there in the kitchen!",
      "Blossom: I don't see it.",
      "Blossom: Professor, how are we gonna fly to school... if we don't know where it is?",
      "Girl: Hi! You must be the new kids. Oh... my... gosh! I justloveyour matching dresses! ",
      "Blossom: Really?",
      "Girl: No-ooo! Ha, ha, ha! ",
      "Blossom: Anyway, there'll just be certain emergencies-",
      "Blossom: -where we'll justhaveto be excused. ",
      "Grumpy Teacher: Take your seats.",
      "Blossom: But- ",
      "Boy: Psst! Ahh... ",
      "Bubbles: You guys! ",
      "Blossom, Buttercup: We know.",
      "Girls: Teacher, may we please be excused to save the town?",
      "Professor: Hi, girls!",
      "Blossom: Professor, what do you think of this town?",
      "Professor: It's great!  I just absolutely love it! It's like a real city here! And the people... you know what I mean?",
      "Professor: Can't you just feel the energy?  I LOVE THIS TOWN!",
      "Man: Ah, shut up, you jerk! ",
      "Professor: City folk. So how was your day?",
      "Blossom: Ha, ha. Um... Uh... Oh... Yeah. Great. ",
      "Professor: Great!",
      "Bubbles, Buttercup: Great.",
      "Blossom: Look, as soon as we sort everything out with their Mayor, everything will fall into place.",
      "Blossom: We're superhero crime-fighters, and since we're new in town,-",
      "Blossom: -we thought we'd drop by and get acquainted with the Mayor.",
      "Receptionist: Uh-''huh''! Well, that sounds just great. But, since you don't have an appointment, you're going to have to wait over there, hmmm?",
      "Receptionist: Powderpuff Girls?",
      "Blossom: Here.",
      "Receptionist: The Mayor... will see you now.",
      "Citiesville Mayor: Come on in, boys.",
      "Male staff member: Here's that very important document, sir.",
      "Citiesville Mayor: Okay... Now, how can I help you?",
      "Blossom: Actually, Mr. Mayor, we're here to helpyou. You see, we're the Powerpuff Girls, and we're superheroes, and we have superpowers, and we fight crime and beat up bad guys and stuff.",
      "Bubbles: And we can fly around... Whee! Whoo!",
      "Blossom: And we brought you this hotline phone-  -so if you're ever in trouble, you can just give us a call.",
      "Citiesville Mayor: Um... Okay. Well, I already have a phone, so if you could please get to the point. As you can see, I'm a very busy man.",
      "Blossom: Uh... Now what?",
      "Buttercup: We're superheroes! We're here to help you fight crime! ",
      "Citiesville Mayor: Yes. Uh, Philip?",
      "Receptionist : The Chief of Police is on line nine. He says it's urgent.",
      "Citiesville Mayor: What is it, Chief?",
      "Chief: Tom! The City First Bank was just robbed again! If I don't get more officers, I don't know what! ",
      "Citiesville Mayor: I'm working on the bill as we speak. I don't know what else I can tell you.",
      "Blossom: The bank's been robbed! This is our chance to prove ourselves! ",
      "Policeman: This is Car Fifty-Four. They just passed the Children's Hospital, and they're heading north on Murray. ",
      "Blossom: There they are!",
      "Driver: Watch this!",
      "Girls: Not so fast, bad guys! ",
      "Driver: Hey, go play somewheres else, you little brats!",
      "Buttercup: Brats?!",
      "Blossom: He's heading for the bridge! Quick! Starburst formation!",
      "Blossom: People of Citiesville! Fear no more! Behold your saviors! The Powerpuff Girls! Here to stamp out crime and villainy and bring safety to all!  No thanks necessary, Officer. Just doing what comes naturally.",
      "Buttercup: Hey, let's get outta here! ",
      "Blossom: Professor?",
      "Professor: What a day! Am I right?",
      "Buttercup: Oh, brother! ",
      "Blossom: Well, I guess it was pretty good.",
      "Blossom: Hello? Uh-huh... Yes! Okay. It's the Mayor's office. He wants to see us right away.",
      "Citiesville Mayor: Let me tell you some words. At what point did it seem like a good idea to blow up the Cityville Bridge?",
      "Blossom: Uh... ",
      "Citiesville Mayor: No!  Do you realize the two crooks that you caught stole approximately $400?  Do you realize that you did over $3 MILLION IN PROPERTY DAMAGE TO THAT BRIDGE??!! IT'S NOT REPLACEABLE!!!!!",
      "Citiesville Mayor: Also, that bridge is- orwas- a historical landmark. I mean, it's on our flag, for Pete's sakes! It's also the main thoroughfare into the city!  Nobody actuallylivesin Citiesville!  They commute!",

      "Citiesville Mayor: This is a bill prohibiting the use of superpowers in the town of Citiesville. You're hereby forbidden by law to use any of your powers within the city limits.",
      "Citiesville Mayor: Now get out of my sight.",
      "Pilot: Attention! This is the Citiesville Police Department! You are flying in a no-fly zone! Land now! ",
      "Buttercup: Looks like we're hoofing it.",
      "Bubbles: I guess it could be worse.",
      "Gravelly voice: Hey, ladies.",
      "Hippie: Nice dresses. ",

      "Bum: Hi, now. I'm trying to get to three million dollars. Can you help me out?",
      "Bum: Ahh, forget you, then! Someday you'll learn the importance of helping others!",
      "Buttercup: Oh, man! ",
      "Bubbles: What now? ",
      "Blossom: We live overthere, remember? ",
      "Buttercup: Oh, Cold... cold... cold...! ",
      "Professor: So, how did it go with the Mayor?",
      "Blossom: Professor, we tried to tell you before, but you-",
      "Buttercup: This place STINKS!",
      "Bubbles: I wanna go home!",
      "Blossom: We tried to tell you, but you wouldn't listen, and we know how much you like it here, and...",
      "Blossom: Professor?",
      "Girls: Professor?",
      "Professor: Oh, girls... You don't know how happy this makes me!",
      "Girls: Huh?",
      "Professor: Oh, I've been hating it here so much! Hating, hating, hating, hating it! Oh, they pick on me at work, and they call me square, and... Oh, so what do you say, kids?",
      "Bubbles: Bye-bye, bad old Citiesville! ",
      "Narrator: And hello, city of Townsville!",
      "Narrator: So once again, the day is saved, thanks to the Powerpuff Girls!"
    ]
  },
  {
    "episode": "Twisted Sister",
    "dialog": [
      "Narrator: The city of Townsville, on a sunny Sunday afternoon.",
      "Narrator: The perfect day to put your feet up, ",
      "Narrator: have a picnic,",
      "Narrator: take a drive up the coast,",
      "Narrator: or just kick back, relax, and let all your troubles wash away with the tide.",
      "Narrator: Everyone is taking it easy. Everyone except for...",
      "Narrator: the Powerpuff Girls!",
      "Professor: Hello, my little angels. Welcome home. Big day out saving the world? Oh, that's nice. But don't forget. You need to clean your room, wash the dishes, take out the trash, finish your homework,",
      "Professor: fix the roof, eat your dinner, clean your plates, sweep the floors, brush your teeth...",
      "Buttercup: I can't take this anymore.",
      "Bubbles: Yeah, I'm Power-pooped.",
      "Blossom: I know we're overworked, but what can we do?",
      "Buttercup: We need some help.",
      "Bubbles: Yeah, three Puffs aren't enough.",
      "Professor: answer the hotline, and save the world.",
      "Blossom: Now let's see.",
      "Blossom: The first thing we need is... sugar.",
      "Bubbles: I'll get it! ",
      "Blossom: Then spice.",
      "Buttercup: I'm on it! ",
      "Blossom: Next you need... ",
      "Bubbles: I couldn't find any sugar, but I did find artificial sweetener.",
      "Blossom: That's okay. Next, you need...",
      "Buttercup: I didn't know where to get spices, so I got dirt and twigs and stuff.",
      "Blossom: Well, that's kinda like spices. Put it in. Now, next, you need... everything nice!",
      "Girls: Oh, boy! ",
      "Bubbles: Crayons are nice.",
      "Blossom: Books are nice.",
      "Buttercup: Lizards are nice.",
      "Bubbles: I like flowers.",
      "Blossom: Computers are good.",
      "Buttercup: A football.",
      "Bubbles: Stuffed animals.",
      "Blossom: A calculator.",
      "Buttercup: A mackerel.",
      "Bubbles: More flowers.",
      "Blossom: A compass.",
      "Buttercup: Boxing gloves!",
      "Bubbles: Ribbon!",
      "Blossom: Art.",
      "Buttercup: Band-Aids.",
      "Bubbles: A smiley face.",
      "Blossom: A globe.",
      "Buttercup: A knuckle sandwich.",
      "Blossom: Okay, the final and most important step is to accidentally add Chemical X to the concoction.",
      "Blossom: Oh, look at what I found, girls. Chemical X.",
      "Bubbles: Be careful with that Chemical X.",
      "Buttercup: Yes, Blossom, whatever you do, do not drop that Chemical X.",
      "Blossom: Don't worry, I wo-  Whoops. I accidentally dropped the Chemical X, and it fell into the concoction.",
      "Girls: Oh, no.",
      "Buttercup: Someone say something!",
      "Bubbles: Hi! We're the Powerpuff Girls.",
      "Bunny: Powawulls?",
      "Blossom: Yeah, we're sisters.",
      "Bunny: Sistahs! ",
      "Blossom: That's right, you're our sister too.",
      "Bunny: Sistah! ",
      "Blossom: Yeah, I'm...",
      "Blossom: Blossom.",
      "Bubbles: Bubbles!",
      "Buttercup: And I'm Buttercup. ",
      "Blossom: And you are?",
      "Bunny: Blaaaah!",
      "Blossom: Um, that's a little hard to pronounce. How about-",
      "Buttercup: 'Braces.' ",
      "Blossom: Buttercup!",
      "Bubbles: I know! 'Bunny!'",
      "Blossom: Okay, that's good. Okay, stop! Stop!",
      "Blossom: Good.",
      "Blossom: Now listen. Now that you're a Powerpuff Girl, you've got a lot of responsibilities. Are you listening?",
      "Bunny: Uhhh? ",
      "Blossom: Okay, it's your job to fly around and keep Townsville safe from crime. ",
      "Buttercup: And when you catch the bad guys, BAM! POW! You beat 'em up! ",
      "Bubbles: And then throw 'em in jail. ",
      "Girls: Understand?",
      "Bunny: Mmmmhmmm!",
      "Girls: Good! Now go fight crime!",
      "Bunny: Criiiiime! ",
      "Girls: Go, Bunny! Go!",
      "Narrator: Yes! Go, Bunny! Uh, go!",
      "Blossom: It's your job to fly around and keep Townsville safe from crime.",
      "Bunny: Huuuhhhh!  Huh?",
      "Cop: Freeze! Don't make a move!  On the ground.",
      "Buttercup: And when you catch the bad guys...",
      "Buttercup: BAM! POW!  You beat 'em up!",
      "Bubbles: And then throw 'em in jail. ",
      "Narrator: Okay... well, that didn't go as planned.",
      "Professor: What's this? No crime today, girls?",
      "Buttercup: Oh, sure.",
      "Bubbles: But don't worry, Professor.",
      "Blossom: We've got it all under control.",
      "Reporter: We interrupt this program for an important news bulletin.",
      "Reporter: It seems one of the Powerpuff Girls has gone muy loco.",
      "Reporter: She's been releasing prisoners from jail, and imprisoning the police.",
      "Reporter: Panic in the streets. Criminals on the loose.",
      "Reporter: Townsville in much, much trouble. ",
      "Girls: Bunny!",
      "Bubbles: We've got to find her!",
      "Buttercup: And fast!",
      "Blossom: Let's go! ",

      "Narrator: Hurry, girls, hurry! You've created a monster! ",
      "Girls: Bunny! ",
      "Bunny: Wha?",
      "Bubbles: What have you done?!",
      "Bunny: Bunny do good! Bunny do good!",
      "Buttercup: No, Bunny do bad! Very bad!",
      "Bunny: Baugh?",
      "Blossom: Yes, bad. You're supposed to stop crime, not help start it. I guess you're not cut out to be a Powerpuff Girl after all.",
      "Bunny: No Powawull?",
      "Girls: No.",
      "Blossom: Wait, Bunny, come back!  Do you think we were too hard on her?",
      "Prisoners: Not as hard as we're gonna be on you!",
      "Narrator: Oh, no! The girls are getting pummeled by every villain in Townsville!  Oh, Bunny?! Where are you, Bunny?! Ah, your sisters need you!",
      "Girls: Bunny, help! Help us, Bunny! Help!",
      "Bunny: Huh?",
      "Girls: Help us, Bunny, help us!",
      "Bunny: Oh, Powawulls need help!",
      "Narrator: Go, Bunny, go!",
      "Bunny: BUNNY DO GOOD!!!",
      "Bubbles: Wha... Wh-Wh-Wh-What happened?",
      "Blossom: Bunny saved us! ",
      "Buttercup: But... where is she?",
      "Girls: Bunny!",
      "Bubbles: Oh, no! She 'sploded.",
      "Buttercup: But why?",
      "Blossom: I guess she was unstable, and the blast broke her down into her original ingredients.",
      "Bubbles: She was good after all. We were the ones who were bad.",
      "Narrator: Oh, it's so sad, I can't take it. So, for the first and FINAL time, the day is saved...",
      "Narrator: Thanks to Powerpuff... BUNNY!",
      "Bunny: Powawull!",
      "Narrator: OH, WHY?!? Why?  Oh, go to commercial!"
    ]
  },
  {
    "episode": "Uh Oh Dynamo",
    "dialog": [
      "Narrator: The city of Townsville!  And what a city it is!",
      "Narrator: Our citizens have made it the pride of the free world. It has it all. A highbrow museum.",
      "Narrator: Ultra-efficient public transportation.",
      "Narrator: An honest local government.",
      "Narrator: Five-star restaurants. Advanced learning facilities. Volcano-top observatory. Fully stocked groceries.",
      "Narrator: Bowling! About the only thing it doesn't have is...",
      "Narrator: Mount Rushmore!",
      "Foam finger man: Hi, Mom!",
      "Narrator: But other than that, Townsville is a proud, bustling melting pot of varied culture and communities. In fact, one such area is...",
      "Narrator: Little Tokyo, Townsville! And today, our favorite family is enjoying a picnic in Bonsai Gardens Park.",
      "Narrator: And although today is a day of play, the sisters Puff are quite tough. So make no mistake, their vow they won't break. For it is the priority of this young sorority, to protect this metropolis built by all of us. Thank you.",
      "Professor: Okay, girls, say...",
      "Girls: Cheese! ",
      "Professor: One more! ",
      "Buttercup: You gotta be kidding!",
      "Professor: My babies!",
      "Blossom: Okay, fish-face!",
      "Professor: I'm coming!",
      "Professor: Oh, girls, I thought I was going to lose you.",
      "Buttercup: Come on, don't be silly. We're superheroes, you know. That's what we're supposed to do, fight crime and giant monsters.",
      "Professor: Girls... wake up. I have something important to show you.",
      "Blossom: What is it?",
      "Girls: WHAT IS IT??",
      "Professor: Behold-Powerpuff Dy.Na.Mo!  I made it.",
      "Blossom: That's neat, Professor.",
      "Bubbles: Dy.Na.Mo...?",
      "Professor: Dynamic Nanotechtronic Monobot. Dy.Na.Mo.!",
      "Professor: She's a state-of-the-art, internal tele-operated, intelligent protection system!",
      "Professor: With multi-layered titanium reflux-chambered shielding.",
      "Professor: And a fully loaded, defensive smart strategic combat arsenal.",
      "Professor: She's megalith-martial-combat-ready!",
      "Professor: As well as having this anti-aggressor exo-deflector array. This baby is the ultimate in superhero super-safety!",
      "Blossom: Uh... that-that's super, Professor, but we don't need a battle robot.",
      "Buttercup: We have superpowers, you know. ",
      "Professor: Look, girls. Yesterday's horrible, horrible monster fight made me realize something. You girls are everything to me. You are my life, and... and I'm responsible for your safety and protection. ",
      "Buttercup: Aw, Professor!",
      "Professor: Girls! Promise me you'll use it. Promise?",
      "Blossom: Oh... well... okay. But only if we really need it.",
      "Professor: Great.",
      "Buttercup: Yeah. Great. ",
      "Blossom: Right, Mayor. We're on it!",
      "Professor: Girls! Wait!  You forgot the Dy.Na.Mo..",
      "Girls: Let's do it!",
      "Professor: Girls!",
      "Professor: You need the Dy.Na.Mo.!",
      "Narrator: Whoo! Oh, what a super-tough week on the job for our little superheroes!",
      "Narrator: Now it's time for some super rest and relaxation. Back in Bonsai Gardens Park, it's time for the evening paper-boat races.",
      "Bubbles: TGIF! ",
      "Blossom: Bubbles, it's Saturday!",
      "Bubbles: I know. What a week. It's root beer time! ",
      "Girls: Aw, man!",
      "Buttercup: Can't you come back later?! It's Saturday!",
      "Girls: Hey!",
      "Blossom: Hey, you... giant... fish balloon!",
      "Bubbles: Yeah, you! ",
      "Buttercup: We're gonna burst your bubble!",
      "Professor: Girls! I beg you! Use the Dy.Na.Mo!  Oh, for gosh sakes, you need her!",
      "Buttercup: Aw, man!  I could still kick his bu- ",
      "Professor: Use the Dy.Na.Mo. or you're all grounded.",
      "Blossom: Oh... all right. What harm could it do?",
      "Professor: Prep sequence Alpha-Omega.",
      "Blossom: Copy that. All systems, check!",
      "Bubbles: Pelvic stabilizers are go!",
      "Buttercup: Extremity activators are go!",
      "Blossom: Neural net online, and... engage!",
      "Professor: Easy, now... easy... easy... easy, now... easy...",
      "Talking Dog billboard: It's good. It's good. It's good. It's good.",
      "Old woman: Back, you bad old giant fish balloon!",
      "Blossom: ALL RIGHT, TOKYO TOWNSVILLE! ARE YOU READY?!",

      "Girls: What's going on?!",
      "Buttercup: What the heck happened?!",
      "Blossom: I don't know.",
      "Blossom: The Professor left the safety on!",
      "Girls: Professor!",
      "Professor: I was worried.",
      "TD billboard: It's good. It's-",
      "Sightseer: Hey!",
      "Mayor: Professor!",
      "Professor: Mayor!",
      "Mayor: Oh, my! Powerpuff Girls! Thank you for destroying that evil giant fish balloon... BUT YOU ALSO DESTROYED MY BEAUTIFUL CITY!!! NEVER USE THAT... THAT... BOTSTROSITY AGAIN!!!",
      "Crowd: YEAH!!!",
      "Blossom: But... but it's the Professor's fault!  He made us use it!",
      "Professor: But... but, uh...",
      "Crowd: PROFESSOR!!!",
      "Professor: Well, um... eh... Gotta go!",
      "Narrator: So once again the day is saved-uh, destroyed-thanks to the Powerpuff Girls!  Well, actually, the Professor. Just 'cause you're a genius doesn't make you a smart guy."
    ]
  },
  {
    "episode": "West in Pieces",
    "dialog": [
      "Narrator: The town of Townsville. A simple little town of law-abidin' folk.",
      "Saloon customer: Mahatma rice.",
      "Bouncer: Hey! You cain't come in here like that!",
      "Man in overalls: Pardon.",
      "Bouncer: That's more like it.",
      "Ms. Bellum: Sheriff, Dentist, Window Maker, Blacksmith's office. Sure. Please hold.",
      "Ms. Bellum: Excuse me, Mr. Sheriff, Dentist, Window Maker, Blacksmith. Mr. Bell called from the saloon. He needs a re-glass on his front window.",
      "Mayor: Okay, Ms. Bellum. I'll get on it right after this job.",
      "Mayor: Huh. Better put this one back on the coals.",
      "Mayor: Okay, you can rinse now.",
      "Narrator: Suddenly, out of the west...",
      "Narrator: approaches a presence so evil, so ominous, so fearful...",
      "Rider: Hyah! ",
      "Narrator: so malevolent-",
      "Narrator: -so sinister, so...",
      "Narrator: short. Yes, Mojo the Kid and his faithful steed Burrito.",
      "Burro : S.",
      "Narrator: Uh-oh. This doesn't look good.",
      "Yokel: Uh... say that again?",
      "Shank: All right. You need to go back to the end of the line and fill out a withdrawal slip.",
      "Shank: Okay. Anyone in line for deposit only, or a tonsil removal, DMV registration?",
      "Shank: I just love doing that.",
      "Narrator: Suddenly, Mojo the Kid busts in!",
      "Narrator: Suddenly, Mojo the Kid busts in! ",
      "Mojo: All right! Nobody move!",
      "Mojo: Read this to him.",
      "Yokel: Uh... A... I-O...",
      "Mojo: Give me that!  'I, Mojo the Kid, hereby intend to rob this bank by forceful means and-'",
      "Mojo: I, Mojo the Kid, hereby intend to rob this bank by forceful withdrawal of its funds-  -therefore removing by force all acceptable forms of currency!  And surrender them unto my possession! Hmph!",
      "Shank: Mmm-hmm... Mmm-hmm, yeah, right, look. You need to fill out this robbery slip-  -and go wait in line with the others.",
      "Robber 1: Hey, um... what's today's date?",
      "Robber 2: You got a pen that writes? ",
      "Mayor: All right!",
      "Mayor: Where's them broken windows?",
      "Mojo: So, you're the famous Sheriff, Dentist, Blacksmith, Window Maker. Well, there is a new Sheriff, Dentist, Blacksmith, Window Maker in town, and his name is Mojo the Kid! I will return tomorrow at twelve noon to rob the Second Bank Ever. And when Mojo the Kid-that's me-returns at twelve noon tomorrow, I want you out of this town!",
      "Mayor: Okay.",
      "Mayor: I get to go out of town, I get to go out of town, deet-da-doot-da-dee...",
      "Narrator: And so Mojo the Kid robs the First Bank Ever. Then, exitin' the buildin', guns a-blazin'...",
      "Narrator: he calls for his faithful steed, Burrito.",
      "Burrito: S. ",
      "Narrator: He makes his grand escape...",
      "Mojo: YEEEEEOOOOOWWWWW!!",
      "Narrator: and he rides off-  .-into the sunset.",
      "Narrator: Oh, no. What will the people of Townsville do?",
      "Muttonchop: Well, what are we gonna do?",
      "Yokel: I says we get ourselves a posse and shoot him down at dawn.",
      "Muttonchop: Shoot him? With what? Cain't use no guns on TV, you nitwit!",
      "Prospector: Sock him in the head with a... ",
      "Lummox: Hammer?",
      "Prospector: Shillelagh!",
      "Lummox: Uh, 'scuse me, Mr. Guv'nor. We can talk to him real nice-like and-and-and ask him to leave us alone?",
      "Muttonchop : Why? Why?  Why did you have to make... the biggest guy in town... THE STUPIDEST?!?",
      "Governor: Talk to him? He don't gotta leave nobody alone no-how, nowhere, no-what, long as he be goin' around with that big-bang, bazoomin', banana-shootin' thing, goin' pow-pow-pow over the folks' heads!",
      "Governor: We's doomed! ",
      "Yokel: 'S all right, Paw. 'S all right.",
      "Ms. Bellum: I have an idea. Why don't we ask that crazy inventor who lives on the edge of town to help us? ",
      "Governor: Say, I know! Why don't we ask that crazy inventor who lives on the edge of town to help us? ",
      "Professor: Hmm, let's see here.",
      "Professor: Sassafras...",
      "Professor: arsenic...",
      "Professor: and everything old-fashioned.",
      "Professor: Hmm. I'm missin' somethin'.",
      "Governor: There's his house! ",
      "Yokel: Maybe he's in the john.",
      "Yokel: Boy, he had to go bad.",
      "Governor: Professor Utonium! You gots to help us! Mojo the Kid has robbed the First Bank Ever!",
      "Yokel: Yeah.",
      "Governor: And he's thrown the Sheriff outta town!",
      "Yokel: Yeah.",
      "Yokel: Yeah. Uh-oh.",
      "Lummox: Wait! He's tryin' to say somethin'. Muh... muh... muh... marshmallow macaroon? ",
      "Governor: Gimme that!",
      "Professor: Boys! I've just invented a solution to all your troubles. Citizens of Townsville, I give you...",
      "Professor: Blossom, Bubbles, and Buttercup. The Steamypuff Girls!",
      "Governor: Um, pardon, Mr. Utonium, sir, but how's them three little girly-girls S'POSED TO PROTECT US FROM MOJO THE KID?!?",
      "Professor: Um... girls? ",
      "Blossom: We'll knock him to Knoxville!",
      "Buttercup: We'll nail him to Salem!",
      "Bubbles: We'll smack him... uh, sorta... to Florida? ",
      "Buttercup: That's not a city, it's a state, dum-dum!",
      "Bubbles: I know, but it rhymes. ",
      "Blossom: Whatever. Girls, let's show 'em what we got!",
      "Professor: Oops. Forgot.",
      "Ace: Hey, man, do you see what I see?",
      "Mayor: Yoo-hoo!  Howdy, partners! Are youse the stagecoach?",
      "Ace: Uh... stage?  You mean, like, a play? Uh, yeah, yeah, sure. I-I-I coach all of them stages. You know, like that Broadway up in, uh, New York. Or-or like that dude who's, uh, shakin' the spear all the time, you know.",
      "Mayor: Oh, great! 'Cause I need a ride outta town with all my really valuable stuff.",
      "Ace: Um... well... like, we got no more room for passengers, but, um... we can take all your stuff for you.",
      "Snake: S-S-S-So you won't have to carry it, bro. ",
      "Mayor: Hmmm... I don't know. I mean, that's such a generous offer. ",
      "Ace: Oh, come on. It's no trouble, really.",
      "Snake: By the way, dude, that's a really nice pair of boots-s-s-s. We can take those too. ",
      "Mayor: Oh, gee, you shouldn't. ",
      "Ace: And the hat. And the vest. And the shirt. And the pants. And the corset, lose it.",
      "Ace: And the belt... and the socks... and the badge.",
      "Ace: No, no, no, no. On second thought, you might need it. Adis! ",
      "Snake: Yeah! Um... huevos rancheros!",
      "Mayor: Ahh, such nice men.",
      "Yokel: Look!",

      "Yokel: It's Mojo the Kid! ",
      "Governor: No foolin', numbskull!",
      "Man in trough: Looky!",
      "Governor: Why, it's them po-pi-per-pu-Steamypuff Girls!  There's gonna be a showdown.",
      "Governor: SHUT UP!!",
      "Buttercup: Enough of this stupid suspense! Let's get on with this fight!",
      "Blossom: Wait. We gotta do this right. We need someone to count for us.",
      "Yokel: All right, all right. I'm countin'. One... uh, B... Abraham, W... ",
      "Governor: I thought you said you gradjiated!",
      "Yokel: I did gradjiated-from kindergarten.",
      "Mojo: The counting won't be necessary, for Mojo the Kid is the fastest draw in the West!",
      "Blossom: Look out! He's gonna draw!",
      "Prospector: The chariot's come to take me home...",
      "Professor: Criminy!",
      "Bubbles: Buttercup!",
      "Blossom: Bubbles!",
      "Blossom: NOOOOOOOO!! ",
      "Mojo: Yes, Steamypuff Girls. You are no match for Mojo the Kid!",
      "Narrator: Oh, no! It looks like Townsville is now Mojoville!",
      "Mojo: Mojoville? I like the sound of that!",
      "Mojo: Yes, as I was saying... welcome to Mojoville!",
      "Mojo: Yes, Steamypuff Girls. There's a new Sheriff, Dentist, Blacksmith, Window Maker in Mojoville-  -and his mane is Mojo the Kid!",
      "Mojo: Or Sheriff the Kid. Or something like that.",
      "Professor: Oh, not quite yet, Mr. Kid.",
      "Professor: Thanks to my latest invention. Dually Undercoated Concentric Tear-Strip.",
      "Governor, yokel, lummox: What's that mean?",
      "Professor: Oh, just another fancy word for duct tape.",
      "Mojo: What?!?",
      "Mojo: NOOOOOOOO!!",
      "Bubbles: And stay outta Townsville, you hear?",
      "Governor: Why, you Steamypuff Girls is the greatest!  The way you zip-bang-a-boom-bam and-a whup-zinga that Mojo high up in that jailhouse and-  -what in Sam's Hill?!?",
      "Mayor: Hello, everybody! Go ahead, call me a fool, but there I was out in the desert, and these five guys took everything I own! And then, long after they're gone, it occurs to me. I never asked Mojo the Kid when he wanted me to come back!",
      "Mayor: So's I came back to ask. ",
      "Governor: How... how did he get so STUPID?!? ",
      "Yokel: 'S all right, Paw. 'S all right.",
      "Blossom: Five guys out in the desert, huh? Come on, girls. We got some Gang Verde to take care of!",
      "Narrator: And so once upon a time, the West was saved-by the Steamypuff Gals!"
    ]
  },
  {
    "episode": "What's the Big Idea?",
    "dialog": [
      "Mojo Jojo: The city of Townsville...",
      "Bubbles: Hey! Watch it, Mr. Clumsy! You're always crushing my dolls with your big mitts.",
      "Blossom: Look who's talking, Bubble-fingers. You keep knocking over my buildings. You should be more careful like me.",
      "Buttercup: Ha! You're the worst! You're so busy being careful you don't notice your big good-nothing buildings under my traffic jams.",
      "Blossom: Oh yeah?",

      "Girls: Hey! What's the big idea?!",
      "Mojo Jojo: Exactly! ",
      "Girls: Zoinks!",
      "Mojo Jojo: This is the big idea! My newest evil plan, etcetera, etcetera. Uh, Bubbles, could you scooch over a bit?",
      "Bubbles: Huh? Oh, sure!",

      "Mojo Jojo: Thank you.",
      "Bubbles: You're welcome.",
      "Mojo Jojo: Much obliged.",
      "Bubbles: Certainly.",
      "Buttercup: Cut it out!",
      "Blossom: What are you up to, Mojo?",
      "Blossom: You idiot. LOOK AT US, WE'RE HUGE! We'll crush you.",
      "Mojo Jojo: Okey-Dokey.",
      "Blossom: We're serious. We'll do it.",
      "Mojo Jojo: I'm waiting.",
      "Blossom: OK, then.",

      "Blossom: Hey, stand still.",
      "Bubbles: Yeah, no fair. Stop moving, you.",
      "Blossom: Wait. I'll get him.",

      "Blossom: Hold it right there and let me get you.",

      "Man: You ruined everything with your big heads. No one likes you anymore. Go home.",
      "Mojo Jojo: Well, the viewers has spoken.",
      "Bubbles: Well, then, we'll just be more careful. Tip-toe attack.",
      "Man: Tip-toe is our foe! Tip-toe is our foe!",
      "Bubbles: We've just wanted to help.",
      "People of Townsville: Ahh! Run away! Run away! Ahhh!",

      "Blossom: Bubbles! Careful! Seriously!",
      "Bubbles: Sorry!",
      "Man: Oh, come on! I just had it clean!",
      "Mojo Jojo: You see, there's nothing you do to stop me now without ruining the city. My influence will spread through Townsville unencumbered.",
      "Blossom: He's right. At this size, it's too difficult to fight him.",
      "Mojo Jojo: That's correct. I'm off to being my shopping from crimes.",
      "The Viewers: Far too big! You break the city! Far too big! You break the city! Far too big! You break the city! Far too big! You break the city!",
      "Blossom: It looks like we need the Professor's help.",
      "Buttercup: Let's go.",

      "Buttercup: HEY PROFESSOR!!!",
      "Professor Utonium: Girls! Girls! Is something wrong?",
      "Blossom: Professor, Mojo used a device to make us giants.",
      "Buttercup: And we can't stop him without destroying the city.",
      "Bubbles: Help us!",
      "Professor Utonium: If I had his device, perhaps I can reverse/engineer it!",
      "Blossom: I thought you might so I snatched it up but I accidentally stepped on it.",
      "Professor Utonium: I will do my best. In the meantime, do what you can to stop Mojo.",
      "Girls: GOOD IDEA!!!",
      "Professor Utonium: Carefully!",
      "Blossom: Right. Sorry.",

      "Blossom: OK, here's the plan: we split up. Buttercup, you search west. Bubbles, search east. I'll take north. Whatever finds him, call the others. Go.",
      "Bubbles: He's so tiny. We'll never find and catch him.",
      "Professor Utonium: Girls, I fixed it. I think.",
      "Girls: Hurry, Professor! We have a quarter!",
      "Professor Utonium: Well, there goes nothing. etcetera ",
      "Mojo Jojo: Urgh! Foiled again, but just how did they get small again? My machine doesn't work in reverse.",
      "Narrator: Woah... You know an episode likes this makes you realize how small and insignificant and... puny you are. Oh well!",
      "Narrator: Once again, the day is saved thanks to the Powerpuff Girls! Don't step on me, DON'T STEP ON ME!!"
    ]
  },
  
  {
    "episode": "You Snooze, You Lose",
    "dialog": [
      "Narrator: The city of Townsville... has brushed its teeth and tucked itself into the warm blanket of night. But as the city dreams...",
      "Narrator: a monkey schemes.",
      "Mojo: Yes... Yes... Yes! Yes!  No.",
      "Mojo: Something's amiss. Let's see...",
      "Mojo: Girls stand on X... get sucked up to platform, where I sit poised with a laser gun. I activate the beam and the girls...",
      "Mojo: fly away. That's where this otherwise brilliant plan falls apart! I must find a way to keep them from flying away! Hmmm... Ooh! How about flypaper?  No! That's stupid!  No.",
      "Mojo: Now, let's see... no... no...",
      "Mojo: By gum! I've got it!",
      "Mojo: Oh yeah, oh yeah, ooooh, that's it!  Ha-ha! Perfect!",
      "Mojo: Now I'll just keep you safe in here-  -until tomorrow when I shall unleash...",
      "Mojo: ... 'Mojo Jojo's Best Plan to Destroy the Powerpuff Girls Ever!'",

      "Narrator: Oh, look. It's the Amoeba Boys, Townsville's most pathetic criminals ever. They couldn't commit a crime even if it smacked 'em in the face.",
      "Bossman: Hey! Hmmm...",
      "Bossman: 'Mojo Jojo's Best Plan to Destroy the Powerpuff Girls Ever!' ",
      "Junior: Duh-what is it, Boss?",
      "Bossman: I... have no idea.",
      "Slim: Duh... uh... uh... maybe we, uh... should, uh... open it?",
      "Boys: Wooooowww...",
      "Bossman: I knew it! Just a bunch of fancy words and numbers. Phooey! ",
      "Buttercup: Hey!",
      "Buttercup: Amoeba Boys! Better watch where you're throwing your trash, or I'll- ",
      "Blossom: Wait!  Let me see that.",
      "Blossom: Oh, boy! You know what this is? It's a scavenger hunt list! ",
      "Bubbles: A scavenger hunt?  How terrible! I don't believe in hunting scavengers. ",
      "Buttercup: No, Bubbles! A scavenger hunt is when you dig up stuff nobody wants. ",
      "Bubbles: I know.",
      "Blossom: So you guys must be on a scavenger hunt, right?",
      "Bossman: Duh... ",
      "Blossom: Great! We'll help!  Now, the first thing we have to find is...",
      "Mojo: I can't find it! Where is it? I just had it!",
      "Mojo: Oh, where, oh, where can my perfect plan be?!",
      "Blossom: Hmm. Okay... chewing gum. Anybody have any chewing gum?",
      "Junior: I do.",
      "Blossom: Great.",
      "Bubbles: Now we need paper clips. Where can we find paper clips?",
      "Bubbles: Uh... thanks.",
      "Buttercup: A flashlight?",
      "Blossom: A basketball?",
      "Bubbles: A bathtub?",
      "Blossom: A magnet?",
      "Buttercup: A crustacean?",
      "Blossom: Oh, well. ",
      "Bubbles: I'll get the bathtub!",
      "Blossom: I'll get the magnet!",
      "Buttercup: I'll get the crustacean! ",
      "Mojo: I'll get to the bottom of this!",
      "Mojo: Nope, not in there... nope, not in there... nope, not in there...",
      "Blossom: Gosh, we're sorry, Amoeba Boys. We didn't know you were under there.",
      "Bubbles: Are you okay?",
      "Bossman: Yeah. We're...",
      "Bossman: in a lot of pain. ",
      "Buttercup: Come on, guys, quit laying around and let me see the list.",
      "Buttercup: Hey! You know what? I think we've got everything.",
      "Bubbles: Hooray! We hunted the scavenger. ",
      "Buttercup: Great. Can we go?",
      "Blossom: No, wait! There's instructions here. Know what?  I think we're supposed to put all this stuff together. Is that right, Amoeba Boys? We're supposed to build it?",
      "Boys: Duh...",
      "Blossom: Great! Let's get started, girls.",
      "Bubbles: Ooh! It's...",
      "Blossom: Not finished.",
      "Buttercup: Yeah. The high-tech laser is missing. ",
      "Blossom: But who has a high-tech laser?",
      "Mojo: I know who took my plans!",
      "Mojo: It was you!",
      "Mojo: Well, then... it was you!",
      "Mojo: It was all of you!",
      "Mojo: Ohh, the pounding, the pounding! Why won't it stop?",
      "Buttercup: Why-won't-this-guy-answer?! ",
      "Mojo: WHAAAATTTT?!?",
      "Bubbles: Hello!  Please, Mr. Mojo, sir, could we please borrow your supercharged high-tech laser, please? ",
      "Mojo: Okay, okay. Just don't bother me again. I'm trying to find my plans on how to destroy you.",
      "Girls: Thank you, Mojo! ",
      "Girls: Ahhh...",
      "Bubbles: Will you look at that?",
      "Buttercup: Yeah... What is it?",
      "Blossom: It looks like some sort of ride. Is that right, Boys? Is it a ride? ",
      "Bossman: Duh...",
      "Blossom: Come on, girls. This looks like fun! ",
      "Blossom: Amoeba Boys! Now, what do we do?",
      "Bossman: Duh...",
      "Buttercup: Read the instructions! ",
      "Bossman: Duh... Oh! Go get the bathtub.",
      "Blossom: No, no, no, we did that already! How do we start the ride?",
      "Bossman: Duh... Push the red button! ",
      "Blossom: Okay!",
      "Girls: Amoeba Boys!",
      "Bossman: What?",
      "Girls: Push the button!",
      "Bossman: Oh.",
      "Girls: Ewwww!  Whee!",
      "Buttercup: Wow!",
      "Bubbles: That was fun!",
      "Blossom: Yeah, Amoeba Boys, that was great!",
      "Blossom: Oh, no! That laser is coming right toward us! This is no ride-this is a Powerpuff destruction machine!",
      "Girls: HELP!  HELP!",
      "Girls: HELP! HELP! HELP!",
      "Mojo: What's all that racket?",
      "Mojo: MY MACHINE!!",
      "Junior: Duh-hey, look, Boss! I'm drivin'! ",
      "Mojo: Get out of here! This ismymachine!",
      "Mojo: NowI'vegot you, Powerpuff Girls!  And it ismyplan that will destroy you! And thenIwill rule the world!",
      "Buttercup: Mojo, you creep!",
      "Blossom: This is the Amoebas' plan!",
      "Bubbles: Yeah! You're just jealous! ",
      "Mojo: No! No! It is mine, I tell you! I came up with the crab! And the laser! And even the chewing gum that holds you!",
      "Girls: Chewing gum?! ",
      "Blossom: Girls! 'Chew' thinking what I'm thinking?",
      "Bubbles, Buttercup: Mmm-hmm!",
      "Blossom: Well, Amoeba Boys, playing dumb all these years.",
      "Bubbles: When all the while you were criminal masterminds!",
      "Buttercup: Looks like it's the big house for you!",
      "Mojo: But it is I who planned it! I did it, not them! I am the criminal mastermind! I am the evil genius! I smart! They dumb!",
      "Mojo: Iam responsible for trying to destroy you! ",
      "Blossom: Okay. Thenyougo to jail. ",
      "Mojo: That's right!",
      "Narrator: So once again the day is saved-thanks to the Powerpuff Girls!"
    ]
  },

  {
    "episode": "Boogie Frights",
    "dialog": [
      "Narrator: The city of Townsville. And like most cities, Townsville prepares its young for bed as evening approaches.",

      "Narrator: The same is true in the home of the Powerpuff Girls.",

      "Buttercup: Man, Im not ready for bed yet!",

      "Blossom: Now, girls, you know we need to get plenty of sleep. Its our responsibility as superheroines to be well-rested so that well be at peak crime-fighting performance whenever evil rears its ugly head.",

      "Blossom: And, like Ben Franklin always said Early to bed, early to wake, makes a lady smart, pretty, and great.",

      "Buttercup: Yeah, yeah but all the fun stuff happens at night. Parties, dancing, nightclubs and stuff. Girl, itll be awesome once were old enough to go out after dark. Right, Bubbles?",

      "Bubbles: Uh no.",

      "Buttercup: What do you mean, 'no'?",
      "Bubbles: I dont know.",
      "Buttercup: Youre not afraid of the dark, are you?",
      "Bubbles: No.",
      "Buttercup: You aint scared of monsters under the bed, are you?",

      "Bubbles: No.",

      "Buttercup: Well, then. I guess you wouldnt be afraid of the Boogie Man, either.",
      "Blossom, Bubbles: Who?",

      "Buttercup: Boogie Man! The creepiest, scariest, nastiest, long-finger-and-pointy-teeth-havingest, little-kid-gettingest monster in the WORLD! But dont worry. He only comes out",

      "Buttercup: after dark!",

      "Professor: Wha?!",

      "Professor: Whoa!",

      "Blossom, Bubbles: ITS THE BOOGIE MAN!!",
      "Professor: What? Boogie Man? Whats going on in here?!",

      "Professor: Buttercupare you teasing your sisters again?!",

      "Blossom: Yes.",
      "Professor: Okay, Bubbles, calm down. Everythings all right now.",
      "Blossom: Professor, I was trying to sleep, but Bubbles was afraid of the dark, andand Buttercup was telling scary stories, and then",
      "Professor: Yes, Blossom, I know. Buttercup likes to be an instigator.",
      "Bubbles: A what?",
      "Blossom: That means she was trying to get your goat.",
      "Bubbles: No!",
      "Buttercup: Well, its not my fault shes a baby scared of the dark.",
      "Bubbles: Im sorry. I wish I were brave.",
      "Professor: Now, girls, being scared doesnt make you a baby. I was scared when I heard my girls screaming. But did I hide under the covers?",
      "Blossom: No. You ran in to check on us very brave-like.",
      "Professor: Thank you, Blossom. You see, bravery doesnt mean youre not scared. Bravery is doing what youre afraid to do. If you can just face your fears, then I know you can find the courage to beat em.",

      "Professor: Now, then, everyone, into bed. Its time for sleeping.",

      "Professor: And no more monkey business!",

      "Bubbles: But",

      "Professor: Dont worry, Bubbles, the hall light will take care of any Boogie Men that might show up.",

      "Narrator: Ahh, thats better. Now that things have quieted down",

      "Narrator: we can all get some Say, do you hear something?",

      "Narrator: Some kind of crazy beat?",

      "Narrator: Who could still be awake at this time of night?",

      "Boogie Man: just slip in the last piece, and Jerome.",

      "Boogie Man: Lets get this party started.",

      "Jerome: Listen up, all you freaks and disasters, and chill the frag out! Cause here comes the master! So give it up for the beast with the plan! The one, the only, B-B-B-Boogie Man!",

      "Boogie Man: Creatures of darkness... DIG IT! Too long have we been at the mercy of light. Night lights, streetlights, hall lights with the door cracked. And deeper still... the sun. I know, I know. But I, your Boogie Man, have just completed Step One of my grand master plan that will ensure an end to this problem once and for all. So prepare to hit the streetscause we are gonna party ALL NIGHT LONG!",

      "Boogie Man: So tell me. When things get creepy",

      "Crowd: Blame it on the boogie!",
      "Boogie Man: When things get spooky",
      "Crowd: Blame it on the boogie!",
      "Boogie Man: And when things get freaky, funky, and nasty",
      "Crowd: BLAME IT ON THE BOOGIE!",

      "Boogie Man: Get Scissors on the horn.",

      "Narrator: Uh-oh! Whats he got cooking at the Townsville Power Plant?",

      "Scissors: Yeah, Boss?",

      "Boogie Man: Proceed with Step Two.",

      "Narrator: Oh, my gosh! Theyve cut off all power to Townsville! That means no more streetlights, no more hall lights with the door cracked, and definitely no more nightlights!",

      "Monster #1: Heh, heh, heh! The coast is clear. Come on!",

      "Slug: Fashionably late again, I see! So fashionable you missed the party!",

      "Slug: Baby, the suns already rising! Were gonna have to blow this joint!",

      "Bartender: LAST CALL!",

      "Jerome: Lets wrap it up, people. The suns coming up!",
      "Boogie Man: Oh, now, hold up. Did you-all forget about my grand master plan? The sun will no longer be an issue once I initiate the Third and Final Step.",
      "Slug: Is Step Three really all that?",
      "Boogie Man: Shee! It aint no step for a stepper.",
      "Narrator: Uh-oh! Whats happening at the old abandoned roller rink?",

      "Narrator: Hes launched some kind of missile!",

      "Narrator: Its a giant disco ball!",
      "Narrator: And its eclipsing the sun! Oh, no! Now morning will never come to Townsville...",

      "Narrator: ... and these nocturnal nightmares will be free to haunt the darkness forever!",

      "Crowd: BLAME IT ON THE BOOGIE!",

      "Mayors wife: Honey, what is it?",

      "Blossom: I CANT GET ANY SLEEP with all that racket out there! Something funkys going on downtown.",

      "Buttercup: Ill say! We better check it out!",
      "Blossom: Yeah. It might be trouble.",

      "Bubbles: Wait for me!",

      "Blossom: Oh, my gosh! Townsvilles been turned into a nightmare nightclub!",

      "Buttercup: Right on! Right, Bubbles?",
      "Bubbles: Well, its got a good beat, and I can dance to it.",
      "Buttercup:  Hey! ",

      "Bubbles: Hey, you got scared!",

      "Cat: Yeah, little girl. I thought you liked to party.",

      "Buttercup: Lets get down!",

      "Blossom, Bubbles: Buttercup!",

      "Narrator: Oh, no! The girls are getting swamped!",

      "Blossom: Theres too many of them.",

      "Bubbles: We cant take them all.",
      "Buttercup: We need a plan, leader girl.",

      "Boogie Man: Well, well, well. Its the Powerpuff Girls crashing my party.",

      "Bubbles: Its the Boogie Man!",

      "Blossom: So its you whos been terrorizing Townsville and keeping us awake!",
      "Boogie Man: Aww, Im sorry, did I wake you? Hee, hee! Dont expect to sleep anytime soon, because now that Ive blocked out the accursed sun,   Were gonna make this night last forever! ",
      "Blossom: Block out the sun? Thats it. Come on, girls. Weve gotta take out that disco ball!",

      "Boogie Man: WHAT?! NO! THEY CANT!!",

      "Boogie Man: Ill do it myself.",

      "Blossom: Accelerate to attack formation and follow me in.",

      "Blossom: I can see a small exhaust port at the end of the chasm. If we could just hit it with our laser vision, it should destroy the ball.",

      "Bubbles: Aah! The Boogie Mans on our tail!",

      "Buttercup: Whoa! Look out!",

      "Bubbles: Buttercup! Blossom! Oh, no! I-- I cant do it alone!",

      "Professor: Bubbles, if you can just face your fears, then I know you can find the courage to beat them.",

      "Boogie Man: Youre feisty, little one!",

      "Boogie Man: Ha! Now youre mine!",

      "Boogie Man: Huh?",

      "Blossom, Buttercup: Wahoo!",

      "Buttercup: Youre good to go, kid.",

      "Blossom: Now blow up that disco ball so we can go back to bed.",

      "Crowd of Monsters: OH, NO!!",

      "Narrator: Oh, yes! The sun is free to shine on Townsville again. Sorry, nightmares. Partys over. And dont let the doorknob hit you where the dog should have bit you.",

      "Narrator: And once again, the day is saved.",

      "Narrator: Get it? The day is saved? You dont get it. Because it was gonna be perpetual night! You know, the daylight. They saved the day, literally! Ha, ha, ha!",

      "Blossom: Shh!",

      "Narrator: Oh, sorry. Thanks to the Powerpuff Girls. Good night, everybody."
    ]
  },

  {
    "episode": "Abracadaver",
    "dialog": [
      "Narrator: The city of Townsville! A magical town full of wonder and excitement.",

      "Narrator: And heyspeakin' of magic, whats going on at the old Townsville Magic Theatre? Lets take a look.",

      "Mayor: What a wonderful day for a celebration. Girls, have I ever told you the story of this old theatre?",

      "Ms. Bellum: Just say yes.",

      "Girls: No.",

      "Mayor: Well, splendid. This theatre is the most historic site in all of Townsville. Why I used to see shows here when I was your age.",

      "Mayor: Huh? Whats this? A theatre poster from the final performance of Al Lusion, the greatest magician of all time!",

      "Mayor: I oughta know. I was there.",

      "Mayor: That night, he performed the most incredible feats ever seen. It was a spectacular show.",

      "Mayor: Then he asked for an assistant from the audience.",

      "Mayor: I raised my hand, but he chose another. He chose a little girl.",

      "Mayor: A charming creature as sweet as any of you Powerpuff Girls. Once onstage, he asked to borrow the girls stuffed bear.",

      "Mayor: And he instantly made it vanish right before her eyes.",

      "Mayor: Heartbroken without her bear",

      "Mayor: she revealed him to be nothing more than a sham.",

      "Mayor: Oh, we all laughed at the big phony!",

      "Mayor: But our laughter quickly turned to tears",

      "Mayor: as the magic was silenced forever.",

      "Mayor: Poor old Al Lusion. Poor old theatre.",

      "Mayor: Oh, well, let the festivities begin!",

      "Mayor: Yes!Yes! Smash it! Smash it!Boom! Boom!Pow! Pow!Smash it, smash it, smash it!",

      "Blossom: What was that?",

      "Bubbles: I think it... it was a zombie!",

      "Buttercup: Cut it out, Bubbles. Theres no such thing as zombies.",

      "Woman: A zombie!",

      "Narrator: Oh, no! Its Al Lusion! Hes returned from beyond the grave as Abracadaver, the magical zombie!",

      "Abracadaver: You laughed at me..but now, revenge!",

      "Mayor: Hmm. Thats peculiar. Uh, Ms. Bellum, do you see this saw I see?",

      "Ms. Bellum: Yes, but cant you see that all of Townsville is under attack?",

      "Mayor: I think my hats under attack! Call the haberdasher! Oh, and the Powerpuff Girls.",

      "Blossom: H-H-Hello?",

      "Mayor: Blossom! You girls have to help at once!",

      "Blossom: W-W-W-Why? What is it, Mayor?",

      "Mayor: My favorite hats been ruined, and, uh oh, yeah, Townsvilles under attack by an evil demented zombie magician.",

      "Blossom: WHAT?! An evil demented zombie?!",

      "Buttercup: No way! Im not going!",

      "Bubbles: Me neither.",

      "Blossom: I know its scary, butwe have to.",

      "Blossom: All clear. Lets go.",

      "Narrator: B-B-Be careful, girls. Abracadaver has some evil tricks up his sleeve!",

      "Buttercup: Look! There he is!",

      "Buttercup: Go on. Go on.",

      "Blossom: Oh... um... excuse me, Mr. Zombie, sir.",

      "Abracadaver: Wha?",

      "Blossom: Could you stop destroying Townsville with your evil zombie magic?",

      "Bubbles, Buttercup: Please?",

      "Abracadaver: You! Youre that girl! Girl with bear!",

      "Blossom: Huh?",

      "Abracadaver: You ruined Al Lusion! You make them laugh at me, but now, revenge!",

      "Buttercup: You put her down!",

      "Abracadaver: Huh?",

      "Buttercup: Sorry to break up the act.",

      "Bubbles: Buttercup! Look!",

      "Buttercup: Huh?",

      "Bubbles: It wont stop!",

      "Buttercup: Uh-oh!",

      "Abracadaver: You hit me!",

      "Abracadaver: And now, my assistant time for grand finale!",

      "Abracadaver: Now you meet your doom!",

      "Narrator: Oh, no! Right before our very eyes the magic of the Powerpuff Girls vanished forever! Now Townsville is at the mercy of that evil magician Abracahuh!",

      "Blossom: Ta-da!",

      "Narrator: Blossom?!",

      "Crowd: Yaaay!",

      "Girls: Ta-da!",

      "Crowd: Yaaay!",

      "Mayor: But, girls! How did you do it?!",

      "Girls: Its magic, silly!",

      "Narrator: How Who When But Whos in the",

      "Narrator: Oh, girls! I love that voodoo that you do!",

      "Narrator: So once again the day is savedthanks to the Powerpuff Girls!"
    ]
  },
  {
    "episode": "Telephonies",
    "dialog": [
      "Narrator: The city of Townsville! And what a beautiful city she is, full of... Oh. Excuse me. Uh... hello?",

      "Ace: Yeah, listen, jerk-face, you good-for-nothin' toad!",

      "Narrator: You can't talk to me like that!",

      "Ace: How 'bout this? I think you stink! I can smell you over the phone!",

      "Narrator: Why I oughta... WHO IS THIS?! Hello? Hello! Oh. The Gangreen Gang. Why, you crank-calling good-for-nothings! When I get my hands on you, I'll...",

      "Ace: What a dope!",

      "Snake: Yeah. What a dope.",

      "Lil Arturo: Hey, Ace! Ace! Do another one, huh?",

      "Snake: Yes-s-s, yes-s-s. Do another one.",

      "Ace: All right, all right. Let's see.",

      "Maitre d': Caf de Paris.",

      "Ace: Yeah, listen, do you have frogs' legs?",

      "Maitre d': But of course.",

      "Ace: What, do you hop to work, then? Jerk! Okay, Arturo, you're up.",

      "Big Billy: Awww...",

      "Lil Arturo: Okay! Shh, Shh! It's ringing!",

      "Professor: Hello?",

      "Lil Arturo: Hi, am I speaking to the man of the house?",

      "Professor: Yes, by golly, you are.",

      "Lil Arturo: Well, then... you just won ten million dollars!",

      "Professor: Te-ten million d-ten million dollars?! Oh, wow! I've never won anything in my life!",

      "Lil Arturo: Please hold.",

      "Professor: Sure, I'll hold.",

      "Ace: Okay! Who's next?",

      "Lil Arturo, Snake: Aww, jeepers!",

      "Housewife: Hello?",

      "Big Billy: Hi.",

      "Housewife: Who is this?",

      "Big Billy: Billy.",

      "Housewife: Billy who?",

      "Big Billy: Big Billy.",

      "Housewife: Hey, is this some kind of crank call?",

      "Big Billy: Yes.",

      "Housewife: Well, it's not a very good one.",

      "Big Billy: I'm sorry.",

      "Ace: Aw, come on, gimme that! Uh... Prince Albert, the fridge! That was pathetic!",

      "Lil Arturo: We're sorry, Ace! We can be funnier!",

      "Ace: Nah, it ain't the jokes, it's the pranks. They're too small-time. We're the Gangreen Gang, for cryin' out loud! We need somethin' big. Somethin' this whole city will never forget! Boys...I think I got it!",

      "Mayor: Hello? Oh! Ms. Bellum!... You need me to leave the office?",

      "Grubber: Sir, we need you to cut the ribbon at the new mini-mall. Hurry, Mayor. The crowd is getting restless!",

      "Rest of the Gang: We want a shop! We want a shop!",

      "Grubber: Hurry!",

      "Ace: Let's go!",

      "Ace, Snake, Arturo, Billy: Ooooh!",

      "Blossom: Very strange.",

      "Buttercup: He's just standing there!",

      "Bubbles: Should we see if he's okay?",

      "Blossom: An emergency! The Professor will have to wait. Hello? What's the trouble, Mayor?... Mojo Jojo is at it again?",

      "Grubber: Hurry!",

      "Mojo: Wha...?",

      "Mojo: What is the meaning of...",

      "Blossom: Don't play dumb. We know you've got some evil plot underway!",

      "Mojo: What are you talking about?!",

      "Buttercup: Oh, like you don't have a giant robot ready to smash Townsville!",

      "Mojo: No.",

      "Blossom: No diabolical plans to destroy the world?",

      "Mojo: No.",

      "Bubbles: Turn everyone into zombies and you scare people!",

      "Mojo: Oh, for crying out loud. No! I had no intention of committing any crimes! Today.",

      "Blossom: Then what were you doing before we got here?",

      "Mojo: Sleeping!",

      "Buttercup: Before that!",

      "Mojo: Reading the paper!",

      "Blossom: Oh. Well... you better behave yourself, or we'll be back!",

      "Mojo: Oh, goodness. I'd better not snore!",

      "Blossom: How embarrassing.",

      "Girls: Huh?",

      "Blossom: Professor, what are you...",

      "Girls: The hotline!",

      "Blossom: Hello? Fuzzy Lumpkins has gone plumb crazy? Are you sure?... We're on our way!",

      "Blossom: Okay, Fuzzy. Prepare to get stomped!",

      "Buttercup: This is for anything you broke!",

      "Blossom: This is for anyone you hurt!",

      "Bubbles: And this is for taking a bath!",

      "Buttercup: Uh-oh. I think maybe he was just taking a bath.",

      "Bubbles: Fuzzy...?",

      "Blossom: Um... we didn't mean to...",

      "Blossom: I guess you weren't going crazy. You were just taking a bath.",

      "Buttercup: Strike two for the Mayor!",

      "Blossom: Yeah. First Mojo's innocent, then Fuzzy Lumpkins is clean. What's next?",

      "Blossom: Hello, Mayor. Are you sure?... Really?... Really?... Really?... Oh... Okay, we're on it.",

      "Buttercup: Is he pulling our leg again?",

      "Blossom: No. This time it's serious. It's... Him!",

      "Bubbles: You mean the evilest of evil?",

      "Buttercup: The cruelest of cruel?",

      "Blossom: The Mayor wouldn't joke about this one. Come on! Let's go!",

      "Instructor: Here we go, ladies! And squat... and up... and squat... and up.",

      "Instructor: And squat... and up. Okay, legs up, two, three... arms out... and reach...",

      "Instructor: Kick your legs all the way around...",

      "Him: Hello, girls. What a pleasant surprise! Ooh, what's the occasion?",

      "Blossom: Uh... we were wondering...",

      "Him: How I stay so fit? Well, now you know.",

      "Blossom: Uh, no, actually, did you do anything... evil today?",

      "Him: No, not today. Why do you ask?",

      "Blossom: No reason, just wondering.",

      "Him This figure doesn't come easy, you know. I took a little time off to get into shape.",

      "Blossom: So... you haven't been...",

      "Him: Nope.",

      "Blossom: Okay, I guess we'll see you later.",

      "Him: I guess you will.",

      "Blossom: Okay. Bye, then.",

      "Him: Goodbye, girls. Come back soon.",

      "Him: Goodbye...",

      "Mojo: All right, all right, Fuzzy, I heard you the first time...I know. I kn - hold on, Fuzzy. There's someone on the other line.",

      "Him: Mojo! It's me... ... Him.",

      "Mojo: Yes, sir! What is it?",

      "Him: You won't believe what just happened!",

      "Mojo: The Powerpuff Girls just broke in unexpected?",

      "Him: What?! How did you know?!",

      "Mojo: The same thing happened to me and Fuzzy Lumpkins. He's on the other line.",

      "Him: Well, put him on!",

      "Fuzzy: Bushwhacked in my birthday suit!",

      "Him: This is an outrage!",

      "Mojo: You are right. We're all citizens. Evil citizens, but citizens nonetheless.",

      "Fuzzy: Birthday suit!",

      "Him: We should complain!",

      "Mojo: But to who?",

      "Big Billy: Hello?",

      "Him: I demand to speak with the Mayor!",

      "Big Billy: Uh, he's not here right now. Can I take a massage?",

      "Him: Do you know when he'll be back?!",

      "Big Billy: Uh...I don't know. See, Grubber tricked the Mayor into leaving so we could break in and use the Powerpuff hotline to make crank calls.",

      "Him: Huh?! You don't say. Well, to whom might I be speaking?",

      "Big Billy: Uh, this is Billy.",

      "Him: Billy who?",

      "Big Billy: Big Billy from the Gangreen Gang. Who is this? Hello?",

      "Him: So... you guys like to make crank calls!?",

      "Mayor: Oh, of all the foolishness. Cut the ribbon, pshaw! Oh, my!",

      "Blossom: Hello?",

      "Mayor: Powerpuff Girls! You're not gonna believe this! The Gangreen Gang, Mojo Jojo, Fuzzy Lumpkins, and Him are fighting right here in my office!",

      "Blossom: Yeah, right, Mayor. Very funny.",

      "Girls: Good night, Professor!",

      "Narrator: So once again the day is saved...",

      "Narrator: thanks to Mojo... Fuzzy... and Him?"
    ]
  },
  {
    "episode": "Tough Love",
    "dialog": [
      "Narrator: The city of Townsville. The city of brotherly love. Or should I say, sisterly love? Love for those devout doers of dangerous deeds and dutifuluh, things. The Powerpuff Girls!",

      "Narrator: Those little scamps are so adorable. How we just love the Powerpuff Girls!",

      "'Him': Ohh, how I HATE the Powerpuff Girls!",

      "Narrator: Hate the Powerpuff Girls?! Who could hate the Oh, no. Please dont let it be 'Him'!",

      "'Him': Oh, Powerpuff Girls, save us! Oh, Powerpuff Girls, we need you! Oh, Powerpuff Girls, we love you!",

      "'Him': Powerpuff Girls! Powerpuff Girls! POWERPUFF GIRLS!!!",

      "'Him': Oh, Mr. Quackers, am I the only one who HATES those miserable little brats, hmm? You hate them too? Oh, I knew I could count on you. But how could I possibly beat them with all that LOVE surrounding them?",

      "'Him': Whats that, you say? Yes! Thats brilliant!",

      "'Him': Oh, Mr. Quackers, you are soooo smart. Quite a positively evil scheme youve hatched. And Ill finally get rid of those girls",

      "'Him': FOREVER!!!",

      "'Him': Poor, unsuspecting Townsville, all snug in your beds. Unaware of the evil that takes place high above your heads.",

      "'Him': And so with a flick of my wrist and a twirl of my claw Ill get rid of those girls once and for all!",

      "Bubbles: Hey, look. That cute little kitty is stuck in the tree again.",

      "Blossom: Come on. Lets help out.",

      "Bubbles: Hello, kitty. Its Bubbles here to save you again.",

      "Bubbles: Hey! Whats gotten into that cat?",

      "Old woman: I said, get your hands off of me!",

      "Blossom: But, lady, were trying to help you get your cat out of the tree.",

      "Old woman: I said, get!",

      "Bubbles: Ow, ow, ow, ow, ow, ow!",

      "Old woman: Land sakes, take your paws off of my cat!",

      "Buttercup: What the heck is going on?",

      "Blossom: Saved by the school bell. Lets beat it!",

      "Teacher: Well, well, well, the Powerpuff Girls tardy!",

      "Blossom: What?",

      "Bubbles: Huh?",

      "Buttercup: No way!",

      "Kid: Ha-ha!",

      "Bubbles: Hey! Ms. Keane! Billy threw a paper ball at me.",

      "Teacher: Billy Lipowitz! Throwing paper just wont do. You should try apples. Theyre much harder.",

      "Girls: Hey!",

      "Ms. Keane: Class, please join me.",

      "Blossom: Ive heard of class struggles, but this is ridiculous!",

      "Blossom: Its the Mayor! Lets get outta here!",

      "Blossom: Mayor, we got here as soon as we could. Whats the problem?",

      "Blossom: Oh... the pickle jar again. Dont worry, Mayor. Well have that jar open in a jiffy.",

      "Mayor: Hey! Unwield my pickles, you fiend! Why thats grounds for immediate incarceration! Get em, boys!",

      "Mayor: Ms. Bellum, would you care to go first?",

      "Ms. Bellum: It would be my pleasure.",

      "Blossom: Um... wed love to stay and hang out with you guys, but, uh II think I hear the Professor calling.",

      "Buttercup: Yeah, some other time.",

      "Bubbles: Maybe we can have tea.",

      "Buttercup: Wow! This has turned out to be one freaky day.",

      "Bubbles: Yeah. Something strange is going on.",

      "Narrator: Aw, for cryin out loud, would you three shut up for once?! Always griping and moaning about something! Sheesh, you give me a headache!",

      "Blossom: Lets go see the Professor. Maybe he has some answers.",

      "Blossom: Professor! Something odd is happening around Townsville, and we need your he",

      "Professor: How many times have I told you girls not to come barging in like that? ITS NOT NICE!",

      "Blossom: Whoa!",

      "Professor: Now come here, girls.",

      "Blossom: Quick! Out the front door!",

      "Professor: Destroy Powerpuff Girls!",

      "Mob: We must destroy Powerpuff Girls!",

      "Buttercup: Why are you people doing this?",

      "Bubbles: Dont you love us anymore?",

      "Blossom: Yeah! You act as if you As if you",

      "'Him': Hate you?",

      "Blossom: Yeah. Hate us! W-W-Who said that?",

      "'Him': Why, I did, of course.",

      "Girls: Its 'Him'!",

      "'Him': Right you are, girls!",

      "'Him': And right you are about your loved ones!",

      "Blossom: Take your claws off the Professor!",

      "Bubbles: Whats he ever done to you?",

      "'Him': Oh, its not what hes done to me, but what hes going to do to you!",

      "'Him': As you see, Ive taken all of their love for you and turned",

      "'Him': it into hate!",

      "'Him': Now they will destroy you, and you poor, helpless creatures wont be able to fight back.",

      "Bubbles: Ow!",

      "'Him': Because the Powerpuff Girls would never hurt the ones they love. Oh, no, they wouldnt.",

      "'Him': NOW DESTROY THEM!",

      "Buttercup: All right, that does it!",

      "Buttercup: Come on, you guys. Get up and fight!",

      "Blossom: Buttercup, what are you doing?! We cant hurt the ones we love!",

      "Buttercup: Those people arent our loved ones. Our loved ones would never want to hurt us.",

      "Blossom, Bubbles: Hey, yeah!",

      "Buttercup: Theyre just pawns in His evil scheme.",

      "'Him': Well, you know.",

      "Buttercup: Which means",

      "Girls: Lets get him!",

      "'Him': Uh-oh.",

      "Blossom: Dont ever make us have to do that again!",

      "Buttercup: Or it will be your last!",

      "'Him': Tsk, tsk, tsk. You girls underestimate me. I never give repeat performances. But I assure you... Ill be ba-a-ack!",

      "Blossom: So now you know why we had to do what we did. We all feel really bad and hope that youll forgive us.",

      "Bubbles: Besides, it hurt us a lot more than it hurt you.",

      "Mob: Well, now, we wouldnt say that!",

      "Narrator: Dont worry, we forgive you.",

      "Narrator: Because once again, the day is saved, thanks to the Powerpuff Girls! Oh, nurse... isnt it time for my sponge bath?"
    ]
  },
  {
    "episode": "Buttercrush",
    "dialog": [
      "Narrator: The city of Townsville. A pleasant place to live. Unless you run into",

      "Narrator: the Gangreen Gang! The biggest bunch of belligerent bullies this towns ever seen!",

      "Ace: Well, well! What do we have here?",

      "Kid: Excuse me, mister butcan we have our ball back?",

      "Ace: Mister? Youre talkin to Ace, kid. There are no Misters here at least, I dont think so. Um, Lil Arturo, is your name Mister?",

      "Arturo: No.",

      "Ace: How bout you, Big Billy?",

      "Big Billy: Duhno.",

      "Ace: Grubber?",
      "Grubber: Pbbbbpppppbbbbbt!",
      "Ace: Yeah, I thought so. Hey, is your name Mister, Snake?",

      "Sanford D. Ingleberry: Yes-s-s. I means no.",

      "Ace: Sorry. You three are way off track.",
      "Kid: Wellcan we have our ball back anyway?",
      "Ace: Oh, sure. Why not?",

      "Ace: Hey, boys!",

      "Snake, Arturo, Billy: What is it, Ace?",
      "Ace: I dont think these kids are havin fun.",
      "Lil Arturo: You want us to show them how to have fun?",
      "Ace: Yes, Lil Arturo. Lets show them how to have funGangreen style!",

      "Big Billy: Jungle gym.",

      "Lil Arturo: Hey, look at this!",

      "Blossom: Let the underwear go.",

      "Wedgie kid: The Powerpuff Girls!",

      "Arturo: The Powerpuff Girls?!",

      "Billy: The Powerpuff Girls?!",
      "Snake: The P-P-Powerpuff Girls-s-s?!",
      "Grubber: Pbbbbpppbbbt?!",
      "Ace: The Powerpuff Girls? Snake! What are you doing to that poor child?!",
      "Snake: Butbutyou-s-s said",

      "Blossom: Buttercup!",

      "Ace: Oh, Powerpuff Girls please forgive my foolish friend for his foolish act. For he did not know what he was doin.",

      "Ace: And I know deep inside my heart that he would never do anything like that ever again. What do you say, girls? Will you forgive him? Will you? Please?",

      "Blossom: Okay.",

      "Ace: Thank you.",

      "Narrator: Oh, no! Looks like Buttercup is looking for love in all the wrong places.",

      "Narrator: Next day Townsville Museum of Natural History.",

      "Narrator: Oh, look! The Pokey Oaks Kindergarten class is on a field trip. And so is the Gangreen Gang?! This cant be good.",

      "Billy: Big Billy no get soda.",

      "Snake: I think she needs moneys-s-s.",
      "Arturo: This Mesopotamian vase is probably worth a couple of bucks.",

      "Ace: Slip it in right here, Arturo.",

      "Ace: Now this has gotta be worth at least one soda.",

      "Blossom: Drop that mummy!",
      "Ace, Snake, Arturo, Billy: The Powerpuff Girls!",

      "Blossom: All right, girls. Lets show these creeps how to respect other peoples property!",

      "Ace: Hey. Buttercup, how come you guys always pick on us, huh?",

      "Ace: W-We was only tryin to get a soda.",

      "Ace: Come on, guys, lets am-scray!",

      "Ace: Hey?",

      "Ace: You know, kid, youre not so bad. You can hang out with us anytime.",

      "Narrator: That evening",

      "Narrator: Oh, no!",

      "Narrator: She isnt!",

      "Narrator: She is.",

      "Narrator: I hope she knows what shes doing.",

      "Ace: Hey!",

      "Snake: W-W-W-What-What shes doing here-s-s, Boss-s-s?!",

      "Ace: Back up! Relax!",

      "Ace: Buttercup. Please, come in.",

      "Snake: Is-s-s cant take it anymore! Shes a Powerpuff Girl! Shes good, were bad! The museums, punchings, hittings, hurtings!",

      "Ace: Sweet move, Buttercup.",
      "Arturo: Yeah! Smooth move! You should hang out with us!",
      "Snake: Yes. Please. Hang out.",

      "Ace: Oh, Buttercup! Last night was a hoot! So will you please be my guest again tonight?",

      "Ace: Shut up!",

      "Billy: Gee, Boss, wes was just sayin goodbye to our new best friend.",
      "Ace: She is not your new best friend!",
      "Snake: Hey, then why did we hang out with her, Boss-s-s?",
      "Ace: Dont you realize that with Buttercup on our sideWE COULD CONTROL TOWNSVILLE?!",
      "Arturo: Gee, Ace, what about her sisters?",
      "Ace: Sit for a spell, fellas, cause Ive got a plan.",

      "Narrator: Well, that sounds awful! Evil people with evil plans? I hope the Powerpuff Girls can get out of this one especially Buttercup!",

      "Ace: Shell be here any minute. You all remember what to do?",

      "Ace: Showtime!",

      "Ace: Hey. Please, come in.",

      "Snake: Huh? Oh, right. See you two a little bit laters-s-s.",

      "Ace: Theyll be back... with pizza!",

      "Snake: Come on, s-s-stop laughing! Do it rights-s-s!",

      "Blossom: Bubblesget the phone.",

      "Bubbles: Hello?",

      "Grubber: Oh, hello. Im Buttercup, and my foot got caught in a conveyor belt at the city dump. Im afraid Im stuck. Help me!",

      "Bubbles: Okay. Bye-bye. BUTTERCUPS IN TROUBLE!!!",

      "Grubber: Help me! Help me! My foot is stuck!",

      "Blossom: Dont worry, Buttercup.",

      "Bubbles: Weve got you!",

      "Grubber: Pbbbbbppppt!",

      "Narrator: Thats not Buttercup!",

      "Snake: S-S-Say goodbyes, Powerpuffssss.",

      "Narrator: This is unbelievable! Is this the end of our beloved girls?",

      "Narrator: Can no one save our heroes from this impending doom? Can Buttercup not hear her sisters cries for help?",

      "Narrator: Oh, no! Blossom and Bubbles screams are being drowned out by this rogue Romeos rambunctious rock!",

      "Ace: Arent we havin fun?",

      "Snake: Adios-s-s, dos amigos-s-s!",

      "Ace: Now listen, Buttercup, its not what you think!",

      "Ace: Buttercup, Im innocent! The boys, they put me up to it! Honest!",

      "Blossom: Buttercup... whats been going on?",

      "Buttercup: Im sorry.",

      "Narrator: Aww, we forgive you, Buttercup.",

      "Narrator: And so, once again, the day is saved, thanks to the Powerpuff Girls!"
    ]
  },
  {
    "episode": "Fuzzy logic",
    "dialog": [
      "Narrator: The city of Townsville!",

      "Narrator: A community where random acts of kindness are an everyday occurrence.",

      "Narrator: And where warm, fuzzy smiles grace the faces of everyone you meet. Except some people.",

      "Narrator: Some people who've decided to be far, far away.",

      "Narrator: Some people who don't like visitors.",

      "Narrator: Some people like...",

      "Fuzzy: Hey, you! Get offa my property! Now!",

      "Narrator: Some people like... ...Fuzzy Lumpkins!",

      "Fuzzy: Darn trespassers. I'll get anyone or anything that gets on my property!",

      "Fuzzy: Get offa my property! Nowa!",

      "Fuzzy: Hey! Get offa my property right now!",

      "Fuzzy: Carn sarn it! Anyone else wanna try and get on my property?!",

      "Fuzzy: Good. Hm. Reckon it be time for some old-fashioned relaxation. Yep, yep, yep. Ahh, now let's see.",

      "Fuzzy: Good ol' hat. Check.",

      "Fuzzy: Trusty pipe. Check.",

      "Fuzzy: Jug o' water, check. Boomstick. Che-e-eck!",

      "Fuzzy: Joe. Ch- Joe? Where you at, Joe?! Where is you?! Joe! Joey! J-oh...",

      "Fuzzy: There you is. Hello, Joe.",

      "Fuzzy: Now you stay right 'cheer, Joe... ...where you gonna be safe... ...from all y'alls who wants to get your mitts on my property!",

      "Fuzzy: ...off my property...you better get off my property now, I'm not gonna tell you again...",

      "Fuzzy: Get offa my property!",

      "Fuzzy: Hey! Get offa my property, you ornery varmint!",

      "Fuzzy: Why, you...I'm gonna learn you to get on my property!",

      "Fuzzy: Come back here... ...and get... ...offa... ...my...property!",

      "Narrator: Oh, no! He's heading towards Townsville!",

      "Fuzzy: Where you at, you crazy critter?",

      "Old woman: Oh, my.",

      "Old woman: Excuse me, sonny, but I believe you dropped your hat.",

      "Fuzzy: GET YOUR WRINKLES OFFA MY PROPERTY!!",

      "Man 1: Um...excuse me, sir, but isn't this your -",

      "Man 2: Here's your boot.",

      "Man 3: Your boomstick.",

      "Fuzzy: Stop it, stop it, STOP IT! Stop touchin' my property!",

      "Voice: Hey, pal!",

      "Policeman: So, you like punchin' out old ladies, huh? Well... ...I have one question for you. Is this your hat?",

      "Fuzzy: Y'ALL GET YOUR MITTS OFFA MY PROPERTY!!",

      "Narrator: Oh, no! Fuzzy's gone plumb crazy!",

      "Narrator: Who can stop this wild man on the loose?",

      "Bubbles: It's mine!",

      "Buttercup: It's mine!",

      "Bubbles: No, mine!",

      "Buttercup: Mine!",

      "Bubbles: Mine!",

      "Buttercup: Mine!",

      "Blossom: Girls!",

      "Blossom: What did we say about sharing?",

      "Bubbles: But Buttercup's gonna...",

      "Buttercup: I am not! I just wanna see Octi.",

      "Bubbles: So you can...",

      "Blossom: Bubbles, share with Buttercup.",

      "Bubbles: But...",

      "Bubbles: Okay.",

      "Blossom: Uh-oh! The Mayor!",

      "Bubbles: Don't!",

      "Buttercup: Don't what?",

      "Bubbles: Just don't!",

      "Buttercup: Oh, you mean... ...this!",

      "Bubbles: Ow! Yes!",

      "Blossom: Girls! Trouble! Move out!",

      "Narrator: Hurry, girls! Hurry! You've got to get downtown! It's a mess!",

      "Buttercup: Whoa!",

      "Blossom: What happened here?",

      "Bubbles: Know what? I'll bet it was something bad.",

      "Blossom: Okay. Split up and search for clues!",

      "Blossom: Excuse me...",

      "Buttercup: ...but can you tell us...",

      "Bubbles: ...who did this?",

      "Old woman: Hat... hat... hat.",

      "Man 1: My property, my-my-my-my property. My property, my-my property.",

      "Man 2: Not now! My head hurts!",

      "Man 3: Watch out, he's got a boomstick!",

      "Policeman: I-I-remember... pink.",

      "Blossom: Nobody's making any sense!",

      "Bubbles: Girls!",

      "Bubbles: I think I found someone who can help! Okay. Now just tell 'em what you told me.",

      "Buttercup: She's talking to squirrels again!",

      "Blossom: Quiet, Buttercup! Bubbles! Ask him if he knows who did this.",

      "Bubbles: Yes!",

      "Blossom: Can he take us to them?",

      "Blossom: Come on!",

      "Buttercup: Oh, brother!",

      "Narrator: Go, girls! G- What? Go, squirrel, go!",

      "Fuzzy: Oh, Joe. You always make me feel a whole lot better.",

      "Fuzzy: Huh?",

      "Blossom: Not so fast...",

      "Buttercup: ...Fuzzy...",

      "Bubbles: ...Lumkins!",

      "Blossom: Who are you to come mess up our town?",

      "Fuzzy: GET... ...OFFA... ...MY... ...PROPERTY!!",

      "Fuzzy: Huh?",

      "Fuzzy: NOOOOOOOOOOOOOOO!!!",

      "Fuzzy: OHHHH, NOOOOOOOOOOOOOOO!!!",

      "Buttercup: And I'll do it, too!",

      "Buttercup: Now relax...RELAX! That's it. Now, come and get it. Don't worry. I'll give it to you.",

      "Buttercup: Okay, just a little more. There you go.",

      "Bubbles: Look out, Fuzzy! She's gonna...",

      "Buttercup: Okay, Fuzzy, here you go.",

      "Bubbles: I told you.",

      "Narrator: Way to go, girls...oh, and squirrel!",

      "Narrator: Townsville Prison!",

      "Fuzzy: Well...at least I still got you, Joe.",

      "Cellmate: My property!",

      "Narrator: How do you like that, Mr. No-Share?",

      "Narrator: So once again the day is saved...thanks to the Powerpuff Girls! I get a warm, fuzzy feeling just saying that."
    ]
  },
  {
    "episode": "Geshundfight",
    "dialog": [
      "Narrator: The city of Townsville. A place filled with some of the most brilliant, clever, and ingenious criminal masterminds ever to hatch an evil scheme.",

      "Narrator: Then there's the Amoeba Boys.",

      "Bossman: We did it! We're official criminals!",

      "Junior: Yeah, criminals!",

      "Slim: Yeah!",

      "Bossman: So come on. Let's see it.",

      "Junior: Yeah, let's see it.",

      "Slim: Duh...see it?",

      "Bossman: Yeah, the orange. Let's see the orange.",

      "Junior: Yeah, the orange.",

      "Slim: Oh, that.",

      "Bossman: Yes, that. The orange? The fruit that you stole just now? Let's see it!",

      "Slim: What do you want to see that for?",

      "Bossman: Produce the produce!",

      "Slim: Uh...",

      "Bossman: You didn't take it, did you?",

      "Junior: He didn't take it, Boss!",

      "Slim: I was going to, but...that would be stealing.",

      "Bossman: That's it! I spend months planning that orange heist, and you go and choke at the last minute. Don't you have any backbone, you-",

      "Bossman: Listen! Ooh, that can only mean one thing.",

      "Bossman: Now's our chance to get in real trouble! Hey, Powerpuff Girls!",

      "Blossom: What?",

      "Bossman: Aha! Check it out.",

      "Bossman: Littering!",

      "Blossom: Sorry, guys. You're gonna have to do better than that. Come on, girls. Let's go.",

      "Bossman: No! Wait! So you wanna see a crime, huh?",

      "Blossom: Huh?",

      "Bossman: A real crime?",

      "Blossom: Yeah. Sure. Okay.",

      "Bubbles: Sounds fun!",

      "Buttercup: Oh, brother.",

      "Bossman: Come on, then!",

      "Narrator: Townsville Park. A clean place for clean folks to have good clean fun.",

      "Bossman: Littering!",

      "Blossom: Oh, brother. Look, guys. We've gotta go.",

      "Bossman: No! Wait! Come back! Don't go!",

      "Junior: Yeah! Don't go!",

      "Bossman: Don't move, you mugs. This could be it. The crime of the century!",

      "Slim: Are we in jail yet?",

      "Bossman: Shut up, stupid!",

      "Junior: Yeah, shut up.",

      "Slim: Hey, Boss, I don't feel so good.",

      "Bossman: Gesundheit!",

      "Junior: Yeah, gesundheit.",

      "Mayor: Hello? He-What?...You can't come in?... You're sick? What? Hello?... You're sick too, you can't come in... Hello? Hello...You're sick? Sick! Sick! Everyone's sick! Oh! Ms. Bellum. Thank goodness you're here.",

      "Mayor: The whole town is sick. You've got to do some...",

      "Mayor: Oh, no. Oh, now I've got it too. There's only one thing to do.",

      "Blossom: I'll get it! Yes, Mayor? What's the trouble? Huh? You're sick?... Well, that's too bad, Mr. Mayor, but it doesn't sound like an emergency. Now, tell everyone to get lots of rest and drink plenty of liquids. And only call when there's a real emergency. Remember...the hotline is not a toy.",

      "Kids: ICE CREAM!!",

      "Girls: Ewwwwww!",

      "Blossom: Maybe the Mayor wasn't kidding. Let's go!",

      "Buttercup: Uh-oh. Look!",

      "Bubbles: Everybody's sleeping!",

      "Blossom: No, Bubbles. There's been an outbreak of some terrible disease.",

      "Blossom: We've gotta help these people! Let's move!",

      "Bossman: Hey, Blossom... ...come watch us do a crime.",

      "Blossom: Not now, guys!",

      "Bossman: Uh, Bubbles... ...come watch us do a... ...crime.",

      "Bubbles: Sorry, guys. I gotta go save people and stuff. Oops.",

      "Bossman: Hey, Buttercup...",

      "Buttercup: Buzz off, guys!",

      "Bossman: Okay, we got a crime. Watch!",

      "Blossom: Cut it out, guys! Not now!",

      "Bossman: How 'bout now?",

      "Bossman: Hey, come on. Now?",

      "Junior: Now?",

      "Slim: Now?",

      "Junior: Now?",

      "Bossman: Now?",

      "Slim: Now?",

      "Junior: Now?",

      "Bossman: Now?",

      "Slim: Now?",

      "Buttercup: Will you guys SHUT UP?!",

      "Buttercup: You three are the lousiest, most pathetic criminals ever to walk the street! You stink! We don't ever want to see you again! Get out of town! Don't ever come back! Get out! Get out! GET OUT!!",

      "Blossom, Bubbles: Buttercup!",

      "Buttercup: Well, uh...they made me mad. And they got me sick, too.",

      "Blossom: Yeah, I think I caught it too.",

      "Bubbles: Me too.",

      "Blossom: We'd better go see the Professor.",

      "Narrator: Hurry, girls! Hurry!",

      "Blossom: Professor... Professor, the whole town is...",

      "Professor: Sick. I know. I'm already working on it. I've managed to isolate the virus, but it doesn't conform to any virus ever documented. I believe it's a new strain. Have a look.",

      "Blossom: Professor, those look just like the Amoeba Boys.",

      "Professor: The Amoeba Boys? Hmm. I wonder if now this is only a hunch, but suppose the Amoeba Boys...",

      "Professor: ...were standing in the park next to a 'Keep Off the Grass...' ...sign, in an attempt to break the law... ...when a storm rolled in. Now suppose they stood in the rain all night and caught a... ...cold. That cold could mix with their single-cell anatomy to create a devastating new virus... ...that could then infect all of Townsville.",

      "Professor: Of course, that's only a hunch. Girls! You must find the Amoeba Boys. The antidote is within them! Do you know where they are?",

      "Bubbles: Yes! Buttercup kicked them out of town. And...they left. So...no.",

      "Blossom: We'll find the Amoeba Boys, Professor. Come on!",

      "Narrator: And so the Powerpuff Girls began to search for the hosts... ...of one of the most deadly viruses ever to befall mankind.",

      "Bossman: Hey...hey...wake up. Are youse okay?",

      "Junior: Yeah. Are youse okay?",

      "Blossom: Uh...? The Amoeba Boys?  Oh, you gotta come back with us right away.",

      "Bossman: But I thought we were lousy criminals and you never wanted to see us again.",

      "Blossom: No! That's not true! You three could be the worst criminals in the history of Townsville.",

      "Bossman: Aw, you're just saying that.",

      "Blossom: No, really. We've gotta take you back right away and lock you up.",

      "Bossman: Really?",

      "Blossom: Come on. We gotta go.",

      "Bossman: Wait a minute! Why should I, copper? You're not taking us without a fight!",

      "Junior: Yeah! Without a fight!",

      "Blossom: Oh, come on, guys. We're sick and tired, and...we wanna go home.",

      "Bossman: Oh, please?",

      "Junior: Yeah, please?",

      "Blossom: All right. If we do this, then...will you come home?",

      "Boys: Yeah, yeah, yeah. We promise.",

      "Blossom: All right. Let's...get 'em, girls.",

      "Bossman: Yow!",

      "Bossman: Ow!",

      "Junior: Yeah, ow!",

      "Professor: Here's the antidote.",

      "Girls: Great.",

      "Professor: Okay, Amoeba Boys. Thank you for your cooperation. You're free to go.",

      "Bossman: Go?! I thought we were criminals! You locked us up and everything!",

      "Professor: Well, everything's all right now. Out you go.",

      "Professor: Bye now.",

      "Bossman: I told you, you should have taken the orange!",

      "Narrator: Oh, Amoeba Boys. You're so dumb. But we love you anyway, because...",

      "Narrator: ...once again the day is saved thanks to the Powerpuff Girls! Ah-choo! Excuse me."
    ]
  },
  {
    "episode": "Insect Inside",
    "dialog": [
      "Narrator: The city of Townsville, but enough about that.",

      "Narrator: Here at the Powerpuff Girls suburban home is where our story begins.",

      "Bubbles: Get away, get away, get away, get away, get away, get away!",
      "Buttercup: Ill get it.",

      "Bubbles: Did you get it?",

      "Bubbles: Aaah!",

      "Blossom: Uh-oh. Girls.",

      "Bubbles: Aah! Squish it, squish it, squish, it, squish it, squish it!",
      "Blossom: Buttercup, no. Its just a cockroach.",
      "Buttercup: Shut up, Blossom. Its gross.",
      "Blossom: It is not!",
      "Bubbles: Is too. Squish it, squish it.",
      "Buttercup: You got it, Bubbles. One squished roach coming up.",

      "Blossom: Girls, no. Ew! Gross!",

      "Blossom: Professor, youre touching it.",
      "Buttercup: Oh. Not gross, hmm?",
      "Blossom: Its not. I just wouldnt want to touch it. Blecch!",

      "Professor: Actually, girls, to him, well, youre pretty gross yourselves, with your big heads, large eyes, little bodies...",
      "Girls: Okay.",

      "Professor: You see, the Blattaodea, or more commonly known as the cockroach, may be ugly and disgusting, but theyre also strong and focused creatures and are very important to the balance of nature.",

      "Professor: The cockroach has on Earth for more than 250 million years. And in that time, theyve squished, squashed, stomped, smushed, smashed, and even stepped on.",

      "Professor: But even after centuries of being underfoot, the adaptable cockroach will probably outlive us all, for they are the only creature capable of surviving the effects of radiation.",

      "Professor: So after the world as we know it is no more, the kooky cockroach will be there to start a new race,",

      "Professor: a race of bug people with a million eyes, 16 legs, exoskeletons, feelers, and",

      "Blossom: Professor.",
      "Professor: Sorry. But remember, girls. Its not right to harm an insect just because its yucky on the outside. Its the insect inside thats important. Now, who wants to touch it?",

      "Professor: Ha, ha, ha! Ill get a jar.",

      "Professor: Okay, little guy.",

      "Professor: Youre free to go.",

      "Professor: Come on, girls. Its time for bed.",

      "Narrator: All right, little guy. You heard the Professor. Now scurry on home.",

      "Narrator: Hmm. Something bugs me about that roach. The city of TownsvOh. I said that already. Sorry.",

      "Slob: Stupid people. Look at 'em. What incompetent, unorganized, filthy, dirty creatures.",

      "Slob: Theyve been infesting this planet for too long. YOU HEAR ME, PEOPLE? YOUR DAYS ARE NUMBERED! PREPARE FOR THE COMING OF EARTHS TRUE MASTERS.",

      "Slob: THE REALITY OF YOUR EXTINCTION IS JUST A MATTER OF TIME!",
      "Man #1: Its 8:00.",

      "Slob: Skippy! What can you report?",

      "Slob: Yahoo! We must call in the troops.",

      "Slob: HALT!!!!",

      "Slob: In the past, I felt the one thing that might stand in the way of our complete success is those supercharged heroines, the Powerpuff Girls. But thanks to the brave efforts of Cadet Skippy, we are in possession of what I consider the most vital information to the success of our cause. It seems the Powerpuff Girls think youre icky, gross, disgusting. Theyre afraid of you. They wont touch you. And most importantly, they wont squish you. And with them doing nothing to stop us, all we gotta do is scurry in and smash those disgusting bipeds, and then together, you and I, Roach Coach, will rule the world!",

      "Narrator: Its a beautiful day in Townsville.",

      "Man #2:  Hmm, looks good, Id like to buy a dog ",

      "Vendor: Hmm, it should. Its made from chicken and hog. So, my pal, heres your dog, enjoy. ",

      "Man #2:  Oh, I shall, oh boy, oh, boy, oh boy ",

      "Narrator: Gross, gross, gross! Get them off! Aw, man, this is disgusting! All of Townsville is being infested with roaches!",

      "Mayor: Aah! Aah! Oh, my. Roaches are encroaching on my town!",

      "Mayor: What to do? What to do?",

      "Woman: Excuse me, Mr. Mayor. Dont you think you should make the call?",
      "Mayor: Oh, yes, yes. Good thinking, Ms. Sara Bellum. Call the exterminator.",
      "Woman: No, sir.",

      "Ms. Bellum: The other call.",

      "Bubbles: Hi.",

      "Mayor: Powerpuff Girls?",
      "Bubbles: Bye.",

      "Bubbles: Hi.",

      "Mayor: Emergency!",
      "Bubbles: Bye. Hi.",

      "Mayor: Get downtown!",
      "Bubbles: Bye.",

      "Blossom: Yes, Mayor? What? Gross! Do we have to? Ok. Somethings bugging the town. Lets roll!",

      "Girls: GROSS!!!!",
      "Buttercup: Man, this is disgusting. These bugs got to go.",
      "Blossom: Buttercup, no!",

      "Blossom: Stop! Dont you remember what the Professor told us? He said, and I quote, Its not right to harm an insect just cause its yucky on the outside. Its the insect inside thats important.",
      "Buttercup: Oh? Like, what are you gonna do, put them in a giant jar?",

      "Buttercup: Hey!",
      "Slob: Thats right, fly away. Fly away scared, you stinking Powerpuffs! Huh?",

      "Narrator: A giant jar? Thats crazy.",
      "Roach Coach: NOOOOOOOO!",

      "Narrator: And so with her lightning-fast speed and her knowledge of where to get giant jars, Blossom makes quick work of cleaning up the town.",

      "Woman: Aah! Im bug-free!",
      "Narrator: That you are, lady, and so is the rest of the town, so give it up for The Powerpuff Girls! Yes!",

      "Roach Coach: No fair! How dare you trick my army of roaches with a giant jar?",
      "Blossom: So youre responsible for this mess.",
      "Roach Coach: That I am. I am Roach Coach. I am sick of you human scum infesting the planet! I am here to exterminate!",

      "Blossom: W-W-Whats happening?",

      "Roach Coach: Thats it, boys. Come to papa!",

      "Girls: Uh-oh.",

      "Girls: Not so fast, Roach Coach!",

      "Roach Coach: Annoying Powerpuffs!",

      "Bubbles: Gross, gross, gross, gross, gross, gross, gross, gross, gross, gross, gross, gross.",
      "Buttercup: Please can we squish them now?! Please?!",
      "Blossom: Now, Buttercup, remember, the Professor said not to harm an insect just because its yucky on the outside, but THIS ONES YUTCHY ON THE INSIDE!!!!",

      "Roach Coach: Hey! Youre not allowed to harm my roaches!",

      "Roach Coach: Uh-oh.",

      "Roach Coach: AAAAAAAHHHHH!!!!! CURSE YOU, POWERPUFF GIRLS!!!!!!",

      "Blossom: Oh, no! I definitely know its not okay to squish a person!",
      "Buttercup: No matter how yucky they are on the inside!",
      "Bubbles: Wait. Look.",

      "Buttercup: Whoa. ",
      "Blossom: Hes a robot.",
      "Bubbles: And look.",

      "Bubbles: Theres an insect inside.",
      "Roach: I am not just an insect, I am Roach Coach! I am the future ruler of this planet, you stupid biped!",
      "Bubbles: Who you calling a biped, you little",
      "Blossom: Bubbles, no! Dont squish him! Hes a criminal, and everything has a place in this world, even criminals.",

      "Mayor: Well, girls, thanks again for, Uh",
      "Ms. Bellum: Saving the day, sir.",
      "Mayor: No, no, no. For saving the day.",
      "Blossom: No problem, Mayor.",

      "Blossom: Its all in a days work. It doesnt bug us.",

      "Blossom: Professor, you just squished that spider! Oh, I get it. Better safe than sorry, right?",
      "Professor: No. Spiders just creep me out.",

      "Narrator: Oh, Professor. What are we gonna do with you? Ha, ha, ha! Ah.",

      "Narrator: So once again, the day is saved, thanks to the Powerpuff Girls! Ha, ha, ha! Spiders just creep me out, he says. Oh, jiminy."
    ]
  }
]
