[
  [
    {
      "year": "2010 in film,<small>83rd Academy Awards</small>\n! colspan=\"3\"| Best Sound Mixing",
      "film": "Inception,The King's Speech,Salt (2010 film),The Social Network,True Grit (2010 film),Best Sound Editing,Inception,Toy Story 3,Tron: Legacy,True Grit (2010 film),Unstoppable (2010 film)",
      "nominees": "Lora Hirschberg, Gary Rizzo and Ed Novick,Paul Hamblin, Martin Jensen (sound engineer) and John Midgley,Jeffrey J. Haboush, Greg P. Russell, Scott Millan and William Sarokin,Ren Klyce, David Parker (sound engineer), Michael Semanick and Mark Weingarten,Skip Lievsay, Craig Berkey, Greg Orloff and Peter Kurland,Richard King (sound designer),Tom Myers (sound engineer) and Michael Silvers,Gwendolyn Yates Whittle and Addison Teague,Skip Lievsay and Craig Berkey,Mark Stoeckinger"
    },
    {
      "year": "2011 in film,<small>84th Academy Awards</small>\n! colspan=\"3\"| Best Sound Mixing",
      "film": "Hugo (film),The Girl with the Dragon Tattoo (2011 film),Moneyball (film),Transformers: Dark of the Moon,War Horse (film),Best Sound Editing,Hugo (film),Drive (2011 film),The Girl with the Dragon Tattoo (2011 film),Transformers: Dark of the Moon,War Horse (film)",
      "nominees": "Tom Fleischman and John Midgley,David Parker (sound engineer), Michael Semanick, Ren Klyce and Bo Persson,Deb Adair, Ron Bochar, David Giammarco (sound engineer) and Ed Novick,Greg P. Russell, Gary Summers, Jeffrey J. Haboush and Peter J. Devlin,Gary Rydstrom, Andy Nelson (sound engineer), Tom Johnson (sound engineer) and Stuart Wilson (sound engineer),Eugene Gearty and Philip Stockton,Lon Bender and Victor Ray Ennis,Ren Klyce,Erik Aadahl and Ethan Van der Ryn,Richard Hymns and Gary Rydstrom"
    },
    {
      "year": "2012 in film,<small>85th Academy Awards</small>\n! colspan=\"3\"| Best Sound Mixing",
      "film": "Les Misérables (2012 film),Argo (2012 film),Life of Pi (film),Lincoln (film),Skyfall,Best Sound Editing,Skyfall <small>(TIE)</small>,Zero Dark Thirty <small>(TIE)</small>,Argo (2012 film),Django Unchained,Life of Pi (film)",
      "nominees": "Andy Nelson (sound engineer), Mark Paterson (sound engineer) and Simon Hayes (sound engineer),John T. Reitz, Gregg Rudloff and José Antonio Garcia (sound mixer),Ron Bartlett, Doug Hemphill and Drew Kunin,Andy Nelson (sound engineer), Gary Rydstrom and Ron Judkins,Scott Millan, Greg P. Russell and Stuart Wilson (sound engineer),Per Hallberg and Karen Baker Landers,Paul N. J. Ottosson,Erik Aadahl and Ethan Van der Ryn,Wylie Stateman,Eugene Gearty and Philip Stockton"
    },
    {
      "year": "2013 in film,<small>86th Academy Awards</small>\n! colspan=\"3\"| Best Sound Mixing",
      "film": "Gravity (2013 film),Captain Phillips (film),The Hobbit: The Desolation of Smaug,Inside Llewyn Davis,Lone Survivor,Best Sound Editing,Gravity (2013 film),All Is Lost,Captain Phillips (film),The Hobbit: The Desolation of Smaug,Lone Survivor",
      "nominees": "Skip Lievsay, Niv Adiri, Christopher Benstead and Chris Munro,Chris Burdon, Mark Taylor (sound engineer), Mike Prestwood Smith and Chris Munro,Christopher Boyes, Michael Hedges (sound engineer), Michael Semanick and Tony Johnson (sound engineer),Skip Lievsay, Greg Orloff and Peter Kurland,Andy Koyama, Beau Borders and David Brownlow,Glenn Freemantle,Steve Boeddeker and Richard Hymns,Oliver Tarney,Brent Burge and Chris Ward (sound editor),Wylie Stateman"
    },
    {
      "year": "2014 in film,<small>87th Academy Awards</small>\n! colspan=\"3\"| Best Sound Mixing",
      "film": "Whiplash (2014 film),American Sniper,Birdman (film),Interstellar (film),Unbroken (film),Best Sound Editing,American Sniper,Birdman (film),The Hobbit: The Battle of the Five Armies,Interstellar (film),Unbroken (film)",
      "nominees": "Craig Mann, Ben Wilkins and Thomas Curley (sound engineer),John T. Reitz, Gregg Rudloff and Walt Martin <small>(List of posthumous Academy Award winners and nominees)</small>,Jon Taylor (sound mixer), Frank A. Montaño and Thomas Varga,Gary Rizzo, Gregg Landaker and Mark Weingarten,Jon Taylor (sound mixer), Frank A. Montaño and David Lee (Australian sound engineer),Alan Robert Murray and Bub Asman,Martin Hernández and Aaron Glascock,Brent Burge and Jason Canovas,Richard King (sound designer),Becky Sullivan and Andrew DeCristofaro"
    },
    {
      "year": "2015 in film,<small>88th Academy Awards</small>\n! colspan=\"3\"| Best Sound Mixing",
      "film": "Mad Max: Fury Road,Bridge of Spies (film),The Martian (film),The Revenant (2015 film),Star Wars: The Force Awakens,Best Sound Editing,Mad Max: Fury Road,The Martian (film),The Revenant (2015 film),Sicario (2015 film),Star Wars: The Force Awakens",
      "nominees": "Chris Jenkins (sound engineer), Gregg Rudloff and Ben Osmo,Andy Nelson (sound engineer), Gary Rydstrom and Drew Kunin,Paul Massey (sound engineer), Mark Taylor (sound engineer) and Mac Ruth,Jon Taylor (sound mixer), Frank A. Montaño, Randy Thom and Chris Duesterdiek,Andy Nelson (sound engineer), Christopher Scarabosio and Stuart Wilson (sound engineer),Mark Mangini and David White (sound editor),Oliver Tarney,Martin Hernández and Lon Bender,Alan Robert Murray,Matthew Wood (sound editor) and David Acord"
    },
    {
      "year": "2016 in film,<small>89th Academy Awards</small> , \n! colspan=\"3\"| Best Sound Mixing",
      "film": "Hacksaw Ridge,Arrival (film),La La Land,Rogue One,13 Hours: The Secret Soldiers of Benghazi,Best Sound Editing,Arrival (film),Deepwater Horizon (film),Hacksaw Ridge,La La Land,Sully (film)",
      "nominees": "Kevin O'Connell (sound mixer), Andy Wright (sound engineer), Robert Mackenzie (sound engineer) and Peter Grace (sound engineer),Bernard Gariépy Strobl and Claude La Haye,Andy Nelson (sound engineer), Ai-Ling Lee and Steven A. Morrow,David Parker (sound engineer), Christopher Scarabosio and Stuart Wilson (sound engineer),Gary Summers, Jeffrey J. Haboush and Mac Ruth,Sylvain Bellemare,Wylie Stateman and Renée Tondelli,Robert Mackenzie (sound engineer) and Andy Wright (sound engineer),Ai-Ling Lee and Mildred Iatrou Morgan,Alan Robert Murray and Bub Asman"
    },
    {
      "year": "2017 in film,<small>90th Academy Awards</small>\n! colspan=\"3\"| Best Sound Mixing",
      "film": "Dunkirk (2017 film),Baby Driver,Blade Runner 2049,The Shape of Water,Star Wars: The Last Jedi,Best Sound Editing,Dunkirk (2017 film),Baby Driver,Blade Runner 2049,The Shape of Water,Star Wars: The Last Jedi",
      "nominees": "Gregg Landaker, Gary Rizzo and Mark Weingarten,Julian Slater, Tim Cavagin (sound engineer) and Mary H. Ellis,Ron Bartlett, Doug Hemphill and Mac Ruth,Christian Cooke (sound engineer), Brad Zoern and Glen Gauthier,David Parker (sound engineer), Michael Semanick, Ren Klyce and Stuart Wilson (sound engineer),Richard King (sound designer) and Alex Gibson (sound editor),Julian Slater,Mark Mangini and Theo Green,Nathan Robitaille and Nelson Ferreira (sound editor),Matthew Wood (sound editor) and Ren Klyce"
    },
    {
      "year": "2018 in film,<small>91st Academy Awards</small>\n! colspan=\"3\"| Best Sound Mixing",
      "film": "Bohemian Rhapsody (film),Black Panther (film),First Man (film),Roma (2018 film),A Star Is Born (2018 film),Best Sound Editing,Bohemian Rhapsody (film),Black Panther (film),First Man (film),A Quiet Place (film),Roma (2018 film)",
      "nominees": "Paul Massey (sound engineer), Tim Cavagin (sound engineer) and John Casali (sound engineer),Steve Boeddeker, Brandon Proctor and Peter J. Devlin,Jon Taylor (sound mixer), Frank A. Montaño, Ai-Ling Lee and Mary H. Ellis,Skip Lievsay, Craig Henighan and José Antonio Garcia (sound mixer),Tom Ozanich, Dean Zupancic, Jason Ruder and Steven A. Morrow,John Warhurst (sound editor) and Nina Hartstone (sound editor),Benjamin A. Burtt and Steve Boeddeker,Ai-Ling Lee and Mildred Iatrou Morgan,Ethan Van der Ryn and Erik Aadahl,Sergio Díaz (sound editor) and Skip Lievsay"
    },
    {
      "year": "2019 in film,<small>92nd Academy Awards</small>\n! colspan=\"3\"| Best Sound Mixing",
      "film": "1917 (2019 film),Ad Astra (film),Ford v Ferrari,Joker (2019 film),Once Upon a Time in Hollywood,Best Sound Editing,Ford v Ferrari,Joker (2019 film),1917 (2019 film),Once Upon a Time in Hollywood,Star Wars: The Rise of Skywalker",
      "nominees": "Mark Taylor (sound engineer) and Stuart Wilson (sound engineer),Gary Rydstrom, Tom Johnson (sound engineer) and Mark Ulano,Paul Massey (sound engineer), David Giammarco (sound engineer) and Steven A. Morrow,Tom Ozanich, Dean Zupancic and Tod Maitland,Michael Minkler, Christian P. Minkler and Mark Ulano,Donald Sylvester,Alan Robert Murray,Oliver Tarney and Rachael Tate,Wylie Stateman,Matthew Wood (sound editor) and David Acord"
    }
  ],
  [
    {
      "year": "2020 in film,<small>93rd Academy Awards</small>",
      "film": "Sound of Metal,Greyhound (film),Mank,News of the World (film),Soul (2020 film)",
      "nominees": "Nicolas Becker (sound engineer), Jaime Baksht, Michelle Couttolenc, Carlos Cortés Navarrete and Phillip Bladh,Warren Shaw (sound editor), Michael Minkler, Beau Borders and David Wyman (sound engineer),Ren Klyce, Jeremy Molod, David Parker (sound engineer), Nathan Nance and Drew Kunin,Oliver Tarney, Mike Prestwood Smith, William Miller (sound engineer) and John Pritchett (sound engineer),Ren Klyce, Coya Elliott and David Parker (sound engineer)"
    },
    {
      "year": "2021 in film,<small>94th Academy Awards</small>",
      "film": "Dune (2021 film),Belfast (film),No Time to Die,The Power of the Dog (film),West Side Story (2021 film)",
      "nominees": "Mac Ruth, Mark Mangini, Theo Green, Doug Hemphill and Ron Bartlett,Denise Yarde, Simon Chase, James Mather (sound editor) and Niv Adiri,Simon Hayes (sound engineer), Oliver Tarney, James Harrison (sound editor), Paul Massey (sound engineer) and Mark Taylor (sound engineer),Richard Flynn (sound engineer), Robert Mackenzie (sound engineer) and Tara Webb,Tod A. Maitland, Gary Rydstrom, Brian Chumney, Andy Nelson (sound engineer) and Shawn Murphy (sound engineer)"
    },
    {
      "year": "2022 in film,<small>95th Academy Awards</small>",
      "film": "Top Gun: Maverick,All Quiet on the Western Front (2022 film),Avatar: The Way of Water,The Batman (film),Elvis (2022 film)",
      "nominees": "Mark Weingarten, James H. Mather, Al Nelson (sound engineer), Chris Burdon and Mark Taylor (sound engineer),Viktor Prášil, Frank Kruse, Markus Stemler, Lars Ginzel and Stefan Korte,Julian Howarth, Gwendolyn Yates Whittle, Dick Bernstein, Christopher Boyes, Gary Summers and Michael Hedges (sound engineer),Stuart Wilson (sound engineer), William Files, Douglas Murray and Andy Nelson (sound engineer),David Lee (Australian sound engineer), Wayne Pashley, Andy Nelson (sound engineer) and Michael Keller"
    },
    {
      "year": "2023 in film,<small>96th Academy Awards</small>",
      "film": "The Creator (2023 film),Maestro (2023 film),Mission: Impossible – Dead Reckoning Part One,Oppenheimer (2023 film),The Zone of Interest (film)",
      "nominees": "Ian Voigt, Erik Aadahl, Ethan Van der Ryn, Tom Ozanich and Dean Zupancic,Steven A. Morrow, Richard King (sound designer), Jason Ruder, Tom Ozanich and Dean A. Zupancic,Chris Munro, James H. Mather, Chris Burdon and Mark Taylor (sound engineer),Willie D. Burton, Richard King (sound designer), Gary A. Rizzo and Kevin O'Connell (sound mixer),Tarn Willers and Johnnie Burn"
    }
  ]
]
