[
  [
    {
      "year": "2010 in film,<small>83rd Academy Awards</small>",
      "film": "Inception,Alice in Wonderland (2010 film),Harry Potter and the Deathly Hallows – Part 1,Hereafter (film),Iron Man 2",
      "nominees": "Paul Franklin (visual effects supervisor), Chris Corbould, Andrew Lockley, and Peter Bebb,Ken Ralston, David Schaub, Carey Villegas, and Sean Phillips (visual effects artist),Tim Burke (visual effects supervisor), John Richardson (special effects designer), Christian Manz, and Nicolas Aithadi,Michael Owens (visual effects artist), Bryan Grill, Stephan Trojansky, and Joe Farrell (visual effects artist),Janek Sirrs, Ben Snow, Ged Wright, and Dan Sudick"
    },
    {
      "year": "2011 in film,<small>84th Academy Awards</small>",
      "film": "Hugo (film),Harry Potter and the Deathly Hallows – Part 2,Real Steel,Rise of the Planet of the Apes,Transformers: Dark of the Moon",
      "nominees": "Robert Legato, Joss Williams, Ben Grossmann, and Alex Henning,Tim Burke (visual effects supervisor), David Vickery, Greg Butler (visual effects supervisor), and John Richardson (special effects designer),Erik Nash, John Rosengrant, Danny Gordon Taylor, and Swen Gillberg,Joe Letteri, Dan Lemmon, R. Christopher White, and Daniel Barrett (visual effects supervisor),Scott Farrar, Scott Benza, Matthew E. Butler, and John Frazier"
    },
    {
      "year": "2012 in film,<small>85th Academy Awards</small>",
      "film": "Life of Pi (film),The Hobbit: An Unexpected Journey,The Avengers (2012 film),Prometheus (2012 film),Snow White and the Huntsman",
      "nominees": "Bill Westenhofer, Guillaume Rocheron, Erik-Jan de Boer, and Donald R. Elliott,Joe Letteri, Eric Saindon, David Clayton (visual effects), and R. Christopher White,Janek Sirrs, Jeff White (visual effects), Guy Williams (visual effects), and Dan Sudick,Richard Stammers, Trevor Wood (special effects artist), Charley Henley, and Martin Hill (visual effects artist),Cedric Nicolas-Troyan, Philip Brennan, Neil Corbould, and Michael Dawson"
    },
    {
      "year": "2013 in film,<small>86th Academy Awards</small>",
      "film": "Gravity (2013 film),The Hobbit: The Desolation of Smaug,Iron Man 3,The Lone Ranger (2013 film),Star Trek Into Darkness",
      "nominees": "Tim Webber, Chris Lawrence (visual effects), Dave Shirk, and Neil Corbould,Joe Letteri, Eric Saindon, David Clayton (visual effects), and Eric Reynolds (visual effects),Christopher Townsend, Guy Williams (visual effects), Erik Nash, and Dan Sudick,Tim Alexander (visual effects), Gary Brozenich, Edson Williams, and John Frazier,Roger Guyett, Patrick Tubach, Ben Grossmann, and Burt Dalton"
    },
    {
      "year": "2014 in film,<small>87th Academy Awards</small>",
      "film": "Interstellar (film),Captain America: The Winter Soldier,Dawn of the Planet of the Apes,Guardians of the Galaxy (film),X-Men: Days of Future Past",
      "nominees": "Paul Franklin (visual effects supervisor), Andrew Lockley, Ian Hunter (visual effects supervisor), and Scott R. Fisher,Dan DeLeeuw, Russell Earl, Bryan Grill, and Dan Sudick,Joe Letteri, Dan Lemmon, Daniel Barrett (visual effects supervisor), and Erik Winquist,Stephane Ceretti, Nicolas Aithadi, Jonathan Fawkner, and Paul Corbould,Richard Stammers, Lou Pecora, Tim Crosbie, and Cameron Waldbauer"
    },
    {
      "year": "2015 in film,<small>88th Academy Awards</small>",
      "film": "Ex Machina (film),Mad Max: Fury Road,The Martian (film),The Revenant (2015 film),Star Wars: The Force Awakens",
      "nominees": "Mark Williams Ardington, Sara Bennett, Paul Norris (visual effects), and Andrew Whitehurst,Andrew Jackson (visual effects), Dan Oliver, Andy Williams (visual effects), and Tom Wood (visual effects),Anders Langlands, Chris Lawrence (visual effects), Richard Stammers, and Steven Warner,Richard McBride (visual effects), Matt Shumway, Jason Smith (visual effects), and Cameron Waldbauer,Chris Corbould, Roger Guyett, Patrick Tubach, and Neal Scanlan"
    },
    {
      "year": "2016 in film,<small>89th Academy Awards</small> ,",
      "film": "The Jungle Book (2016 film),Deepwater Horizon (film),Doctor Strange (2016 film),Kubo and the Two Strings,Rogue One",
      "nominees": "Robert Legato, Adam Valdez, Andrew R. Jones, and Dan Lemmon,Craig Hammack, Jason Snell (visual effects artist), Jason Billington, and Burt Dalton,Stephane Ceretti, Richard Bluff, Vincent Cirelli, and Paul Corbould,Steve Emerson (visual effects artist), Oliver Jones (visual effects artist), Brian McLean (visual effects artist), and Brad Schiff,John Knoll, Mohen Leo, Hal Hickel, and Neil Corbould"
    },
    {
      "year": "2017 in film,<small>90th Academy Awards</small> ,",
      "film": "Blade Runner 2049,Guardians of the Galaxy Vol. 2,Kong: Skull Island,Star Wars: The Last Jedi,War for the Planet of the Apes",
      "nominees": "John Nelson (visual effects artist), Gerd Nefzer, Paul Lambert (special effects artist), and Richard R. Hoover,Christopher Townsend, Guy Williams (visual effects), Jonathan Fawkner, and Dan Sudick,Stephen Rosenbaum, Jeff White (visual effects), Scott Benza, and Mike Meinardus,Ben Morris (special effects artist), Mike Mulholland, Neal Scanlan, and Chris Corbould,Joe Letteri, Daniel Barrett (visual effects supervisor), Dan Lemmon, and Joel Whist (visual effects supervisor)"
    },
    {
      "year": "2018 in film,<small>91st Academy Awards</small>",
      "film": "First Man (film),Avengers: Infinity War,Christopher Robin (film),Ready Player One (film),Solo: A Star Wars Story",
      "nominees": "Paul Lambert (special effects artist), Ian Hunter (visual effects supervisor), Tristan Myles (visual effects artist), and J. D. Schwalm,Dan DeLeeuw, Kelly Port, Russell Earl, and Dan Sudick,Chris Lawrence (visual effects), Mike Eames, Theo Jones, and Chris Corbould,Roger Guyett, Grady Cofer, Matthew E. Butler, and Dave Shirk,Rob Bredow, Patrick Tubach, Neal Scanlan, and Dominic Tuohy (special effects artist)"
    },
    {
      "year": "2019 in film,<small>92nd Academy Awards</small>",
      "film": "1917 (2019 film),Avengers: Endgame,The Irishman,The Lion King (2019 film),Star Wars: The Rise of Skywalker",
      "nominees": "Guillaume Rocheron, Greg Butler (visual effects supervisor), and Dominic Tuohy (special effects artist),Dan DeLeeuw, Russell Earl, Matt Aitken (special effects artist), and Dan Sudick,Pablo Helman, Leandro Estebecorena, Nelson Sepulveda-Fauser, and Stephane Grabli,Robert Legato, Adam Valdez, Andrew R. Jones, and Elliot Newman,Roger Guyett, Neal Scanlan, Patrick Tubach, and Dominic Tuohy (special effects artist)"
    }
  ],
  [
    {
      "year": "2020 in film,<small>93rd Academy Awards</small>",
      "film": "Tenet (film),Love and Monsters (film),The Midnight Sky,Mulan (2020 film),The One and Only Ivan (film)",
      "nominees": "Andrew Jackson (visual effects), David Lee (visual effects artist), Andrew Lockley, and Scott R. Fisher,Matt Sloan (visual effects), Genevieve Camilleri, Matt Everitt (animator), and Brian Cox (special effects artist),Matt Kasmir, Chris Lawrence (visual effects), Max Solomon, and David Watkins (special effects artist),Sean Faden, Anders Langlands, Seth Maury, and Steve Ingram,Nick Davis (visual effects supervisor), Greg Fisher, Ben Jones, and Santiago Colomo Martínez"
    },
    {
      "year": "2021 in film,<small>94th Academy Awards</small>",
      "film": "Dune (2021 film),Free Guy,No Time to Die,Shang-Chi and the Legend of the Ten Rings,Spider-Man: No Way Home",
      "nominees": "Paul Lambert (special effects artist), Tristan Myles (visual effects artist), Brian Connor (visual effects artist), and Gerd Nefzer,Swen Gillberg, Bryan Grill, Nikos Kalaitzidis, and Dan Sudick,Charlie Noble (visual effects artist), Joel Green (visual effects artist), Jonathan Fawkner, and Chris Corbould,Christopher Townsend, Joe Farrell (visual effects artist), Sean Noel Walker, and Dan Oliver,Kelly Port, Chris Waegner, Scott Edelstein, and Dan Sudick"
    },
    { "year": "2022 in film,<small>95th Academy Awards</small>" },
    {
      "year": "Avatar: The Way of Water",
      "film": "Joe Letteri, Richard Baneham, Eric Saindon, and Daniel Barrett (visual effects supervisor)"
    },
    {
      "year": "All Quiet on the Western Front (2022 film)",
      "film": "Frank Petzold, Viktor Müller, Markus Frank, and Kamil Jafar"
    },
    {
      "year": "The Batman (film)",
      "film": "Dan Lemmon, Russell Earl, Anders Langlands, and Dominic Tuohy"
    },
    {
      "year": "Black Panther: Wakanda Forever",
      "film": "Geoffrey Baumann, Craig Hammack, R. Christopher White, and Dan Sudick"
    },
    {
      "year": "Top Gun: Maverick",
      "film": "Ryan Tudhope, Seth Hill, Bryan Litson, and Scott R. Fisher"
    },
    { "year": "2023 in film,<small>96th Academy Awards</small>" },
    {
      "year": "The_Creator (2023 film)",
      "film": "Jay Cooper, Ian Comley, Andrew Roberts and Neil Corbould"
    },
    {
      "year": "Godzilla Minus One",
      "film": "Takashi Yamazaki, Kiyoko Shibuya, Masaki Takahashi and Tatsuji Nojima"
    },
    {
      "year": "Guardians of the Galaxy Vol. 3",
      "film": "Stephane Ceretti, Alexis Wajsbrot, Guy Williams (visual effects) and Theo Bialek"
    },
    {
      "year": "Mission: Impossible – Dead Reckoning Part One",
      "film": "Alex Wuttke, Simone Coco, Jeff Sutherland and Neil Corbould"
    },
    {
      "year": "Napoleon (2023 film)",
      "film": "Charley Henley, Luc-Ewen Martin-Fenouillet, Simone Coco and Neil Corbould"
    }
  ]
]
